; ModuleID = 'noir::log'
source_filename = "noir::log"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$.dyn_search = comdat any

$"$ct.int" = comdat any

$"$ct.noir.log.LogType" = comdat any

$"noir.log.LogType$log_prefix" = comdat any

$"$sel.write" = comdat any

$"$ct.anyfault" = comdat any

$"$sel.flush" = comdat any

$"$ct.std.io.File" = comdat any

@.enum.NONE = internal constant [5 x i8] c"NONE\00", align 1
@.enum.DEBUG = internal constant [6 x i8] c"DEBUG\00", align 1
@.enum.WARNING = internal constant [8 x i8] c"WARNING\00", align 1
@.enum.ERROR = internal constant [6 x i8] c"ERROR\00", align 1
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.noir.log.LogType" = linkonce global { i8, i64, ptr, i64, i64, i64, [4 x %"char[]"] } { i8 8, i64 0, ptr null, i64 4, i64 ptrtoint (ptr @"$ct.int" to i64), i64 4, [4 x %"char[]"] [%"char[]" { ptr @.enum.NONE, i64 4 }, %"char[]" { ptr @.enum.DEBUG, i64 5 }, %"char[]" { ptr @.enum.WARNING, i64 7 }, %"char[]" { ptr @.enum.ERROR, i64 5 }] }, comdat, align 8
@.str = private unnamed_addr constant [9 x i8] c"[DEBUG] \00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"[WARNING] \00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stream", linkageName: "noir.log.stream", scope: !2, file: !2, line: 22, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "logging.c3", directory: "C:/Users/thoma/Desktop/c3-sand-in-wasm/src")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "OutStream", size: 128, align: 64, elements: !4, identifier: "OutStream")
!4 = !{!5, !7}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !3, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, baseType: !8, size: 64, align: 64, offset: 64)
!8 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "err_stream", linkageName: "noir.log.err_stream", scope: !2, file: !2, line: 23, type: !3, isLocal: true, isDefinition: true, align: 8)
!11 = !{i32 1, !"CodeView", i32 1}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 2, !"wchar_size", i32 2}
!14 = !{i32 4, !"PIC Level", i32 2}
!15 = !{i32 1, !"uwtable", i32 2}
!16 = !{i32 1, !"MaxTLSAlign", i32 65536}
!17 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !18, splitDebugInlining: false)
!18 = !{!0, !9}
!19 = distinct !DISubprogram(name: "set_out", linkageName: "noir.log.set_out", scope: !2, file: !2, line: 30, type: !20, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !22)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !3}
!22 = !{}
!23 = !DILocalVariable(name: "new_stream", arg: 1, scope: !19, file: !2, line: 30, type: !3)
!24 = !DILocation(line: 30, scope: !19)
!25 = !DILocation(line: 31, scope: !19)
!26 = distinct !DISubprogram(name: "set_err", linkageName: "noir.log.set_err", scope: !2, file: !2, line: 34, type: !20, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !22)
!27 = !DILocalVariable(name: "new_err_stream", arg: 1, scope: !26, file: !2, line: 34, type: !3)
!28 = !DILocation(line: 34, scope: !26)
!29 = !DILocation(line: 35, scope: !26)
!30 = distinct !DISubprogram(name: "log", linkageName: "noir.log.log", scope: !2, file: !2, line: 73, type: !31, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !22)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !42}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !35, identifier: "char[]")
!35 = !{!36, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !34, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !41)
!41 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !43, identifier: "any[]")
!43 = !{!44, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !47, identifier: "any")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, baseType: !8, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !40, size: 64, align: 64, offset: 64)
!51 = !DILocalVariable(name: "fmt", arg: 1, scope: !30, file: !2, line: 73, type: !33)
!52 = !DILocation(line: 73, scope: !30)
!53 = !DILocalVariable(name: "args", arg: 2, scope: !30, file: !2, line: 73, type: !42)
!54 = !DILocalVariable(name: "current", scope: !55, file: !2, line: 540, type: !57, align: 8)
!55 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !56, file: !56, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17, retainedNodes: !22)
!56 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !59, identifier: "std.core.mem.allocator.TempAllocator")
!59 = !{!60, !65, !78, !79, !80}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !58, file: !2, line: 12, baseType: !61, size: 128, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !62, identifier: "Allocator")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !61, baseType: !6, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, baseType: !8, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !58, file: !2, line: 13, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !68, identifier: "std.core.mem.allocator.TempAllocatorPage")
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !67, file: !2, line: 24, baseType: !66, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !67, file: !2, line: 25, baseType: !6, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !67, file: !2, line: 26, baseType: !40, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !67, file: !2, line: 27, baseType: !40, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !67, file: !2, line: 28, baseType: !40, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !2, line: 29, baseType: !75, align: 8, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 0, lowerBound: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !58, file: !2, line: 14, baseType: !40, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !58, file: !2, line: 15, baseType: !40, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !2, line: 16, baseType: !75, align: 8, offset: 320)
!81 = !DILocation(line: 540, scope: !55, inlinedAt: !82)
!82 = !DILocation(line: 57, scope: !83, inlinedAt: !84)
!83 = distinct !DISubprogram(name: "full_log", linkageName: "full_log", scope: !2, file: !2, line: 56, scopeLine: 56, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17, retainedNodes: !22)
!84 = !DILocation(line: 78, scope: !30)
!85 = !DILocation(line: 396, scope: !86, inlinedAt: !81)
!86 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !87, file: !87, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17)
!87 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!88 = !DILocation(line: 398, scope: !89, inlinedAt: !81)
!89 = distinct !DILexicalBlock(scope: !86, file: !87, line: 397, column: 2)
!90 = !DILocation(line: 400, scope: !86, inlinedAt: !81)
!91 = !DILocalVariable(name: "mark", scope: !55, file: !2, line: 546, type: !40, align: 8)
!92 = !DILocation(line: 546, scope: !55, inlinedAt: !82)
!93 = !DILocalVariable(name: "str", scope: !94, file: !2, line: 58, type: !95, align: 8)
!94 = distinct !DILexicalBlock(scope: !83, file: !2, line: 57, column: 12)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !96, align: 8)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!98 = !DILocation(line: 58, scope: !94, inlinedAt: !84)
!99 = !DILocation(line: 59, scope: !94, inlinedAt: !84)
!100 = !DILocation(line: 397, scope: !101, inlinedAt: !99)
!101 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !102, file: !102, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17)
!102 = !DIFile(filename: "dstring.c3", directory: "C:/Program Files/c3c/lib/std/core")
!103 = !DILocation(line: 60, scope: !94, inlinedAt: !84)
!104 = !DILocation(line: 67, scope: !94, inlinedAt: !84)
!105 = !DILocation(line: 68, scope: !94, inlinedAt: !84)
!106 = !DILocation(line: 549, scope: !107, inlinedAt: !82)
!107 = distinct !DILexicalBlock(scope: !55, file: !56, line: 548, column: 2)
!108 = !DILocation(line: 553, scope: !107, inlinedAt: !82)
!109 = distinct !DISubprogram(name: "wlog", linkageName: "noir.log.wlog", scope: !2, file: !2, line: 82, type: !31, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !22)
!110 = !DILocalVariable(name: "fmt", arg: 1, scope: !109, file: !2, line: 82, type: !33)
!111 = !DILocation(line: 82, scope: !109)
!112 = !DILocalVariable(name: "args", arg: 2, scope: !109, file: !2, line: 82, type: !42)
!113 = !DILocalVariable(name: "current", scope: !114, file: !2, line: 540, type: !57, align: 8)
!114 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !56, file: !56, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17, retainedNodes: !22)
!115 = !DILocation(line: 540, scope: !114, inlinedAt: !116)
!116 = !DILocation(line: 57, scope: !117, inlinedAt: !118)
!117 = distinct !DISubprogram(name: "full_log", linkageName: "full_log", scope: !2, file: !2, line: 56, scopeLine: 56, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17, retainedNodes: !22)
!118 = !DILocation(line: 87, scope: !109)
!119 = !DILocation(line: 396, scope: !120, inlinedAt: !115)
!120 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !87, file: !87, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17)
!121 = !DILocation(line: 398, scope: !122, inlinedAt: !115)
!122 = distinct !DILexicalBlock(scope: !120, file: !87, line: 397, column: 2)
!123 = !DILocation(line: 400, scope: !120, inlinedAt: !115)
