; ModuleID = 'std::collections::anylist'
source_filename = "std::collections::anylist"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.collections.anylist.AnyList.new_init = comdat any

$std.collections.anylist.AnyList.init = comdat any

$std.collections.anylist.AnyList.temp_init = comdat any

$std.collections.anylist.AnyList.to_format = comdat any

$std.collections.anylist.AnyList.to_new_string = comdat any

$std.collections.anylist.AnyList.to_string = comdat any

$std.collections.anylist.AnyList.to_tstring = comdat any

$std.collections.anylist.AnyList.free_element = comdat any

$std.collections.anylist.AnyList.copy_pop = comdat any

$std.collections.anylist.AnyList.new_pop = comdat any

$std.collections.anylist.AnyList.temp_pop = comdat any

$std.collections.anylist.AnyList.tcopy_pop = comdat any

$std.collections.anylist.AnyList.pop_retained = comdat any

$std.collections.anylist.AnyList.clear = comdat any

$std.collections.anylist.AnyList.pop_first_retained = comdat any

$std.collections.anylist.AnyList.new_pop_first = comdat any

$std.collections.anylist.AnyList.copy_pop_first = comdat any

$std.collections.anylist.AnyList.tcopy_pop_first = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "anylist.c3", directory: "C:/Program Files/c3c/lib/std/collections")
!8 = distinct !DISubprogram(name: "new_init", linkageName: "std.collections.anylist.AnyList.new_init", scope: !7, file: !7, line: 24, type: !9, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !16, !19}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AnyList*", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnyList", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !13, identifier: "std.collections.anylist.AnyList")
!13 = !{!14, !17, !18, !25}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !7, line: 12, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !12, file: !7, line: 13, baseType: !15, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !12, file: !7, line: 14, baseType: !19, size: 128, align: 64, offset: 128)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !20, identifier: "Allocator")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !19, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !7, line: 15, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !28, identifier: "any")
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !22, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, baseType: !24, size: 64, align: 64, offset: 64)
!31 = !{}
!32 = !DILocation(line: 25, scope: !8)
!33 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 24, type: !11)
!34 = !DILocation(line: 24, scope: !8)
!35 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !8, file: !7, line: 24, type: !15)
!36 = !DILocalVariable(name: "allocator", arg: 3, scope: !8, file: !7, line: 24, type: !19)
!37 = !DILocation(line: 26, scope: !8)
!38 = !DILocation(line: 392, scope: !39, inlinedAt: !37)
!39 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !40, file: !40, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!40 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!41 = distinct !DISubprogram(name: "init", linkageName: "std.collections.anylist.AnyList.init", scope: !7, file: !7, line: 33, type: !42, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!42 = !DISubroutineType(types: !43)
!43 = !{!11, !11, !19, !16}
!44 = !DILocation(line: 34, scope: !41)
!45 = !DILocalVariable(name: "self", arg: 1, scope: !41, file: !7, line: 33, type: !11)
!46 = !DILocation(line: 33, scope: !41)
!47 = !DILocalVariable(name: "allocator", arg: 2, scope: !41, file: !7, line: 33, type: !19)
!48 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !41, file: !7, line: 33, type: !15)
!49 = !DILocation(line: 35, scope: !41)
!50 = !DILocation(line: 36, scope: !41)
!51 = !DILocation(line: 37, scope: !41)
!52 = !DILocalVariable(name: "y", scope: !53, file: !7, line: 1026, type: !15, align: 8)
!53 = distinct !DISubprogram(name: "next_power_of_2", linkageName: "next_power_of_2", scope: !54, file: !54, line: 1024, scopeLine: 1024, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !31)
!54 = !DIFile(filename: "math.c3", directory: "C:/Program Files/c3c/lib/std/math")
!55 = !DILocation(line: 1026, scope: !53, inlinedAt: !56)
!56 = !DILocation(line: 39, scope: !57)
!57 = distinct !DILexicalBlock(scope: !41, file: !7, line: 38, column: 2)
!58 = !DILocation(line: 1027, scope: !53, inlinedAt: !56)
!59 = !DILocation(line: 1027, scope: !60, inlinedAt: !56)
!60 = distinct !DILexicalBlock(scope: !53, file: !54, line: 1027, column: 2)
!61 = !DILocation(line: 1028, scope: !53, inlinedAt: !56)
!62 = !DILocation(line: 40, scope: !57)
!63 = !DILocation(line: 286, scope: !64, inlinedAt: !65)
!64 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !40, file: !40, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!65 = !DILocation(line: 269, scope: !66, inlinedAt: !62)
!66 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !40, file: !40, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!67 = !DILocation(line: 62, scope: !68, inlinedAt: !63)
!68 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !40, file: !40, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!69 = !DILocation(line: 28, scope: !70, inlinedAt: !71)
!70 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !40, file: !40, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!71 = !DILocation(line: 68, scope: !68, inlinedAt: !63)
!72 = !DILocation(line: 44, scope: !73)
!73 = distinct !DILexicalBlock(scope: !41, file: !7, line: 43, column: 2)
!74 = !DILocation(line: 46, scope: !41)
!75 = !DILocation(line: 47, scope: !41)
!76 = distinct !DISubprogram(name: "temp_init", linkageName: "std.collections.anylist.AnyList.temp_init", scope: !7, file: !7, line: 55, type: !77, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!77 = !DISubroutineType(types: !78)
!78 = !{!11, !11, !16}
!79 = !DILocation(line: 56, scope: !76)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !76, file: !7, line: 55, type: !11)
!81 = !DILocation(line: 55, scope: !76)
!82 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !76, file: !7, line: 55, type: !15)
!83 = !DILocation(line: 396, scope: !84, inlinedAt: !85)
!84 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !40, file: !40, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!85 = !DILocation(line: 57, scope: !76)
!86 = !DILocation(line: 398, scope: !87, inlinedAt: !85)
!87 = distinct !DILexicalBlock(scope: !84, file: !40, line: 397, column: 2)
!88 = !DILocation(line: 400, scope: !84, inlinedAt: !85)
!89 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.anylist.AnyList.to_format", scope: !7, file: !7, line: 60, type: !90, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !94, !11, !95}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !93)
!93 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 71, size: 384, align: 64, elements: !97, identifier: "std.io.Formatter")
!97 = !{!98, !99, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !7, line: 73, baseType: !22, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !96, file: !7, line: 74, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 23, baseType: !101, align: 8)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DISubroutineType(types: !103)
!103 = !{!92, !22, !22, !104}
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !7, line: 75, baseType: !106, size: 256, align: 64, offset: 128)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !96, file: !7, line: 75, size: 256, align: 64, elements: !107)
!107 = !{!108, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !7, line: 77, baseType: !109, size: 32, align: 32)
!109 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !106, file: !7, line: 78, baseType: !109, size: 32, align: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !106, file: !7, line: 79, baseType: !109, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !106, file: !7, line: 80, baseType: !15, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !106, file: !7, line: 81, baseType: !92, size: 64, align: 64, offset: 192)
!114 = !DILocation(line: 61, scope: !89)
!115 = !DILocalVariable(name: "self", arg: 1, scope: !89, file: !7, line: 60, type: !11)
!116 = !DILocation(line: 60, scope: !89)
!117 = !DILocalVariable(name: "formatter", arg: 2, scope: !89, file: !7, line: 60, type: !95)
!118 = !DILocation(line: 62, scope: !119)
!119 = distinct !DILexicalBlock(scope: !89, file: !7, line: 62, column: 2)
!120 = !DILocation(line: 65, scope: !121)
!121 = distinct !DILexicalBlock(scope: !119, file: !7, line: 65, column: 4)
!122 = !DILocation(line: 67, scope: !123)
!123 = distinct !DILexicalBlock(scope: !119, file: !7, line: 67, column: 4)
!124 = !DILocalVariable(name: "n", scope: !125, file: !7, line: 69, type: !15, align: 8)
!125 = distinct !DILexicalBlock(scope: !119, file: !7, line: 69, column: 4)
!126 = !DILocation(line: 69, scope: !125)
!127 = !DILocalVariable(name: ".temp", scope: !128, file: !7, line: 70, type: !129, align: 8)
!128 = distinct !DILexicalBlock(scope: !125, file: !7, line: 70, column: 4)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any[]*", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !131, identifier: "any[]")
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !130, baseType: !26, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !130, baseType: !15, size: 64, align: 64, offset: 64)
!134 = !DILocation(line: 70, scope: !128)
!135 = !DILocalVariable(name: ".temp", scope: !128, file: !7, line: 70, type: !15, align: 8)
!136 = !DILocalVariable(name: "i", scope: !137, file: !7, line: 70, type: !15, align: 8)
!137 = distinct !DILexicalBlock(scope: !128, file: !7, line: 71, column: 4)
!138 = !DILocation(line: 70, scope: !137)
!139 = !DILocalVariable(name: "element", scope: !137, file: !7, line: 70, type: !27, align: 8)
!140 = !DILocation(line: 72, scope: !141)
!141 = distinct !DILexicalBlock(scope: !137, file: !7, line: 71, column: 4)
!142 = !DILocation(line: 73, scope: !141)
!143 = !DILocation(line: 75, scope: !125)
!144 = !DILocation(line: 76, scope: !125)
!145 = distinct !DISubprogram(name: "to_new_string", linkageName: "std.collections.anylist.AnyList.to_new_string", scope: !7, file: !7, line: 80, type: !146, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !11, !19}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !150, identifier: "char[]")
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !149, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, baseType: !15, size: 64, align: 64, offset: 64)
!154 = !DILocation(line: 81, scope: !145)
!155 = !DILocalVariable(name: "self", arg: 1, scope: !145, file: !7, line: 80, type: !11)
!156 = !DILocation(line: 80, scope: !145)
!157 = !DILocalVariable(name: "allocator", arg: 2, scope: !145, file: !7, line: 80, type: !19)
!158 = !DILocation(line: 82, scope: !145)
!159 = !DILocation(line: 392, scope: !160, inlinedAt: !158)
!160 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !40, file: !40, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!161 = distinct !DISubprogram(name: "to_string", linkageName: "std.collections.anylist.AnyList.to_string", scope: !7, file: !7, line: 86, type: !146, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!162 = !DILocation(line: 87, scope: !161)
!163 = !DILocalVariable(name: "self", arg: 1, scope: !161, file: !7, line: 86, type: !11)
!164 = !DILocation(line: 86, scope: !161)
!165 = !DILocalVariable(name: "allocator", arg: 2, scope: !161, file: !7, line: 86, type: !19)
!166 = !DILocation(line: 88, scope: !161)
!167 = distinct !DISubprogram(name: "to_tstring", linkageName: "std.collections.anylist.AnyList.to_tstring", scope: !7, file: !7, line: 91, type: !168, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!168 = !DISubroutineType(types: !169)
!169 = !{!148, !11}
!170 = !DILocation(line: 91, scope: !167)
!171 = !DILocalVariable(name: "self", arg: 1, scope: !167, file: !7, line: 91, type: !11)
!172 = distinct !DISubprogram(name: "append_internal", linkageName: "std.collections.anylist.AnyList.append_internal", scope: !7, file: !7, line: 102, type: !173, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !31)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !11, !27}
!175 = !DILocation(line: 103, scope: !172)
!176 = !DILocalVariable(name: "self", arg: 1, scope: !172, file: !7, line: 102, type: !11)
!177 = !DILocation(line: 102, scope: !172)
!178 = !DILocalVariable(name: "element", arg: 2, scope: !172, file: !7, line: 102, type: !27)
!179 = !DILocation(line: 494, scope: !180, inlinedAt: !181)
!180 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !7, file: !7, line: 494, scopeLine: 494, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!181 = !DILocation(line: 104, scope: !172)
!182 = !DILocation(line: 105, scope: !172)
!183 = distinct !DISubprogram(name: "free_element", linkageName: "std.collections.anylist.AnyList.free_element", scope: !7, file: !7, line: 111, type: !173, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!184 = !DILocation(line: 112, scope: !183)
!185 = !DILocalVariable(name: "self", arg: 1, scope: !183, file: !7, line: 111, type: !11)
!186 = !DILocation(line: 111, scope: !183)
!187 = !DILocalVariable(name: "element", arg: 2, scope: !183, file: !7, line: 111, type: !27)
!188 = !DILocation(line: 113, scope: !183)
!189 = !DILocation(line: 101, scope: !190, inlinedAt: !188)
!190 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !40, file: !40, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!191 = !DILocation(line: 105, scope: !190, inlinedAt: !188)
!192 = distinct !DISubprogram(name: "copy_pop", linkageName: "std.collections.anylist.AnyList.copy_pop", scope: !7, file: !7, line: 133, type: !193, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !31)
!193 = !DISubroutineType(types: !194)
!194 = !{!92, !26, !11, !19}
!195 = !DILocation(line: 134, scope: !192)
!196 = !DILocalVariable(name: "self", arg: 1, scope: !192, file: !7, line: 133, type: !11)
!197 = !DILocation(line: 133, scope: !192)
