; ModuleID = 'std::time::datetime'
source_filename = "std::time::datetime"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%TzDateTime = type { %DateTime, i32 }
%DateTime = type { i32, i8, i8, i8, i8, i8, i8, i32, i16, i64 }
%"char[]" = type { ptr, i64 }
%Tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.time.DateTime.to_local = comdat any

$std.time.DateTime.with_gmt_offset = comdat any

$std.time.TzDateTime.with_gmt_offset = comdat any

$std.time.DateTime.to_gmt_offset = comdat any

$std.time.TzDateTime.to_gmt_offset = comdat any

$std.time.DateTime.set_date = comdat any

$std.time.DateTime.set_time = comdat any

$std.time.DateTime.add_seconds = comdat any

$std.time.DateTime.add_minutes = comdat any

$std.time.DateTime.add_hours = comdat any

$std.time.DateTime.add_days = comdat any

$std.time.DateTime.add_weeks = comdat any

$std.time.DateTime.add_years = comdat any

$std.time.DateTime.add_months = comdat any

$std.time.TzDateTime.add_seconds = comdat any

$std.time.TzDateTime.add_minutes = comdat any

$std.time.TzDateTime.add_hours = comdat any

$std.time.TzDateTime.add_days = comdat any

$std.time.TzDateTime.add_weeks = comdat any

$std.time.TzDateTime.add_years = comdat any

$std.time.TzDateTime.add_months = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "datetime.c3", directory: "C:/Program Files/c3c/lib/std/time")
!8 = !{!9, !21}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Month", scope: !10, file: !7, line: 60, baseType: !15, size: 8, align: 8, elements: !36)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "DateTime", scope: !7, file: !7, line: 29, size: 256, align: 64, elements: !11, identifier: "std.time.DateTime")
!11 = !{!12, !14, !16, !17, !18, !19, !20, !30, !31, !33}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "usec", scope: !10, file: !7, line: 31, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !10, file: !7, line: 32, baseType: !15, size: 8, align: 8, offset: 32)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !10, file: !7, line: 33, baseType: !15, size: 8, align: 8, offset: 40)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !10, file: !7, line: 34, baseType: !15, size: 8, align: 8, offset: 48)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !10, file: !7, line: 35, baseType: !15, size: 8, align: 8, offset: 56)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !10, file: !7, line: 36, baseType: !9, size: 8, align: 8, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "weekday", scope: !10, file: !7, line: 37, baseType: !21, size: 8, align: 8, offset: 72)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Weekday", scope: !10, file: !7, line: 49, baseType: !15, size: 8, align: 8, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29}
!23 = !DIEnumerator(name: "MONDAY", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "TUESDAY", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "WEDNESDAY", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "THURSDAY", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "FRIDAY", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "SATURDAY", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "SUNDAY", value: 6, isUnsigned: true)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !10, file: !7, line: 38, baseType: !13, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "year_day", scope: !10, file: !7, line: 39, baseType: !32, size: 16, align: 16, offset: 128)
!32 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !10, file: !7, line: 40, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", scope: !7, file: !7, line: 4, baseType: !35, align: 8)
!35 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!37 = !DIEnumerator(name: "JANUARY", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "FEBRUARY", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "MARCH", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "APRIL", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "MAY", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "JUNE", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "JULY", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "AUGUST", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "SEPTEMBER", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "OCTOBER", value: 9, isUnsigned: true)
!47 = !DIEnumerator(name: "NOVEMBER", value: 10, isUnsigned: true)
!48 = !DIEnumerator(name: "DECEMBER", value: 11, isUnsigned: true)
!49 = distinct !DISubprogram(name: "to_local", linkageName: "std.time.DateTime.to_local", scope: !7, file: !7, line: 36, type: !50, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !56}
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "TzDateTime", scope: !7, file: !7, line: 43, size: 320, align: 64, elements: !53, identifier: "std.time.TzDateTime")
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "date_time", scope: !52, file: !7, line: 45, baseType: !10, size: 256, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "gmt_offset", scope: !52, file: !7, line: 46, baseType: !13, size: 32, align: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DateTime*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !{}
!58 = !DILocation(line: 37, scope: !49)
!59 = !DILocalVariable(name: "self", arg: 1, scope: !49, file: !7, line: 36, type: !56)
!60 = !DILocation(line: 36, scope: !49)
!61 = !DILocalVariable(name: "tm", scope: !49, file: !7, line: 38, type: !62, align: 4)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tm", scope: !7, file: !7, line: 394, size: 288, align: 32, elements: !63, identifier: "libc.Tm")
!63 = !{!64, !66, !67, !68, !69, !70, !71, !72, !73}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !62, file: !7, line: 396, baseType: !65, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !7, file: !7, line: 21, baseType: !13, align: 4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !62, file: !7, line: 397, baseType: !65, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !62, file: !7, line: 398, baseType: !65, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !62, file: !7, line: 399, baseType: !65, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !62, file: !7, line: 400, baseType: !65, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !62, file: !7, line: 401, baseType: !65, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !62, file: !7, line: 402, baseType: !65, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !62, file: !7, line: 403, baseType: !65, size: 32, align: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !62, file: !7, line: 404, baseType: !65, size: 32, align: 32, offset: 256)
!74 = !DILocation(line: 38, scope: !49)
!75 = !DILocalVariable(name: "time_t", scope: !49, file: !7, line: 39, type: !76, align: 8)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !7, file: !7, line: 63, baseType: !35, align: 8)
!77 = !DILocation(line: 39, scope: !49)
!78 = !DILocation(line: 49, scope: !79, inlinedAt: !81)
!79 = distinct !DISubprogram(name: "localtime_r", linkageName: "localtime_r", scope: !80, file: !80, line: 49, scopeLine: 49, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!80 = !DIFile(filename: "win32.c3", directory: "C:/Program Files/c3c/lib/std/libc/os")
!81 = !DILocation(line: 40, scope: !49)
!82 = !DILocalVariable(name: "dt", scope: !49, file: !7, line: 41, type: !52, align: 8)
!83 = !DILocation(line: 41, scope: !49)
!84 = !DILocation(line: 42, scope: !49)
!85 = !DILocation(line: 43, scope: !49)
!86 = !DILocation(line: 44, scope: !49)
!87 = !DILocation(line: 45, scope: !49)
!88 = !DILocation(line: 46, scope: !49)
!89 = !DILocation(line: 47, scope: !49)
!90 = !DILocation(line: 48, scope: !49)
!91 = !DILocation(line: 49, scope: !49)
!92 = !DILocation(line: 50, scope: !49)
!93 = !DILocation(line: 51, scope: !49)
!94 = !DILocalVariable(name: "timezone", scope: !49, file: !7, line: 56, type: !95, align: 4)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLong", scope: !7, file: !7, line: 23, baseType: !13, align: 4)
!96 = !DILocation(line: 56, scope: !49)
!97 = !DILocation(line: 57, scope: !49)
!98 = !DILocation(line: 58, scope: !49)
!99 = !DILocation(line: 60, scope: !49)
!100 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.DateTime.with_gmt_offset", scope: !7, file: !7, line: 69, type: !101, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!101 = !DISubroutineType(types: !102)
!102 = !{!52, !10, !13}
!103 = !DILocalVariable(name: "self", arg: 1, scope: !100, file: !7, line: 69, type: !10)
!104 = !DILocation(line: 69, scope: !100)
!105 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !100, file: !7, line: 69, type: !13)
!106 = !DILocation(line: 67, scope: !107)
!107 = distinct !DILexicalBlock(scope: !100, file: !7, line: 70, column: 1)
!108 = !DILocalVariable(name: "dt", scope: !100, file: !7, line: 71, type: !52, align: 8)
!109 = !DILocation(line: 71, scope: !100)
!110 = !DILocation(line: 72, scope: !100)
!111 = distinct !DISubprogram(name: "with_gmt_offset", linkageName: "std.time.TzDateTime.with_gmt_offset", scope: !7, file: !7, line: 81, type: !112, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!112 = !DISubroutineType(types: !113)
!113 = !{!52, !52, !13}
!114 = !DILocalVariable(name: "self", arg: 1, scope: !111, file: !7, line: 81, type: !52)
!115 = !DILocation(line: 81, scope: !111)
!116 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !111, file: !7, line: 81, type: !13)
!117 = !DILocation(line: 79, scope: !118)
!118 = distinct !DILexicalBlock(scope: !111, file: !7, line: 82, column: 1)
!119 = !DILocation(line: 83, scope: !111)
!120 = !DILocation(line: 84, scope: !111)
!121 = distinct !DISubprogram(name: "to_gmt_offset", linkageName: "std.time.DateTime.to_gmt_offset", scope: !7, file: !7, line: 94, type: !101, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !57)
!122 = !DILocalVariable(name: "self", arg: 1, scope: !121, file: !7, line: 94, type: !10)
!123 = !DILocation(line: 94, scope: !121)
!124 = !DILocalVariable(name: "gmt_offset", arg: 2, scope: !121, file: !7, line: 94, type: !13)
!125 = !DILocation(line: 91, scope: !126)
!126 = distinct !DILexicalBlock(scope: !121, file: !7, line: 95, column: 1)
!127 = !DILocalVariable(name: "dt", scope: !121, file: !7, line: 96, type: !52, align: 8)
!128 = !DILocation(line: 96, scope: !121)
!129 = !DILocation(line: 97, scope: !121)
