; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.temp_parse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.temp_parse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"std.encoding.json.JsonParsingError$EOF" = comdat any

$"std.encoding.json.JsonParsingError$UNEXPECTED_CHARACTER" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_ESCAPE_SEQUENCE" = comdat any

$"std.encoding.json.JsonParsingError$DUPLICATE_MEMBERS" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_NUMBER" = comdat any

$"$ct.std.encoding.json.JsonParsingError" = comdat any

$"$ct.std.encoding.json.JsonContext" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType" = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "json.c3", directory: "C:/Program Files/c3c/lib/std/encoding")
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !10, file: !7, line: 47, baseType: !36, size: 32, align: 32, elements: !37)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !7, file: !7, line: 64, size: 576, align: 64, elements: !11, identifier: "std.encoding.json.JsonContext")
!11 = !{!12, !14, !21, !26, !27, !31, !33, !35}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !10, file: !7, line: 66, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !10, file: !7, line: 67, baseType: !15, size: 128, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !16, identifier: "InStream")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !10, file: !7, line: 68, baseType: !22, size: 128, align: 64, offset: 192)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !18, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !10, file: !7, line: 69, baseType: !9, size: 32, align: 32, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !10, file: !7, line: 70, baseType: !28, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 4, baseType: !29, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 5, baseType: null, align: 1)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !10, file: !7, line: 71, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !10, file: !7, line: 72, baseType: !34, size: 8, align: 8, offset: 512)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, scope: !10, file: !7, line: 73, baseType: !34, size: 8, align: 8, offset: 520)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!38 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!39 = !DIEnumerator(name: "LBRACE", value: 1)
!40 = !DIEnumerator(name: "LBRACKET", value: 2)
!41 = !DIEnumerator(name: "COMMA", value: 3)
!42 = !DIEnumerator(name: "COLON", value: 4)
!43 = !DIEnumerator(name: "RBRACE", value: 5)
!44 = !DIEnumerator(name: "RBRACKET", value: 6)
!45 = !DIEnumerator(name: "STRING", value: 7)
!46 = !DIEnumerator(name: "NUMBER", value: 8)
!47 = !DIEnumerator(name: "TRUE", value: 9)
!48 = !DIEnumerator(name: "FALSE", value: 10)
!49 = !DIEnumerator(name: "NULL", value: 11)
!50 = !DIEnumerator(name: "EOF", value: 12)
!51 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !7, file: !7, line: 18, type: !52, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !56, !71, !22}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !7, file: !7, line: 11, size: 640, align: 128, elements: !59, identifier: "std.collections.object.Object")
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !7, line: 13, baseType: !20, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !58, file: !7, line: 14, baseType: !22, size: 128, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, scope: !58, file: !7, line: 15, baseType: !63, size: 384, align: 128, offset: 256)
!63 = !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !7, line: 15, size: 384, align: 128, elements: !64)
!64 = !{!65, !67, !68, !70, !79, !80, !90}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !63, file: !7, line: 17, baseType: !66, size: 128, align: 128)
!66 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !63, file: !7, line: 18, baseType: !32, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !63, file: !7, line: 19, baseType: !69, size: 8, align: 8)
!69 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !63, file: !7, line: 20, baseType: !71, size: 128, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !73, identifier: "char[]")
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !72, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !72, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !78)
!78 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !63, file: !7, line: 21, baseType: !18, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !63, file: !7, line: 22, baseType: !81, size: 320, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !7, file: !7, line: 466, baseType: !82, align: 8)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !7, file: !7, line: 14, size: 320, align: 64, elements: !83, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !7, line: 16, baseType: !77, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !82, file: !7, line: 17, baseType: !77, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !82, file: !7, line: 18, baseType: !22, size: 128, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !82, file: !7, line: 19, baseType: !88, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !7, file: !7, line: 466, baseType: !57, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !63, file: !7, line: 23, baseType: !91, size: 384, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !7, file: !7, line: 465, baseType: !92, align: 8)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !7, file: !7, line: 10, size: 384, align: 64, elements: !93, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!93 = !{!94, !109, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !92, file: !7, line: 12, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !96, identifier: "Entry*[]")
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !95, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !7, file: !7, line: 502, size: 320, align: 64, elements: !101, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!101 = !{!102, !103, !105, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !100, file: !7, line: 504, baseType: !13, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !7, line: 505, baseType: !104, size: 128, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !7, file: !7, line: 465, baseType: !71, align: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !7, line: 506, baseType: !106, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !7, file: !7, line: 465, baseType: !57, align: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !7, line: 507, baseType: !99, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, baseType: !77, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !92, file: !7, line: 13, baseType: !22, size: 128, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !92, file: !7, line: 14, baseType: !13, size: 32, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !92, file: !7, line: 15, baseType: !13, size: 32, align: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !92, file: !7, line: 16, baseType: !113, size: 32, align: 32, offset: 320)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !{}
!115 = !DILocalVariable(name: "s", arg: 1, scope: !51, file: !7, line: 18, type: !71)
!116 = !DILocation(line: 18, scope: !51)
!117 = !DILocalVariable(name: "allocator", arg: 2, scope: !51, file: !7, line: 18, type: !22)
!118 = !DILocation(line: 20, scope: !51)
!119 = distinct !DISubprogram(name: "temp_parse_string", linkageName: "std.encoding.json.temp_parse_string", scope: !7, file: !7, line: 23, type: !120, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!120 = !DISubroutineType(types: !121)
!121 = !{!54, !56, !71}
!122 = !DILocalVariable(name: "s", arg: 1, scope: !119, file: !7, line: 23, type: !71)
!123 = !DILocation(line: 23, scope: !119)
!124 = !DILocation(line: 25, scope: !119)
!125 = !DILocation(line: 396, scope: !126, inlinedAt: !124)
!126 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !127, file: !127, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!127 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!128 = !DILocation(line: 398, scope: !129, inlinedAt: !124)
!129 = distinct !DILexicalBlock(scope: !126, file: !127, line: 397, column: 2)
!130 = !DILocation(line: 400, scope: !126, inlinedAt: !124)
!131 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !7, file: !7, line: 28, type: !132, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!132 = !DISubroutineType(types: !133)
!133 = !{!54, !56, !15, !22}
!134 = !DILocalVariable(name: "s", arg: 1, scope: !131, file: !7, line: 28, type: !15)
!135 = !DILocation(line: 28, scope: !131)
!136 = !DILocalVariable(name: "allocator", arg: 2, scope: !131, file: !7, line: 28, type: !22)
!137 = !DILocalVariable(name: "buffer", scope: !138, file: !7, line: 488, type: !140, align: 16)
!138 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !139, file: !139, line: 486, scopeLine: 486, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!139 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 4096, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 512, lowerBound: 0)
!143 = !DILocation(line: 488, scope: !138, inlinedAt: !144)
!144 = !DILocation(line: 30, scope: !131)
!145 = !DILocalVariable(name: "allocator", scope: !138, file: !7, line: 489, type: !146, align: 8)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !7, file: !7, line: 3, size: 384, align: 64, elements: !147, identifier: "std.core.mem.allocator.OnStackAllocator")
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !146, file: !7, line: 5, baseType: !22, size: 128, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !7, line: 6, baseType: !72, size: 128, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !146, file: !7, line: 7, baseType: !77, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !146, file: !7, line: 8, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !7, file: !7, line: 12, size: 192, align: 64, elements: !154, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !153, file: !7, line: 14, baseType: !69, size: 8, align: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !7, line: 15, baseType: !152, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !7, line: 16, baseType: !18, size: 64, align: 64, offset: 128)
!158 = !DILocation(line: 489, scope: !138, inlinedAt: !144)
!159 = !DILocation(line: 490, scope: !138, inlinedAt: !144)
!160 = !DILocalVariable(name: "mem", scope: !131, file: !7, line: 30, type: !22, align: 8)
!161 = !DILocation(line: 492, scope: !162, inlinedAt: !144)
!162 = distinct !DILexicalBlock(scope: !138, file: !139, line: 492, column: 2)
!163 = !DILocalVariable(name: "context", scope: !164, file: !7, line: 32, type: !10, align: 8)
!164 = distinct !DILexicalBlock(scope: !131, file: !7, line: 31, column: 2)
!165 = !DILocation(line: 32, scope: !164)
!166 = !DILocalVariable(name: "current", scope: !167, file: !7, line: 540, type: !168, align: 8)
!167 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !139, file: !139, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !170, identifier: "std.core.mem.allocator.TempAllocator")
!170 = !{!171, !172, !185, !186, !187}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !169, file: !7, line: 12, baseType: !22, size: 128, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !169, file: !7, line: 13, baseType: !173, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 22, size: 320, align: 64, elements: !175, identifier: "std.core.mem.allocator.TempAllocatorPage")
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !174, file: !7, line: 24, baseType: !173, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !174, file: !7, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !174, file: !7, line: 26, baseType: !77, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !7, line: 27, baseType: !77, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !174, file: !7, line: 28, baseType: !77, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !7, line: 29, baseType: !182, align: 8, offset: 320)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 0, lowerBound: 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !169, file: !7, line: 14, baseType: !77, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !169, file: !7, line: 15, baseType: !77, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !7, line: 16, baseType: !182, align: 8, offset: 320)
!188 = !DILocation(line: 540, scope: !167, inlinedAt: !189)
!189 = !DILocation(line: 33, scope: !164)
!190 = !DILocation(line: 396, scope: !191, inlinedAt: !188)
!191 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !127, file: !127, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!192 = !DILocation(line: 398, scope: !193, inlinedAt: !188)
!193 = distinct !DILexicalBlock(scope: !191, file: !127, line: 397, column: 2)
!194 = !DILocation(line: 400, scope: !191, inlinedAt: !188)
!195 = !DILocalVariable(name: "original", scope: !167, file: !7, line: 543, type: !168, align: 8)
!196 = !DILocation(line: 543, scope: !167, inlinedAt: !189)
!197 = !DILocation(line: 544, scope: !167, inlinedAt: !189)
!198 = !DILocalVariable(name: "mark", scope: !167, file: !7, line: 546, type: !77, align: 8)
!199 = !DILocation(line: 546, scope: !167, inlinedAt: !189)
!200 = !DILocation(line: 35, scope: !201)
!201 = distinct !DILexicalBlock(scope: !164, file: !7, line: 34, column: 3)
!202 = !DILocation(line: 549, scope: !203, inlinedAt: !189)
!203 = distinct !DILexicalBlock(scope: !167, file: !139, line: 548, column: 2)
!204 = !DILocation(line: 551, scope: !203, inlinedAt: !189)
!205 = !DILocation(line: 491, scope: !206, inlinedAt: !144)
!206 = distinct !DILexicalBlock(scope: !138, file: !139, line: 491, column: 8)
!207 = !DILocation(line: 549, scope: !208, inlinedAt: !189)
!208 = distinct !DILexicalBlock(scope: !167, file: !139, line: 548, column: 2)
!209 = !DILocation(line: 551, scope: !208, inlinedAt: !189)
!210 = !DILocation(line: 491, scope: !211, inlinedAt: !144)
!211 = distinct !DILexicalBlock(scope: !138, file: !139, line: 491, column: 8)
!212 = distinct !DISubprogram(name: "temp_parse", linkageName: "std.encoding.json.temp_parse", scope: !7, file: !7, line: 40, type: !213, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!213 = !DISubroutineType(types: !214)
!214 = !{!54, !56, !15}
!215 = !DILocalVariable(name: "s", arg: 1, scope: !212, file: !7, line: 40, type: !15)
!216 = !DILocation(line: 40, scope: !212)
!217 = !DILocation(line: 396, scope: !218, inlinedAt: !219)
!218 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !127, file: !127, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!219 = !DILocation(line: 42, scope: !212)
!220 = !DILocation(line: 398, scope: !221, inlinedAt: !219)
!221 = distinct !DILexicalBlock(scope: !218, file: !127, line: 397, column: 2)
!222 = !DILocation(line: 400, scope: !218, inlinedAt: !219)
!223 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !7, file: !7, line: 81, type: !224, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!224 = !DISubroutineType(types: !225)
!225 = !{!54, !56, !226, !9}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DILocalVariable(name: "context", arg: 1, scope: !223, file: !7, line: 81, type: !226)
!228 = !DILocation(line: 81, scope: !223)
!229 = !DILocalVariable(name: "token", arg: 2, scope: !223, file: !7, line: 81, type: !9)
!230 = !DILocation(line: 164, scope: !231, inlinedAt: !233)
!231 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !232, file: !232, line: 161, scopeLine: 161, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!232 = !DIFile(filename: "builtin.c3", directory: "C:/Program Files/c3c/lib/std/core")
!233 = !DILocation(line: 85, scope: !234)
!234 = distinct !DILexicalBlock(scope: !235, file: !7, line: 85, column: 18)
!235 = distinct !DILexicalBlock(scope: !223, file: !7, line: 83, column: 2)
!236 = !DILocation(line: 166, scope: !231, inlinedAt: !233)
