; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%CsvRow = type { %"char[][]", %"char[]", %any }
%"char[][]" = type { ptr, i64 }
%CsvReader = type { %any, %"char[]" }

$std.encoding.csv.CsvRow.to_format = comdat any

$std.encoding.csv.CsvRow.len = comdat any

$std.encoding.csv.CsvRow.get_col = comdat any

$std.encoding.csv.CsvReader.init = comdat any

$std.encoding.csv.CsvReader.read_new_row = comdat any

$std.encoding.csv.CsvReader.read_row = comdat any

$std.encoding.csv.CsvReader.read_temp_row = comdat any

$std.encoding.csv.CsvRow.free = comdat any

$std.encoding.csv.CsvReader.skip_row = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.csv.CsvReader" = comdat any

$"$ct.std.encoding.csv.CsvRow" = comdat any

$"$ct.sa$String" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.ulong" = comdat any

$"$sel.read_byte" = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any

$"std.io.IoError$DIR_NOT_EMPTY" = comdat any

$"std.io.IoError$EOF" = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "csv.c3", directory: "C:/Program Files/c3c/lib/std/encoding")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !7, file: !7, line: 18, type: !9, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !16, !40}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !15)
!15 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvRow*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !7, file: !7, line: 11, size: 384, align: 64, elements: !18, identifier: "std.encoding.csv.CsvRow")
!18 = !{!19, !32, !33}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !17, file: !7, line: 13, baseType: !20, size: 128, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !21, identifier: "String[]")
!21 = !{!22, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !20, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !26, identifier: "char[]")
!26 = !{!27, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, baseType: !14, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !20, baseType: !14, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !17, file: !7, line: 14, baseType: !24, size: 128, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !17, file: !7, line: 15, baseType: !34, size: 128, align: 64, offset: 256)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !35, identifier: "Allocator")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !34, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 71, size: 384, align: 64, elements: !42, identifier: "std.io.Formatter")
!42 = !{!43, !44, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !7, line: 73, baseType: !37, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !41, file: !7, line: 74, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 23, baseType: !46, align: 8)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DISubroutineType(types: !48)
!48 = !{!11, !37, !37, !29}
!49 = !DIDerivedType(tag: DW_TAG_member, scope: !41, file: !7, line: 75, baseType: !50, size: 256, align: 64, offset: 128)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !41, file: !7, line: 75, size: 256, align: 64, elements: !51)
!51 = !{!52, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !7, line: 77, baseType: !53, size: 32, align: 32)
!53 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !50, file: !7, line: 78, baseType: !53, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !50, file: !7, line: 79, baseType: !53, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !50, file: !7, line: 80, baseType: !14, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !50, file: !7, line: 81, baseType: !11, size: 64, align: 64, offset: 192)
!58 = !{}
!59 = !DILocation(line: 19, scope: !8)
!60 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 18, type: !16)
!61 = !DILocation(line: 18, scope: !8)
!62 = !DILocalVariable(name: "f", arg: 2, scope: !8, file: !7, line: 18, type: !40)
!63 = !DILocation(line: 20, scope: !8)
!64 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !7, file: !7, line: 23, type: !65, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!65 = !DISubroutineType(types: !66)
!66 = !{!14, !16}
!67 = !DILocation(line: 24, scope: !64)
!68 = !DILocalVariable(name: "self", arg: 1, scope: !64, file: !7, line: 23, type: !16)
!69 = !DILocation(line: 23, scope: !64)
!70 = !DILocation(line: 25, scope: !64)
!71 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !7, file: !7, line: 31, type: !72, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!72 = !DISubroutineType(types: !73)
!73 = !{!24, !16, !15}
!74 = !DILocation(line: 32, scope: !71)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !7, line: 31, type: !16)
!76 = !DILocation(line: 31, scope: !71)
!77 = !DILocalVariable(name: "col", arg: 2, scope: !71, file: !7, line: 31, type: !14)
!78 = !DILocation(line: 29, scope: !79)
!79 = distinct !DILexicalBlock(scope: !71, file: !7, line: 32, column: 1)
!80 = !DILocation(line: 33, scope: !71)
!81 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !7, file: !7, line: 36, type: !82, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !88, !24}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvReader*", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !7, file: !7, line: 5, size: 256, align: 64, elements: !86, identifier: "std.encoding.csv.CsvReader")
!86 = !{!87, !92}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !85, file: !7, line: 7, baseType: !88, size: 128, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !89, identifier: "InStream")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !88, baseType: !37, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, baseType: !39, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !85, file: !7, line: 8, baseType: !24, size: 128, align: 64, offset: 128)
!93 = !DILocation(line: 37, scope: !81)
!94 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !7, line: 36, type: !84)
!95 = !DILocation(line: 36, scope: !81)
!96 = !DILocalVariable(name: "stream", arg: 2, scope: !81, file: !7, line: 36, type: !88)
!97 = !DILocalVariable(name: "separator", arg: 3, scope: !81, file: !7, line: 36, type: !24)
!98 = !DILocation(line: 38, scope: !81)
!99 = !DILocation(line: 39, scope: !81)
!100 = distinct !DISubprogram(name: "read_new_row", linkageName: "std.encoding.csv.CsvReader.read_new_row", scope: !7, file: !7, line: 42, type: !101, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!101 = !DISubroutineType(types: !102)
!102 = !{!11, !16, !85}
!103 = !DILocalVariable(name: "self", arg: 1, scope: !100, file: !7, line: 42, type: !85)
!104 = !DILocation(line: 42, scope: !100)
!105 = !DILocation(line: 44, scope: !100)
!106 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !7, file: !7, line: 50, type: !107, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!107 = !DISubroutineType(types: !108)
!108 = !{!11, !16, !85, !34}
!109 = !DILocalVariable(name: "self", arg: 1, scope: !106, file: !7, line: 50, type: !85)
!110 = !DILocation(line: 50, scope: !106)
!111 = !DILocalVariable(name: "allocator", arg: 2, scope: !106, file: !7, line: 50, type: !34)
!112 = !DILocalVariable(name: "row", scope: !106, file: !7, line: 52, type: !24, align: 8)
!113 = !DILocation(line: 52, scope: !106)
!114 = !DILocalVariable(name: "func", scope: !115, file: !7, line: 62, type: !117, align: 8)
!115 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !116, file: !116, line: 58, scopeLine: 58, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!116 = !DIFile(filename: "io.c3", directory: "C:/Program Files/c3c/lib/std/io")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "read_byte", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DISubroutineType(types: !119)
!119 = !{!11, !28, !37}
!120 = !DILocation(line: 62, scope: !115, inlinedAt: !113)
!121 = !DILocalVariable(name: "val", scope: !115, file: !7, line: 63, type: !29, align: 1)
!122 = !DILocation(line: 63, scope: !115, inlinedAt: !113)
!123 = !DILocation(line: 68, scope: !115, inlinedAt: !113)
!124 = !DILocalVariable(name: "current", scope: !125, file: !7, line: 540, type: !127, align: 8)
!125 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !126, file: !126, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!126 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !129, identifier: "std.core.mem.allocator.TempAllocator")
!129 = !{!130, !131, !144, !145, !146}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !128, file: !7, line: 12, baseType: !34, size: 128, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !128, file: !7, line: 13, baseType: !132, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 22, size: 320, align: 64, elements: !134, identifier: "std.core.mem.allocator.TempAllocatorPage")
!134 = !{!135, !136, !137, !138, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !133, file: !7, line: 24, baseType: !132, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !133, file: !7, line: 25, baseType: !37, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !133, file: !7, line: 26, baseType: !14, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !7, line: 27, baseType: !14, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !133, file: !7, line: 28, baseType: !14, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !7, line: 29, baseType: !141, align: 8, offset: 320)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 0, lowerBound: 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !128, file: !7, line: 14, baseType: !14, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !128, file: !7, line: 15, baseType: !14, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !7, line: 16, baseType: !141, align: 8, offset: 320)
!147 = !DILocation(line: 540, scope: !125, inlinedAt: !148)
!148 = !DILocation(line: 69, scope: !115, inlinedAt: !113)
!149 = !DILocation(line: 396, scope: !150, inlinedAt: !147)
!150 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !151, file: !151, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!151 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!152 = !DILocation(line: 398, scope: !153, inlinedAt: !147)
!153 = distinct !DILexicalBlock(scope: !150, file: !151, line: 397, column: 2)
!154 = !DILocation(line: 400, scope: !150, inlinedAt: !147)
!155 = !DILocalVariable(name: "original", scope: !125, file: !7, line: 543, type: !127, align: 8)
!156 = !DILocation(line: 543, scope: !125, inlinedAt: !148)
!157 = !DILocation(line: 544, scope: !125, inlinedAt: !148)
!158 = !DILocalVariable(name: "mark", scope: !125, file: !7, line: 546, type: !14, align: 8)
!159 = !DILocation(line: 546, scope: !125, inlinedAt: !148)
!160 = !DILocalVariable(name: "str", scope: !161, file: !7, line: 71, type: !162, align: 8)
!161 = distinct !DILexicalBlock(scope: !115, file: !116, line: 70, column: 2)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 4, baseType: !163, align: 8)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 5, baseType: null, align: 1)
!165 = !DILocation(line: 71, scope: !161, inlinedAt: !113)
!166 = !DILocation(line: 72, scope: !161, inlinedAt: !113)
!167 = !DILocation(line: 393, scope: !168, inlinedAt: !166)
!168 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !169, file: !169, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!169 = !DIFile(filename: "dstring.c3", directory: "C:/Program Files/c3c/lib/std/core")
!170 = !DILocation(line: 73, scope: !161, inlinedAt: !113)
!171 = !DILocalVariable(name: "c", scope: !172, file: !7, line: 76, type: !29, align: 1)
!172 = distinct !DILexicalBlock(scope: !173, file: !116, line: 74, column: 3)
!173 = distinct !DILexicalBlock(scope: !161, file: !116, line: 73, column: 3)
!174 = !DILocation(line: 76, scope: !172, inlinedAt: !113)
!175 = !DILocalVariable(name: "err", scope: !172, file: !7, line: 80, type: !11, align: 8)
!176 = !DILocation(line: 80, scope: !172, inlinedAt: !113)
!177 = !DILocation(line: 82, scope: !178, inlinedAt: !113)
!178 = distinct !DILexicalBlock(scope: !172, file: !116, line: 81, column: 4)
!179 = !DILocation(line: 83, scope: !178, inlinedAt: !113)
!180 = !DILocation(line: 549, scope: !181, inlinedAt: !148)
!181 = distinct !DILexicalBlock(scope: !125, file: !126, line: 548, column: 2)
!182 = !DILocation(line: 551, scope: !181, inlinedAt: !148)
!183 = !DILocation(line: 553, scope: !181, inlinedAt: !148)
!184 = !DILocation(line: 85, scope: !172, inlinedAt: !113)
!185 = !DILocation(line: 86, scope: !172, inlinedAt: !113)
!186 = !DILocation(line: 87, scope: !172, inlinedAt: !113)
!187 = !DILocation(line: 89, scope: !161, inlinedAt: !113)
!188 = !DILocation(line: 549, scope: !189, inlinedAt: !148)
!189 = distinct !DILexicalBlock(scope: !125, file: !126, line: 548, column: 2)
!190 = !DILocation(line: 551, scope: !189, inlinedAt: !148)
!191 = !DILocation(line: 553, scope: !189, inlinedAt: !148)
!192 = !DILocation(line: 553, scope: !193, inlinedAt: !148)
!193 = distinct !DILexicalBlock(scope: !125, file: !126, line: 548, column: 2)
!194 = !DILocalVariable(name: "list", scope: !106, file: !7, line: 54, type: !20, align: 8)
!195 = !DILocation(line: 54, scope: !106)
!196 = !DILocation(line: 55, scope: !106)
