; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"char[]" = type { ptr, i64 }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion = type { <4 x float> }
%Quaternion.5 = type { <4 x double> }

$"std.math.vector.float[<2>].towards" = comdat any

$"std.math.vector.float[<3>].towards" = comdat any

$"std.math.vector.float[<4>].towards" = comdat any

$"std.math.vector.double[<2>].towards" = comdat any

$"std.math.vector.double[<3>].towards" = comdat any

$"std.math.vector.double[<4>].towards" = comdat any

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any

$"std.math.vector.double[<3>].transform" = comdat any


!330 = !DILocalVariable(name: "self", arg: 1, scope: !327, file: !7, line: 55, type: !135)
!331 = !DILocation(line: 55, scope: !327)
!332 = !DILocalVariable(name: "a", arg: 2, scope: !327, file: !7, line: 55, type: !134)
!333 = !DILocalVariable(name: "b", arg: 3, scope: !327, file: !7, line: 55, type: !134)
!334 = !DILocalVariable(name: "c", arg: 4, scope: !327, file: !7, line: 55, type: !134)
!335 = !DILocalVariable(name: "v0", scope: !336, file: !7, line: 225, type: !135, align: 32)
!336 = distinct !DISubprogram(name: "barycenter3", linkageName: "barycenter3", scope: !7, file: !7, line: 223, scopeLine: 223, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!337 = !DILocation(line: 225, scope: !336, inlinedAt: !331)
!338 = !DILocalVariable(name: "v1", scope: !336, file: !7, line: 226, type: !135, align: 32)
!339 = !DILocation(line: 226, scope: !336, inlinedAt: !331)
!340 = !DILocalVariable(name: "v2", scope: !336, file: !7, line: 227, type: !135, align: 32)
!341 = !DILocation(line: 227, scope: !336, inlinedAt: !331)
!342 = !DILocalVariable(name: "d00", scope: !336, file: !7, line: 228, type: !107, align: 8)
!343 = !DILocation(line: 228, scope: !336, inlinedAt: !331)
!344 = !DILocation(line: 708, scope: !345, inlinedAt: !343)
!345 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!346 = !DILocation(line: 693, scope: !347, inlinedAt: !344)
!347 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!348 = !DILocalVariable(name: "d01", scope: !336, file: !7, line: 229, type: !107, align: 8)
!349 = !DILocation(line: 229, scope: !336, inlinedAt: !331)
!350 = !DILocation(line: 708, scope: !351, inlinedAt: !349)
!351 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!352 = !DILocation(line: 693, scope: !353, inlinedAt: !350)
!353 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!354 = !DILocalVariable(name: "d11", scope: !336, file: !7, line: 230, type: !107, align: 8)
!355 = !DILocation(line: 230, scope: !336, inlinedAt: !331)
!356 = !DILocation(line: 708, scope: !357, inlinedAt: !355)
!357 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!358 = !DILocation(line: 693, scope: !359, inlinedAt: !356)
!359 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!360 = !DILocalVariable(name: "d20", scope: !336, file: !7, line: 231, type: !107, align: 8)
!361 = !DILocation(line: 231, scope: !336, inlinedAt: !331)
!362 = !DILocation(line: 708, scope: !363, inlinedAt: !361)
!363 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!364 = !DILocation(line: 693, scope: !365, inlinedAt: !362)
!365 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!366 = !DILocalVariable(name: "d21", scope: !336, file: !7, line: 232, type: !107, align: 8)
!367 = !DILocation(line: 232, scope: !336, inlinedAt: !331)
!368 = !DILocation(line: 708, scope: !369, inlinedAt: !367)
!369 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!370 = !DILocation(line: 693, scope: !371, inlinedAt: !368)
!371 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!372 = !DILocalVariable(name: "denom", scope: !336, file: !7, line: 233, type: !107, align: 8)
!373 = !DILocation(line: 233, scope: !336, inlinedAt: !331)
!374 = !DILocalVariable(name: "y", scope: !336, file: !7, line: 234, type: !107, align: 8)
!375 = !DILocation(line: 234, scope: !336, inlinedAt: !331)
!376 = !DILocalVariable(name: "z", scope: !336, file: !7, line: 235, type: !107, align: 8)
!377 = !DILocation(line: 235, scope: !336, inlinedAt: !331)
!378 = !DILocation(line: 236, scope: !336, inlinedAt: !331)
!379 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 57, type: !380, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!380 = !DISubroutineType(types: !381)
!381 = !{!45, !46, !382}
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 512, align: 32, elements: !383, identifier: "std_math_matrix$float$.Matrix4x4")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !7, line: 33, baseType: !385, size: 512, align: 32)
!385 = !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !7, line: 33, size: 512, align: 32, elements: !386)
!386 = !{!387, !407}
!387 = !DIDerivedType(tag: DW_TAG_member, scope: !385, file: !7, line: 35, baseType: !388, size: 512, align: 32)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !385, file: !7, line: 35, size: 512, align: 32, elements: !389)
!389 = !{!390, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !388, file: !7, line: 37, baseType: !391, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 103, baseType: !13, align: 4)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !388, file: !7, line: 37, baseType: !391, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !388, file: !7, line: 37, baseType: !391, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !388, file: !7, line: 37, baseType: !391, size: 32, align: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !388, file: !7, line: 38, baseType: !391, size: 32, align: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !388, file: !7, line: 38, baseType: !391, size: 32, align: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !388, file: !7, line: 38, baseType: !391, size: 32, align: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !388, file: !7, line: 38, baseType: !391, size: 32, align: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !388, file: !7, line: 39, baseType: !391, size: 32, align: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !388, file: !7, line: 39, baseType: !391, size: 32, align: 32, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !388, file: !7, line: 39, baseType: !391, size: 32, align: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !388, file: !7, line: 39, baseType: !391, size: 32, align: 32, offset: 352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !388, file: !7, line: 40, baseType: !391, size: 32, align: 32, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !388, file: !7, line: 40, baseType: !391, size: 32, align: 32, offset: 416)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !388, file: !7, line: 40, baseType: !391, size: 32, align: 32, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !388, file: !7, line: 40, baseType: !391, size: 32, align: 32, offset: 480)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !385, file: !7, line: 42, baseType: !408, size: 512, align: 32)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 32, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 16, lowerBound: 0)
!411 = !DILocalVariable(name: "self", arg: 1, scope: !379, file: !7, line: 57, type: !46)
!412 = !DILocation(line: 57, scope: !379)
!413 = !DILocalVariable(name: "mat", arg: 2, scope: !379, file: !7, line: 57, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 107, baseType: !382, align: 4)
!415 = !DILocation(line: 149, scope: !416, inlinedAt: !412)
!416 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!417 = !DILocation(line: 148, scope: !416, inlinedAt: !412)
!418 = !DILocation(line: 150, scope: !416, inlinedAt: !412)
!419 = !DILocation(line: 151, scope: !416, inlinedAt: !412)
!420 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 58, type: !421, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!421 = !DISubroutineType(types: !422)
!422 = !{!134, !135, !423}
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 1024, align: 64, elements: !424, identifier: "std_math_matrix$double$.Matrix4x4")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !7, line: 33, baseType: !426, size: 1024, align: 64)
!426 = !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !7, line: 33, size: 1024, align: 64, elements: !427)
!427 = !{!428, !448}
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !426, file: !7, line: 35, baseType: !429, size: 1024, align: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !426, file: !7, line: 35, size: 1024, align: 64, elements: !430)
!430 = !{!431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !429, file: !7, line: 37, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 104, baseType: !107, align: 8)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !429, file: !7, line: 37, baseType: !432, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !429, file: !7, line: 37, baseType: !432, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !429, file: !7, line: 37, baseType: !432, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !429, file: !7, line: 38, baseType: !432, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !429, file: !7, line: 38, baseType: !432, size: 64, align: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !429, file: !7, line: 38, baseType: !432, size: 64, align: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !429, file: !7, line: 38, baseType: !432, size: 64, align: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !429, file: !7, line: 39, baseType: !432, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !429, file: !7, line: 39, baseType: !432, size: 64, align: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !429, file: !7, line: 39, baseType: !432, size: 64, align: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !429, file: !7, line: 39, baseType: !432, size: 64, align: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !429, file: !7, line: 40, baseType: !432, size: 64, align: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !429, file: !7, line: 40, baseType: !432, size: 64, align: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !429, file: !7, line: 40, baseType: !432, size: 64, align: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !429, file: !7, line: 40, baseType: !432, size: 64, align: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !426, file: !7, line: 42, baseType: !449, size: 1024, align: 64)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1024, align: 64, elements: !409)
!450 = !DILocalVariable(name: "self", arg: 1, scope: !420, file: !7, line: 58, type: !135)
!451 = !DILocation(line: 58, scope: !420)
!452 = !DILocalVariable(name: "mat", arg: 2, scope: !420, file: !7, line: 58, type: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 108, baseType: !423, align: 8)
!454 = !DILocation(line: 149, scope: !455, inlinedAt: !451)
!455 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!456 = !DILocation(line: 148, scope: !455, inlinedAt: !451)
!457 = !DILocation(line: 150, scope: !455, inlinedAt: !451)
!458 = !DILocation(line: 151, scope: !455, inlinedAt: !451)
!459 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 60, type: !460, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!460 = !DISubroutineType(types: !461)
!461 = !{!13, !46, !46}
!462 = !DILocalVariable(name: "self", arg: 1, scope: !459, file: !7, line: 60, type: !46)
!463 = !DILocation(line: 60, scope: !459)
!464 = !DILocalVariable(name: "v2", arg: 2, scope: !459, file: !7, line: 60, type: !45)
!465 = !DILocalVariable(name: "len", scope: !466, file: !7, line: 158, type: !13, align: 4)
!466 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!467 = !DILocation(line: 158, scope: !466, inlinedAt: !463)
!468 = !DILocation(line: 665, scope: !469, inlinedAt: !470)
!469 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!470 = !DILocation(line: 666, scope: !471, inlinedAt: !467)
!471 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !28, file: !28, line: 666, scopeLine: 666, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!472 = !DILocation(line: 650, scope: !473, inlinedAt: !468)
!473 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!474 = !DILocalVariable(name: "dot", scope: !466, file: !7, line: 159, type: !13, align: 4)
!475 = !DILocation(line: 159, scope: !466, inlinedAt: !463)
!476 = !DILocation(line: 665, scope: !477, inlinedAt: !475)
!477 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!478 = !DILocation(line: 650, scope: !479, inlinedAt: !476)
!479 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!480 = !DILocation(line: 176, scope: !481, inlinedAt: !482)
!481 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !28, file: !28, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!482 = !DILocation(line: 160, scope: !466, inlinedAt: !463)
!483 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 61, type: !484, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!484 = !DISubroutineType(types: !485)
!485 = !{!107, !135, !135}
!486 = !DILocalVariable(name: "self", arg: 1, scope: !483, file: !7, line: 61, type: !135)
!487 = !DILocation(line: 61, scope: !483)
!488 = !DILocalVariable(name: "v2", arg: 2, scope: !483, file: !7, line: 61, type: !134)
!489 = !DILocalVariable(name: "len", scope: !490, file: !7, line: 158, type: !107, align: 8)
!490 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!491 = !DILocation(line: 158, scope: !490, inlinedAt: !487)
!492 = !DILocation(line: 708, scope: !493, inlinedAt: !494)
!493 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!494 = !DILocation(line: 709, scope: !495, inlinedAt: !491)
!495 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !28, file: !28, line: 709, scopeLine: 709, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!496 = !DILocation(line: 693, scope: !497, inlinedAt: !492)
!497 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!498 = !DILocalVariable(name: "dot", scope: !490, file: !7, line: 159, type: !107, align: 8)
!499 = !DILocation(line: 159, scope: !490, inlinedAt: !487)
!500 = !DILocation(line: 708, scope: !501, inlinedAt: !499)
!501 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!502 = !DILocation(line: 693, scope: !503, inlinedAt: !500)
!503 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!504 = !DILocation(line: 178, scope: !505, inlinedAt: !506)
!505 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !28, file: !28, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!506 = !DILocation(line: 160, scope: !490, inlinedAt: !487)
!507 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 63, type: !43, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!508 = !DILocalVariable(name: "self", arg: 1, scope: !507, file: !7, line: 63, type: !46)
!509 = !DILocation(line: 63, scope: !507)
!510 = !DILocalVariable(name: "n", arg: 2, scope: !507, file: !7, line: 63, type: !45)
!511 = !DILocalVariable(name: "r", arg: 3, scope: !507, file: !7, line: 63, type: !13)
!512 = !DILocalVariable(name: "dot", scope: !513, file: !7, line: 241, type: !13, align: 4)
!513 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!514 = !DILocation(line: 241, scope: !513, inlinedAt: !509)
!515 = !DILocation(line: 665, scope: !516, inlinedAt: !514)
!516 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!517 = !DILocation(line: 650, scope: !518, inlinedAt: !515)
!518 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!519 = !DILocalVariable(name: "d", scope: !513, file: !7, line: 242, type: !13, align: 4)
!520 = !DILocation(line: 242, scope: !513, inlinedAt: !509)
!521 = !DILocation(line: 244, scope: !513, inlinedAt: !509)
!522 = !DILocation(line: 25, scope: !523, inlinedAt: !524)
!523 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !38, file: !38, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!524 = !DILocation(line: 537, scope: !525, inlinedAt: !521)
!525 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !28, file: !28, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!526 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 64, type: !132, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!527 = !DILocalVariable(name: "self", arg: 1, scope: !526, file: !7, line: 64, type: !135)
!528 = !DILocation(line: 64, scope: !526)
!529 = !DILocalVariable(name: "n", arg: 2, scope: !526, file: !7, line: 64, type: !134)
!530 = !DILocalVariable(name: "r", arg: 3, scope: !526, file: !7, line: 64, type: !107)
!531 = !DILocalVariable(name: "dot", scope: !532, file: !7, line: 241, type: !107, align: 8)
!532 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!533 = !DILocation(line: 241, scope: !532, inlinedAt: !528)
!534 = !DILocation(line: 708, scope: !535, inlinedAt: !533)
!535 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!536 = !DILocation(line: 693, scope: !537, inlinedAt: !534)
!537 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!538 = !DILocalVariable(name: "d", scope: !532, file: !7, line: 242, type: !107, align: 8)
!539 = !DILocation(line: 242, scope: !532, inlinedAt: !528)
!540 = !DILocation(line: 244, scope: !532, inlinedAt: !528)
!541 = !DILocation(line: 25, scope: !542, inlinedAt: !543)
!542 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !38, file: !38, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!543 = !DILocation(line: 537, scope: !544, inlinedAt: !540)
!544 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !28, file: !28, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!545 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 72, type: !546, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!546 = !DISubroutineType(types: !547)
!547 = !{!45, !46, !548}
!548 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 128, align: 128, elements: !549, identifier: "std_math_quaternion$float$.Quaternion")
!549 = !{!550, !558}
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !548, file: !7, line: 5, baseType: !551, size: 128, align: 128)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !548, file: !7, line: 5, size: 128, align: 128, elements: !552)
!552 = !{!553, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !551, file: !7, line: 7, baseType: !554, size: 32, align: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 98, baseType: !13, align: 4)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !551, file: !7, line: 7, baseType: !554, size: 32, align: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !551, file: !7, line: 7, baseType: !554, size: 32, align: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !551, file: !7, line: 7, baseType: !554, size: 32, align: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !548, file: !7, line: 9, baseType: !76, size: 128, align: 128)
!559 = !DILocalVariable(name: "self", arg: 1, scope: !545, file: !7, line: 72, type: !46)
!560 = !DILocation(line: 72, scope: !545)
!561 = !DILocalVariable(name: "q", arg: 2, scope: !545, file: !7, line: 72, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 98, baseType: !548, align: 16)
!563 = !DILocation(line: 173, scope: !564, inlinedAt: !560)
!564 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!565 = !DILocation(line: 174, scope: !564, inlinedAt: !560)
!566 = !DILocation(line: 175, scope: !564, inlinedAt: !560)
!567 = !DILocation(line: 172, scope: !564, inlinedAt: !560)
!568 = !DILocation(line: 176, scope: !564, inlinedAt: !560)
!569 = !DILocation(line: 177, scope: !564, inlinedAt: !560)
!570 = !DILocation(line: 178, scope: !564, inlinedAt: !560)
!571 = !DILocation(line: 179, scope: !564, inlinedAt: !560)
!572 = !DILocation(line: 180, scope: !564, inlinedAt: !560)
!573 = !DILocation(line: 181, scope: !564, inlinedAt: !560)
!574 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 73, type: !575, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!575 = !DISubroutineType(types: !576)
!576 = !{!134, !135, !577}
!577 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 256, align: 256, elements: !578, identifier: "std_math_quaternion$double$.Quaternion")
!578 = !{!579, !587}
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !7, line: 5, baseType: !580, size: 256, align: 256)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !577, file: !7, line: 5, size: 256, align: 256, elements: !581)
!581 = !{!582, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !580, file: !7, line: 7, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 99, baseType: !107, align: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !580, file: !7, line: 7, baseType: !583, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !580, file: !7, line: 7, baseType: !583, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !580, file: !7, line: 7, baseType: !583, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !577, file: !7, line: 9, baseType: !163, size: 256, align: 256)
!588 = !DILocalVariable(name: "self", arg: 1, scope: !574, file: !7, line: 73, type: !135)
!589 = !DILocation(line: 73, scope: !574)
!590 = !DILocalVariable(name: "q", arg: 2, scope: !574, file: !7, line: 73, type: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 99, baseType: !577, align: 32)
!592 = !DILocation(line: 173, scope: !593, inlinedAt: !589)
!593 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!594 = !DILocation(line: 174, scope: !593, inlinedAt: !589)
!595 = !DILocation(line: 175, scope: !593, inlinedAt: !589)
!596 = !DILocation(line: 172, scope: !593, inlinedAt: !589)
!597 = !DILocation(line: 176, scope: !593, inlinedAt: !589)
!598 = !DILocation(line: 177, scope: !593, inlinedAt: !589)
!599 = !DILocation(line: 178, scope: !593, inlinedAt: !589)
!600 = !DILocation(line: 179, scope: !593, inlinedAt: !589)
!601 = !DILocation(line: 180, scope: !593, inlinedAt: !589)
!602 = !DILocation(line: 181, scope: !593, inlinedAt: !589)
!603 = distinct !DISubprogram(name: "rotate_axis", linkageName: "std.math.vector.float[<3>].rotate_axis", scope: !7, file: !7, line: 75, type: !43, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!604 = !DILocalVariable(name: "self", arg: 1, scope: !603, file: !7, line: 75, type: !46)
!605 = !DILocation(line: 75, scope: !603)
!606 = !DILocalVariable(name: "axis", arg: 2, scope: !603, file: !7, line: 75, type: !45)
!607 = !DILocalVariable(name: "angle", arg: 3, scope: !603, file: !7, line: 75, type: !13)
!608 = !DILocalVariable(name: "len", scope: !609, file: !7, line: 615, type: !13, align: 4)
!609 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !28, file: !28, line: 613, scopeLine: 613, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!610 = !DILocation(line: 615, scope: !609, inlinedAt: !611)
!611 = !DILocation(line: 668, scope: !612, inlinedAt: !613)
!612 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !28, file: !28, line: 668, scopeLine: 668, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!613 = !DILocation(line: 187, scope: !614, inlinedAt: !605)
!614 = distinct !DISubprogram(name: "rotate_axis_angle", linkageName: "rotate_axis_angle", scope: !7, file: !7, line: 185, scopeLine: 185, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!615 = !DILocation(line: 665, scope: !616, inlinedAt: !617)
!616 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !28, file: !28, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!617 = !DILocation(line: 666, scope: !618, inlinedAt: !610)
!618 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !28, file: !28, line: 666, scopeLine: 666, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!619 = !DILocation(line: 650, scope: !620, inlinedAt: !615)
!620 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !28, file: !28, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!621 = !DILocation(line: 616, scope: !609, inlinedAt: !611)
!622 = !DILocation(line: 617, scope: !609, inlinedAt: !611)
!623 = !DILocation(line: 189, scope: !614, inlinedAt: !605)
!624 = !DILocalVariable(name: "w", scope: !614, file: !7, line: 190, type: !46, align: 16)
!625 = !DILocation(line: 190, scope: !614, inlinedAt: !605)
!626 = !DILocation(line: 25, scope: !627, inlinedAt: !628)
