; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$"std.core.builtin.IteratorResult$NO_MORE_ELEMENT" = comdat any

$"$ct.std.core.builtin.IteratorResult" = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"std.core.builtin.CastResult$TYPE_MISMATCH" = comdat any

$"$ct.std.core.builtin.CastResult" = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 114, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "builtin.c3", directory: "C:/Program Files/c3c/lib/std/core")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 135, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 133, baseType: !7, align: 8)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10, !19}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !12, identifier: "char[]")
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !18)
!18 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 396, type: !22, isLocal: false, isDefinition: true, align: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 395, baseType: !23, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 400, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{i32 1, !"CodeView", i32 1}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 2, !"wchar_size", i32 2}
!30 = !{i32 4, !"PIC Level", i32 2}
!31 = !{i32 1, !"uwtable", i32 2}
!32 = !{i32 1, !"MaxTLSAlign", i32 65536}
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !34, splitDebugInlining: false)
!34 = !{!0, !4, !20, !24}
!35 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 137, type: !36, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !10, !10, !10, !19, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !23, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !17, size: 64, align: 64, offset: 64)
!48 = !{}
!49 = !DILocalVariable(name: "fmt", arg: 1, scope: !35, file: !2, line: 137, type: !10)
!50 = !DILocation(line: 137, scope: !35)
!51 = !DILocalVariable(name: "file", arg: 2, scope: !35, file: !2, line: 137, type: !10)
!52 = !DILocalVariable(name: "function", arg: 3, scope: !35, file: !2, line: 137, type: !10)
!53 = !DILocalVariable(name: "line", arg: 4, scope: !35, file: !2, line: 137, type: !19)
!54 = !DILocalVariable(name: "args", arg: 5, scope: !35, file: !2, line: 137, type: !38)
!55 = !DILocation(line: 139, scope: !35)
!56 = !DILocation(line: 208, scope: !57, inlinedAt: !59)
!57 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!58 = !DIFile(filename: "io.c3", directory: "C:/Program Files/c3c/lib/std/io")
!59 = !DILocation(line: 141, scope: !60)
!60 = distinct !DILexicalBlock(scope: !35, file: !2, line: 140, column: 2)
!61 = !DILocation(line: 118, scope: !62, inlinedAt: !56)
!62 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!63 = !DILocation(line: 218, scope: !64, inlinedAt: !65)
!64 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !58, file: !58, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!65 = !DILocation(line: 142, scope: !60)
!66 = !DILocalVariable(name: "len", scope: !67, file: !2, line: 174, type: !17, align: 8)
!67 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !58, file: !58, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!68 = !DILocation(line: 174, scope: !67, inlinedAt: !63)
!69 = !DILocation(line: 118, scope: !70, inlinedAt: !68)
!70 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!71 = !DILocation(line: 175, scope: !67, inlinedAt: !63)
!72 = !DILocation(line: 180, scope: !67, inlinedAt: !63)
!73 = !DILocation(line: 182, scope: !67, inlinedAt: !63)
!74 = !DILocation(line: 143, scope: !60)
!75 = !DILocation(line: 145, scope: !35)
!76 = !DILocalVariable(name: "buffer", scope: !77, file: !2, line: 488, type: !79, align: 16)
!77 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !78, file: !78, line: 486, scopeLine: 486, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!78 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 512, lowerBound: 0)
!82 = !DILocation(line: 488, scope: !77, inlinedAt: !83)
!83 = !DILocation(line: 146, scope: !35)
!84 = !DILocalVariable(name: "allocator", scope: !77, file: !2, line: 489, type: !85, align: 8)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !86, identifier: "std.core.mem.allocator.OnStackAllocator")
!86 = !{!87, !92, !93, !94}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !85, file: !2, line: 5, baseType: !88, size: 128, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !89, identifier: "Allocator")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !88, baseType: !23, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, baseType: !46, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !2, line: 6, baseType: !11, size: 128, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !85, file: !2, line: 7, baseType: !17, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !85, file: !2, line: 8, baseType: !95, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !97, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !96, file: !2, line: 14, baseType: !3, size: 8, align: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !2, line: 15, baseType: !95, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !2, line: 16, baseType: !23, size: 64, align: 64, offset: 128)
!101 = !DILocation(line: 489, scope: !77, inlinedAt: !83)
!102 = !DILocation(line: 490, scope: !77, inlinedAt: !83)
!103 = !DILocalVariable(name: "allocator", scope: !35, file: !2, line: 146, type: !88, align: 8)
!104 = !DILocation(line: 492, scope: !105, inlinedAt: !83)
!105 = distinct !DILexicalBlock(scope: !77, file: !78, line: 492, column: 2)
!106 = !DILocalVariable(name: "s", scope: !107, file: !2, line: 148, type: !108, align: 8)
!107 = distinct !DILexicalBlock(scope: !35, file: !2, line: 147, column: 2)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !109, align: 8)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!111 = !DILocation(line: 148, scope: !107)
!112 = !DILocation(line: 149, scope: !107)
!113 = !DILocation(line: 150, scope: !107)
!114 = !DILocation(line: 151, scope: !107)
!115 = !DILocation(line: 152, scope: !107)
!116 = !DILocation(line: 491, scope: !117, inlinedAt: !83)
!117 = distinct !DILexicalBlock(scope: !77, file: !78, line: 491, column: 8)
!118 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 64, type: !119, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!119 = !DISubroutineType(types: !120)
!120 = !{!3, !10, !26}
!121 = !DILocalVariable(name: "message", arg: 1, scope: !118, file: !2, line: 64, type: !10)
!122 = !DILocation(line: 64, scope: !118)
!123 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !118, file: !2, line: 64, type: !26)
!124 = !DILocalVariable(name: "current", scope: !125, file: !2, line: 540, type: !126, align: 8)
!125 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !78, file: !78, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !128, identifier: "std.core.mem.allocator.TempAllocator")
!128 = !{!129, !130, !143, !144, !145}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !127, file: !2, line: 12, baseType: !88, size: 128, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !127, file: !2, line: 13, baseType: !131, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !133, identifier: "std.core.mem.allocator.TempAllocatorPage")
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !132, file: !2, line: 24, baseType: !131, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !132, file: !2, line: 25, baseType: !23, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !132, file: !2, line: 26, baseType: !17, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !132, file: !2, line: 27, baseType: !17, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !132, file: !2, line: 28, baseType: !17, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !132, file: !2, line: 29, baseType: !140, align: 8, offset: 320)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 0, lowerBound: 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !127, file: !2, line: 14, baseType: !17, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !127, file: !2, line: 15, baseType: !17, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !2, line: 16, baseType: !140, align: 8, offset: 320)
!146 = !DILocation(line: 540, scope: !125, inlinedAt: !147)
!147 = !DILocation(line: 66, scope: !118)
!148 = !DILocation(line: 396, scope: !149, inlinedAt: !146)
!149 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !150, file: !150, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!150 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!151 = !DILocation(line: 398, scope: !152, inlinedAt: !146)
!152 = distinct !DILexicalBlock(scope: !149, file: !150, line: 397, column: 2)
!153 = !DILocation(line: 400, scope: !149, inlinedAt: !146)
!154 = !DILocalVariable(name: "mark", scope: !125, file: !2, line: 546, type: !17, align: 8)
!155 = !DILocation(line: 546, scope: !125, inlinedAt: !147)
!156 = !DILocalVariable(name: "buffer", scope: !157, file: !2, line: 68, type: !158, align: 16)
!157 = distinct !DILexicalBlock(scope: !118, file: !2, line: 67, column: 2)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 256, lowerBound: 0)
!161 = !DILocation(line: 68, scope: !157)
!162 = !DILocalVariable(name: "backtraces", scope: !157, file: !2, line: 69, type: !163, align: 8)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !164, identifier: "void*[]")
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !163, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !163, baseType: !17, size: 64, align: 64, offset: 64)
!168 = !DILocation(line: 69, scope: !157)
!169 = !DILocation(line: 70, scope: !157)
!170 = !DILocalVariable(name: "backtrace", scope: !157, file: !2, line: 71, type: !171, align: 8)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !172, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !2, line: 16, baseType: !17, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !171, file: !2, line: 17, baseType: !17, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !171, file: !2, line: 18, baseType: !88, size: 128, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !171, file: !2, line: 19, baseType: !177, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !179, align: 8)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !180, identifier: "std.os.backtrace.Backtrace")
!180 = !{!181, !183, !184, !185, !186, !187, !188}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !179, file: !2, line: 17, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !18)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !179, file: !2, line: 18, baseType: !10, size: 128, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !179, file: !2, line: 19, baseType: !10, size: 128, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !179, file: !2, line: 20, baseType: !10, size: 128, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !179, file: !2, line: 21, baseType: !19, size: 32, align: 32, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !179, file: !2, line: 22, baseType: !88, size: 128, align: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !179, file: !2, line: 23, baseType: !3, size: 8, align: 8, offset: 640)
!189 = !DILocation(line: 71, scope: !157)
!190 = !DILocation(line: 396, scope: !191, inlinedAt: !189)
!191 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !150, file: !150, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!192 = !DILocation(line: 398, scope: !193, inlinedAt: !189)
!193 = distinct !DILexicalBlock(scope: !191, file: !150, line: 397, column: 2)
!194 = !DILocation(line: 400, scope: !191, inlinedAt: !189)
!195 = !DILocation(line: 72, scope: !157)
!196 = !DILocation(line: 549, scope: !197, inlinedAt: !147)
!197 = distinct !DILexicalBlock(scope: !125, file: !78, line: 548, column: 2)
!198 = !DILocation(line: 553, scope: !197, inlinedAt: !147)
!199 = !DILocation(line: 73, scope: !157)
!200 = !DILocation(line: 549, scope: !201, inlinedAt: !147)
!201 = distinct !DILexicalBlock(scope: !125, file: !78, line: 548, column: 2)
!202 = !DILocation(line: 553, scope: !201, inlinedAt: !147)
!203 = !DILocation(line: 208, scope: !204, inlinedAt: !205)
!204 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!205 = !DILocation(line: 74, scope: !157)
!206 = !DILocation(line: 118, scope: !207, inlinedAt: !203)
!207 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!208 = !DILocation(line: 208, scope: !209, inlinedAt: !210)
!209 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !58, file: !58, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!210 = !DILocation(line: 75, scope: !157)
!211 = !DILocation(line: 118, scope: !212, inlinedAt: !208)
!212 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!213 = !DILocation(line: 218, scope: !214, inlinedAt: !215)
!214 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !58, file: !58, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!215 = !DILocation(line: 76, scope: !157)
!216 = !DILocalVariable(name: "len", scope: !217, file: !2, line: 174, type: !17, align: 8)
!217 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !58, file: !58, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!218 = !DILocation(line: 174, scope: !217, inlinedAt: !213)
!219 = !DILocation(line: 118, scope: !220, inlinedAt: !218)
!220 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !58, file: !58, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!221 = !DILocation(line: 175, scope: !217, inlinedAt: !213)
!222 = !DILocation(line: 180, scope: !217, inlinedAt: !213)
!223 = !DILocation(line: 182, scope: !217, inlinedAt: !213)
!224 = !DILocalVariable(name: ".temp", scope: !225, file: !2, line: 77, type: !17, align: 8)
!225 = distinct !DILexicalBlock(scope: !157, file: !2, line: 77, column: 3)
!226 = !DILocation(line: 77, scope: !225)
!227 = !DILocalVariable(name: "i", scope: !228, file: !2, line: 77, type: !17, align: 8)
!228 = distinct !DILexicalBlock(scope: !225, file: !2, line: 78, column: 3)
!229 = !DILocation(line: 77, scope: !228)
!230 = !DILocalVariable(name: "trace", scope: !228, file: !2, line: 77, type: !177, align: 8)
!231 = !DILocation(line: 79, scope: !232)
!232 = distinct !DILexicalBlock(scope: !228, file: !2, line: 78, column: 3)
!233 = !DILocalVariable(name: "inline_suffix", scope: !232, file: !2, line: 80, type: !10, align: 8)
!234 = !DILocation(line: 80, scope: !232)
!235 = !DILocation(line: 81, scope: !232)
