; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Win32_SECURITY_ATTRIBUTES = type { i32, ptr, i32 }
%File = type { ptr }
%SubProcess = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8 }
%"char[][]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Win32_PROCESS_INFORMATION = type { ptr, ptr, i32, i32 }
%Win32_STARTUPINFOW = type { i32, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, ptr, ptr, ptr, ptr }
%Win32_OVERLAPPED = type { i64, i64, %.anon, ptr }
%.anon = type { ptr }

$std.os.process.SubProcess.stdout = comdat any

$std.os.process.SubProcess.destroy = comdat any

$std.os.process.SubProcess.terminate = comdat any

$std.os.process.SubProcess.read_stdout = comdat any

$std.os.process.SubProcess.read_stderr = comdat any

$std.os.process.SubProcess.is_running = comdat any

$std.os.process.SubProcess.join = comdat any

$std.os.process.execute_stdout_to_buffer = comdat any

$std.os.process.create = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_CREATE_PIPE" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDIN" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDOUT" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "index", linkageName: "create_named_pipe_helper.index", scope: !2, file: !2, line: 56, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "C:/Program Files/c3c/lib/std/os")
!3 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!4 = !{i32 1, !"CodeView", i32 1}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 2}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 2}
!9 = !{i32 1, !"MaxTLSAlign", i32 65536}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0}
!12 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 356, type: !13, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !20}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !16, identifier: "std.io.File")
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !15, file: !2, line: 6, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 354, baseType: !19, align: 8)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 19, size: 512, align: 64, elements: !22, identifier: "std.os.process.SubProcess")
!22 = !{!23, !24, !25, !26, !28, !29, !30, !31}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !21, file: !2, line: 21, baseType: !18, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !21, file: !2, line: 22, baseType: !18, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !21, file: !2, line: 23, baseType: !18, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !21, file: !2, line: 25, baseType: !27, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !2, file: !2, line: 17, baseType: !19, align: 8)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !21, file: !2, line: 26, baseType: !27, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hEventOutput", scope: !21, file: !2, line: 27, baseType: !27, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hEventError", scope: !21, file: !2, line: 28, baseType: !27, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !21, file: !2, line: 33, baseType: !32, size: 8, align: 8, offset: 448)
!32 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!33 = !{}
!34 = !DILocation(line: 357, scope: !12)
!35 = !DILocalVariable(name: "self", arg: 1, scope: !12, file: !2, line: 356, type: !20)
!36 = !DILocation(line: 356, scope: !12)
!37 = !DILocation(line: 358, scope: !12)
!38 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 380, type: !39, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!39 = !DISubroutineType(types: !40)
!40 = !{!32, !20}
!41 = !DILocation(line: 381, scope: !38)
!42 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 380, type: !20)
!43 = !DILocation(line: 380, scope: !38)
!44 = !DILocation(line: 382, scope: !38)
!45 = !DILocation(line: 383, scope: !38)
!46 = !DILocation(line: 385, scope: !47)
!47 = distinct !DILexicalBlock(scope: !38, file: !2, line: 384, column: 2)
!48 = !DILocation(line: 386, scope: !47)
!49 = !DILocation(line: 388, scope: !38)
!50 = !DILocation(line: 390, scope: !38)
!51 = !DILocation(line: 391, scope: !38)
!52 = !DILocation(line: 392, scope: !38)
!53 = !DILocation(line: 393, scope: !38)
!54 = !DILocation(line: 394, scope: !38)
!55 = !DILocation(line: 396, scope: !38)
!56 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 399, type: !57, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !19, !20}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !3)
!60 = !DILocation(line: 400, scope: !56)
!61 = !DILocalVariable(name: "self", arg: 1, scope: !56, file: !2, line: 399, type: !20)
!62 = !DILocation(line: 399, scope: !56)
!63 = !DILocation(line: 402, scope: !56)
!64 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 444, type: !65, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!65 = !DISubroutineType(types: !66)
!66 = !{!59, !67, !20, !70, !69}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !69)
!69 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DILocation(line: 445, scope: !64)
!73 = !DILocalVariable(name: "self", arg: 1, scope: !64, file: !2, line: 444, type: !20)
!74 = !DILocation(line: 444, scope: !64)
!75 = !DILocalVariable(name: "buffer", arg: 2, scope: !64, file: !2, line: 444, type: !70)
!76 = !DILocalVariable(name: "size", arg: 3, scope: !64, file: !2, line: 444, type: !68)
!77 = !DILocation(line: 447, scope: !64)
!78 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 453, type: !65, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!79 = !DILocation(line: 454, scope: !78)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !78, file: !2, line: 453, type: !20)
!81 = !DILocation(line: 453, scope: !78)
!82 = !DILocalVariable(name: "buffer", arg: 2, scope: !78, file: !2, line: 453, type: !70)
!83 = !DILocalVariable(name: "size", arg: 3, scope: !78, file: !2, line: 453, type: !68)
!84 = !DILocation(line: 456, scope: !78)
!85 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 462, type: !86, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!86 = !DISubroutineType(types: !87)
!87 = !{!59, !88, !20}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DILocation(line: 463, scope: !85)
!90 = !DILocalVariable(name: "self", arg: 1, scope: !85, file: !2, line: 462, type: !20)
!91 = !DILocation(line: 462, scope: !85)
!92 = !DILocation(line: 464, scope: !85)
!93 = !DILocalVariable(name: "is_alive", scope: !85, file: !2, line: 466, type: !32, align: 1)
!94 = !DILocation(line: 466, scope: !85)
!95 = !DILocation(line: 467, scope: !85)
!96 = !DILocation(line: 468, scope: !85)
!97 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 361, type: !98, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!98 = !DISubroutineType(types: !99)
!99 = !{!59, !100, !20}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !102, align: 4)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DILocation(line: 362, scope: !97)
!104 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !2, line: 361, type: !20)
!105 = !DILocation(line: 361, scope: !97)
!106 = !DILocation(line: 363, scope: !97)
!107 = !DILocation(line: 365, scope: !108)
!108 = distinct !DILexicalBlock(scope: !97, file: !2, line: 364, column: 2)
!109 = !DILocation(line: 366, scope: !108)
!110 = !DILocation(line: 368, scope: !97)
!111 = !DILocation(line: 370, scope: !112)
!112 = distinct !DILexicalBlock(scope: !97, file: !2, line: 369, column: 2)
!113 = !DILocation(line: 371, scope: !112)
!114 = !DILocation(line: 373, scope: !97)
!115 = !DILocalVariable(name: "return_code", scope: !97, file: !2, line: 374, type: !116, align: 4)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !2, file: !2, line: 9, baseType: !117, align: 4)
!117 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!118 = !DILocation(line: 374, scope: !97)
!119 = !DILocation(line: 375, scope: !97)
!120 = !DILocation(line: 376, scope: !97)
!121 = !DILocation(line: 377, scope: !97)
!122 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 271, type: !123, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!123 = !DISubroutineType(types: !124)
!124 = !{!59, !125, !127, !131, !102, !131}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !128, identifier: "char[]")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !127, baseType: !70, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !127, baseType: !68, size: 64, align: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !132, identifier: "String[]")
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !131, baseType: !125, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, baseType: !68, size: 64, align: 64, offset: 64)
!135 = !DILocalVariable(name: "buffer", arg: 1, scope: !122, file: !2, line: 271, type: !127)
!136 = !DILocation(line: 271, scope: !122)
!137 = !DILocalVariable(name: "command_line", arg: 2, scope: !122, file: !2, line: 271, type: !131)
!138 = !DILocalVariable(name: "options", arg: 3, scope: !122, file: !2, line: 271, type: !102)
!139 = !DILocalVariable(name: "environment", arg: 4, scope: !122, file: !2, line: 271, type: !131)
!140 = !DILocalVariable(name: "process", scope: !122, file: !2, line: 273, type: !21, align: 8)
!141 = !DILocation(line: 273, scope: !122)
!142 = !DILocation(line: 274, scope: !122)
!143 = !DILocalVariable(name: "len", scope: !122, file: !2, line: 275, type: !68, align: 8)
!144 = !DILocation(line: 275, scope: !122)
!145 = !DILocation(line: 276, scope: !122)
!146 = distinct !DISubprogram(name: "create_named_pipe_helper", linkageName: "std.os.process.create_named_pipe_helper", scope: !2, file: !2, line: 52, type: !147, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!147 = !DISubroutineType(types: !148)
!148 = !{!59, !19, !149, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DILocalVariable(name: "rd", arg: 1, scope: !146, file: !2, line: 52, type: !149)
!151 = !DILocation(line: 52, scope: !146)
!152 = !DILocalVariable(name: "wr", arg: 2, scope: !146, file: !2, line: 52, type: !149)
!153 = !DILocalVariable(name: "sa_attr", scope: !146, file: !2, line: 54, type: !154, align: 8)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_SECURITY_ATTRIBUTES", scope: !2, file: !2, line: 193, size: 192, align: 64, elements: !155, identifier: "std.os.win32.Win32_SECURITY_ATTRIBUTES")
!155 = !{!156, !157, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nLength", scope: !154, file: !2, line: 195, baseType: !116, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "lpSecurityDescriptor", scope: !154, file: !2, line: 196, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPVOID", scope: !2, file: !2, line: 80, baseType: !19, align: 8)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bInheritHandle", scope: !154, file: !2, line: 197, baseType: !160, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_BOOL", scope: !2, file: !2, line: 3, baseType: !102, align: 4)
!161 = !DILocation(line: 54, scope: !146)
!162 = !DILocalVariable(name: "unique", scope: !146, file: !2, line: 57, type: !3, align: 8)
!163 = !DILocation(line: 57, scope: !146)
!164 = !DILocalVariable(name: "current", scope: !165, file: !2, line: 540, type: !167, align: 8)
!165 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !166, file: !166, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!166 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !168, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !169, identifier: "std.core.mem.allocator.TempAllocator")
!169 = !{!170, !176, !189, !190, !191}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !168, file: !2, line: 12, baseType: !171, size: 128, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !172, identifier: "Allocator")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !171, baseType: !19, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !168, file: !2, line: 13, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !179, identifier: "std.core.mem.allocator.TempAllocatorPage")
!179 = !{!180, !181, !182, !183, !184, !185}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !178, file: !2, line: 24, baseType: !177, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !178, file: !2, line: 25, baseType: !19, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !178, file: !2, line: 26, baseType: !68, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !2, line: 27, baseType: !68, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !178, file: !2, line: 28, baseType: !68, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !2, line: 29, baseType: !186, align: 8, offset: 320)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 0, lowerBound: 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !2, line: 14, baseType: !68, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !168, file: !2, line: 15, baseType: !68, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !2, line: 16, baseType: !186, align: 8, offset: 320)
!192 = !DILocation(line: 540, scope: !165, inlinedAt: !193)
!193 = !DILocation(line: 58, scope: !146)
!194 = !DILocation(line: 396, scope: !195, inlinedAt: !192)
!195 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !196, file: !196, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!196 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!197 = !DILocation(line: 398, scope: !198, inlinedAt: !192)
!198 = distinct !DILexicalBlock(scope: !195, file: !196, line: 397, column: 2)
!199 = !DILocation(line: 400, scope: !195, inlinedAt: !192)
!200 = !DILocalVariable(name: "mark", scope: !165, file: !2, line: 546, type: !68, align: 8)
!201 = !DILocation(line: 546, scope: !165, inlinedAt: !193)
!202 = !DILocalVariable(name: "s", scope: !203, file: !2, line: 60, type: !126, align: 8)
!203 = distinct !DILexicalBlock(scope: !146, file: !2, line: 59, column: 2)
!204 = !DILocation(line: 60, scope: !203)
!205 = !DILocalVariable(name: "str", scope: !203, file: !2, line: 61, type: !206, align: 8)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPCSTR", scope: !2, file: !2, line: 70, baseType: !207, align: 8)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ichar*", baseType: !208, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!209 = !DILocation(line: 61, scope: !203)
!210 = !DILocation(line: 62, scope: !203)
!211 = !DILocation(line: 66, scope: !203)
!212 = !DILocation(line: 67, scope: !203)
!213 = !DILocation(line: 549, scope: !214, inlinedAt: !193)
!214 = distinct !DILexicalBlock(scope: !165, file: !166, line: 548, column: 2)
!215 = !DILocation(line: 553, scope: !214, inlinedAt: !193)
!216 = !DILocation(line: 68, scope: !203)
!217 = !DILocation(line: 70, scope: !203)
!218 = !DILocation(line: 71, scope: !203)
!219 = !DILocation(line: 549, scope: !220, inlinedAt: !193)
!220 = distinct !DILexicalBlock(scope: !165, file: !166, line: 548, column: 2)
!221 = !DILocation(line: 553, scope: !220, inlinedAt: !193)
!222 = !DILocation(line: 549, scope: !223, inlinedAt: !193)
!223 = distinct !DILexicalBlock(scope: !165, file: !166, line: 548, column: 2)
!224 = !DILocation(line: 553, scope: !223, inlinedAt: !193)
!225 = distinct !DISubprogram(name: "convert_command_line_win32", linkageName: "std.os.process.convert_command_line_win32", scope: !2, file: !2, line: 75, type: !226, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !131}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 7, baseType: !229, align: 8)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !230, size: 64, align: 64, dwarfAddressSpace: 0)
!230 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!231 = !DILocalVariable(name: "command_line", arg: 1, scope: !225, file: !2, line: 75, type: !131)
!232 = !DILocation(line: 75, scope: !225)
!233 = !DILocalVariable(name: "str", scope: !225, file: !2, line: 77, type: !234, align: 8)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !235, align: 8)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!237 = !DILocation(line: 77, scope: !225)
!238 = !DILocalVariable(name: ".temp", scope: !239, file: !2, line: 78, type: !68, align: 8)
!239 = distinct !DILexicalBlock(scope: !225, file: !2, line: 78, column: 2)
!240 = !DILocation(line: 78, scope: !239)
!241 = !DILocalVariable(name: "i", scope: !242, file: !2, line: 78, type: !68, align: 8)
!242 = distinct !DILexicalBlock(scope: !239, file: !2, line: 79, column: 2)
!243 = !DILocation(line: 78, scope: !242)
!244 = !DILocalVariable(name: "s", scope: !242, file: !2, line: 78, type: !126, align: 8)
!245 = !DILocation(line: 80, scope: !246)
!246 = distinct !DILexicalBlock(scope: !242, file: !2, line: 79, column: 2)
!247 = !DILocation(line: 393, scope: !248, inlinedAt: !245)
!248 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!249 = !DIFile(filename: "dstring.c3", directory: "C:/Program Files/c3c/lib/std/core")
!250 = !DILocalVariable(name: "needs_escape", scope: !246, file: !2, line: 81, type: !32, align: 1)
!251 = !DILocation(line: 81, scope: !246)
!252 = !DILocalVariable(name: ".temp", scope: !253, file: !2, line: 82, type: !68, align: 8)
!253 = distinct !DILexicalBlock(scope: !254, file: !2, line: 82, column: 4)
!254 = distinct !DILexicalBlock(scope: !246, file: !2, line: 82, column: 4)
!255 = !DILocation(line: 82, scope: !253)
!256 = !DILocalVariable(name: "c", scope: !257, file: !2, line: 82, type: !71, align: 1)
!257 = distinct !DILexicalBlock(scope: !253, file: !2, line: 83, column: 4)
!258 = !DILocation(line: 82, scope: !257)
!259 = !DILocation(line: 89, scope: !260)
!260 = distinct !DILexicalBlock(scope: !261, file: !2, line: 89, column: 7)
!261 = distinct !DILexicalBlock(scope: !262, file: !2, line: 84, column: 5)
!262 = distinct !DILexicalBlock(scope: !257, file: !2, line: 83, column: 4)
!263 = !DILocation(line: 92, scope: !254)
!264 = !DILocation(line: 94, scope: !246)
!265 = !DILocation(line: 397, scope: !266, inlinedAt: !267)
!266 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!267 = !DILocation(line: 96, scope: !268)
!268 = distinct !DILexicalBlock(scope: !246, file: !2, line: 95, column: 3)
!269 = !DILocation(line: 97, scope: !268)
!270 = !DILocation(line: 393, scope: !271, inlinedAt: !272)
!271 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!272 = !DILocation(line: 99, scope: !246)
!273 = !DILocalVariable(name: ".temp", scope: !274, file: !2, line: 100, type: !68, align: 8)
!274 = distinct !DILexicalBlock(scope: !246, file: !2, line: 100, column: 3)
!275 = !DILocation(line: 100, scope: !274)
!276 = !DILocalVariable(name: "j", scope: !277, file: !2, line: 100, type: !68, align: 8)
!277 = distinct !DILexicalBlock(scope: !274, file: !2, line: 101, column: 3)
!278 = !DILocation(line: 100, scope: !277)
!279 = !DILocalVariable(name: "c", scope: !277, file: !2, line: 100, type: !71, align: 1)
!280 = !DILocation(line: 105, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !2, line: 105, column: 6)
!282 = distinct !DILexicalBlock(scope: !283, file: !2, line: 102, column: 4)
!283 = distinct !DILexicalBlock(scope: !277, file: !2, line: 101, column: 3)
!284 = !DILocation(line: 393, scope: !285, inlinedAt: !280)
!285 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!286 = !DILocation(line: 393, scope: !287, inlinedAt: !288)
!287 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!288 = !DILocation(line: 107, scope: !289)
!289 = distinct !DILexicalBlock(scope: !282, file: !2, line: 107, column: 6)
!290 = !DILocation(line: 393, scope: !291, inlinedAt: !292)
!291 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!292 = !DILocation(line: 109, scope: !283)
!293 = !DILocation(line: 393, scope: !294, inlinedAt: !295)
!294 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!295 = !DILocation(line: 111, scope: !246)
!296 = !DILocation(line: 393, scope: !297, inlinedAt: !298)
!297 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!298 = !DILocation(line: 113, scope: !225)
!299 = !DILocation(line: 114, scope: !225)
!300 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 120, type: !301, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !33)
!301 = !DISubroutineType(types: !302)
!302 = !{!59, !20, !131, !102, !131}
!303 = !DILocalVariable(name: "command_line", arg: 1, scope: !300, file: !2, line: 120, type: !131)
!304 = !DILocation(line: 120, scope: !300)
!305 = !DILocalVariable(name: "options", arg: 2, scope: !300, file: !2, line: 120, type: !102)
!306 = !DILocalVariable(name: "environment", arg: 3, scope: !300, file: !2, line: 120, type: !131)
!307 = !DILocation(line: 118, scope: !308)
!308 = distinct !DILexicalBlock(scope: !300, file: !2, line: 121, column: 1)
!309 = !DILocalVariable(name: "rd", scope: !300, file: !2, line: 122, type: !19, align: 8)
!310 = !DILocation(line: 122, scope: !300)
!311 = !DILocalVariable(name: "wr", scope: !300, file: !2, line: 122, type: !19, align: 8)
!312 = !DILocalVariable(name: "flags", scope: !300, file: !2, line: 123, type: !116, align: 4)
!313 = !DILocation(line: 123, scope: !300)
!314 = !DILocalVariable(name: "process_info", scope: !300, file: !2, line: 124, type: !315, align: 8)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_PROCESS_INFORMATION", scope: !2, file: !2, line: 259, size: 192, align: 64, elements: !316, identifier: "std.os.win32.Win32_PROCESS_INFORMATION")
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hProcess", scope: !315, file: !2, line: 261, baseType: !27, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hThread", scope: !315, file: !2, line: 262, baseType: !27, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dwProcessId", scope: !315, file: !2, line: 263, baseType: !116, size: 32, align: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dwThreadId", scope: !315, file: !2, line: 264, baseType: !116, size: 32, align: 32, offset: 160)
!321 = !DILocation(line: 124, scope: !300)
!322 = !DILocalVariable(name: "sa_attr", scope: !300, file: !2, line: 125, type: !154, align: 8)
!323 = !DILocation(line: 125, scope: !300)
!324 = !DILocalVariable(name: "start_info", scope: !300, file: !2, line: 126, type: !325, align: 8)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_STARTUPINFOW", scope: !2, file: !2, line: 205, size: 832, align: 64, elements: !326, identifier: "std.os.win32.Win32_STARTUPINFOW")
!326 = !{!327, !328, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !342, !343, !345, !346, !347}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !325, file: !2, line: 207, baseType: !116, size: 32, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved", scope: !325, file: !2, line: 208, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPWSTR", scope: !2, file: !2, line: 82, baseType: !229, align: 8)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lpDesktop", scope: !325, file: !2, line: 209, baseType: !329, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lpTitle", scope: !325, file: !2, line: 210, baseType: !329, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dwX", scope: !325, file: !2, line: 211, baseType: !116, size: 32, align: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dwY", scope: !325, file: !2, line: 212, baseType: !116, size: 32, align: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dwXSize", scope: !325, file: !2, line: 213, baseType: !116, size: 32, align: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dwYSize", scope: !325, file: !2, line: 214, baseType: !116, size: 32, align: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dwXCountChars", scope: !325, file: !2, line: 215, baseType: !116, size: 32, align: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dwYCountChars", scope: !325, file: !2, line: 216, baseType: !116, size: 32, align: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dwFillAttribute", scope: !325, file: !2, line: 217, baseType: !116, size: 32, align: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !325, file: !2, line: 218, baseType: !116, size: 32, align: 32, offset: 480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "wShowWindow", scope: !325, file: !2, line: 219, baseType: !341, size: 16, align: 16, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 169, baseType: !230, align: 2)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cbReserved2", scope: !325, file: !2, line: 220, baseType: !341, size: 16, align: 16, offset: 528)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lpReserved2", scope: !325, file: !2, line: 221, baseType: !344, size: 64, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LPBYTE", scope: !2, file: !2, line: 68, baseType: !70, align: 8)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hStdInput", scope: !325, file: !2, line: 222, baseType: !27, size: 64, align: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hStdOutput", scope: !325, file: !2, line: 223, baseType: !27, size: 64, align: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "hStdError", scope: !325, file: !2, line: 224, baseType: !27, size: 64, align: 64, offset: 768)
!348 = !DILocation(line: 126, scope: !300)
!349 = !DILocation(line: 127, scope: !300)
!350 = !DILocation(line: 128, scope: !300)
!351 = !DILocation(line: 130, scope: !300)
!352 = !DILocation(line: 131, scope: !300)
!353 = !DILocation(line: 133, scope: !300)
!354 = !DILocalVariable(name: "stdin", scope: !300, file: !2, line: 135, type: !18, align: 8)
!355 = !DILocation(line: 135, scope: !300)
!356 = !DILocalVariable(name: "stdout", scope: !300, file: !2, line: 136, type: !18, align: 8)
!357 = !DILocation(line: 136, scope: !300)
!358 = !DILocalVariable(name: "stderr", scope: !300, file: !2, line: 137, type: !18, align: 8)
!359 = !DILocation(line: 137, scope: !300)
!360 = !DILocalVariable(name: "current", scope: !361, file: !2, line: 540, type: !167, align: 8)
!361 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !166, file: !166, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!362 = !DILocation(line: 540, scope: !361, inlinedAt: !363)
!363 = !DILocation(line: 138, scope: !300)
!364 = !DILocation(line: 396, scope: !365, inlinedAt: !362)
!365 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !196, file: !196, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!366 = !DILocation(line: 398, scope: !367, inlinedAt: !362)
!367 = distinct !DILexicalBlock(scope: !365, file: !196, line: 397, column: 2)
!368 = !DILocation(line: 400, scope: !365, inlinedAt: !362)
!369 = !DILocalVariable(name: "mark", scope: !361, file: !2, line: 546, type: !68, align: 8)
!370 = !DILocation(line: 546, scope: !361, inlinedAt: !363)
!371 = !DILocalVariable(name: "used_environment", scope: !372, file: !2, line: 140, type: !228, align: 8)
!372 = distinct !DILexicalBlock(scope: !300, file: !2, line: 139, column: 2)
!373 = !DILocation(line: 140, scope: !372)
!374 = !DILocation(line: 141, scope: !372)
!375 = !DILocalVariable(name: "env", scope: !376, file: !2, line: 143, type: !234, align: 8)
!376 = distinct !DILexicalBlock(scope: !372, file: !2, line: 142, column: 3)
!377 = !DILocation(line: 143, scope: !376)
!378 = !DILocation(line: 144, scope: !376)
!379 = !DILocation(line: 397, scope: !380, inlinedAt: !381)
!380 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!381 = !DILocation(line: 146, scope: !382)
!382 = distinct !DILexicalBlock(scope: !376, file: !2, line: 145, column: 4)
!383 = !DILocalVariable(name: ".temp", scope: !384, file: !2, line: 148, type: !68, align: 8)
!384 = distinct !DILexicalBlock(scope: !376, file: !2, line: 148, column: 4)
!385 = !DILocation(line: 148, scope: !384)
!386 = !DILocalVariable(name: "s", scope: !387, file: !2, line: 148, type: !126, align: 8)
!387 = distinct !DILexicalBlock(scope: !384, file: !2, line: 149, column: 4)
!388 = !DILocation(line: 148, scope: !387)
!389 = !DILocation(line: 397, scope: !390, inlinedAt: !391)
!390 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!391 = !DILocation(line: 150, scope: !392)
!392 = distinct !DILexicalBlock(scope: !387, file: !2, line: 149, column: 4)
!393 = !DILocation(line: 397, scope: !394, inlinedAt: !395)
!394 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!395 = !DILocation(line: 151, scope: !392)
!396 = !DILocation(line: 397, scope: !397, inlinedAt: !398)
!397 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !249, file: !249, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!398 = !DILocation(line: 153, scope: !376)
!399 = !DILocation(line: 154, scope: !376)
!400 = !DILocation(line: 549, scope: !401, inlinedAt: !363)
!401 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!402 = !DILocation(line: 553, scope: !401, inlinedAt: !363)
!403 = !DILocalVariable(name: "fd", scope: !372, file: !2, line: 156, type: !102, align: 4)
!404 = !DILocation(line: 156, scope: !372)
!405 = !DILocation(line: 157, scope: !372)
!406 = !DILocation(line: 159, scope: !407)
!407 = distinct !DILexicalBlock(scope: !372, file: !2, line: 158, column: 3)
!408 = !DILocation(line: 160, scope: !407)
!409 = !DILocation(line: 549, scope: !410, inlinedAt: !363)
!410 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!411 = !DILocation(line: 553, scope: !410, inlinedAt: !363)
!412 = !DILocation(line: 162, scope: !372)
!413 = !DILocation(line: 163, scope: !372)
!414 = !DILocation(line: 165, scope: !415)
!415 = distinct !DILexicalBlock(scope: !372, file: !2, line: 164, column: 3)
!416 = !DILocation(line: 549, scope: !417, inlinedAt: !363)
!417 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!418 = !DILocation(line: 553, scope: !417, inlinedAt: !363)
!419 = !DILocation(line: 169, scope: !420)
!420 = distinct !DILexicalBlock(scope: !372, file: !2, line: 168, column: 3)
!421 = !DILocation(line: 549, scope: !422, inlinedAt: !363)
!422 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!423 = !DILocation(line: 553, scope: !422, inlinedAt: !363)
!424 = !DILocation(line: 171, scope: !372)
!425 = !DILocation(line: 549, scope: !426, inlinedAt: !363)
!426 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!427 = !DILocation(line: 553, scope: !426, inlinedAt: !363)
!428 = !DILocation(line: 172, scope: !372)
!429 = !DILocation(line: 173, scope: !372)
!430 = !DILocation(line: 175, scope: !431)
!431 = distinct !DILexicalBlock(scope: !372, file: !2, line: 174, column: 3)
!432 = !DILocation(line: 176, scope: !431)
!433 = !DILocation(line: 549, scope: !434, inlinedAt: !363)
!434 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!435 = !DILocation(line: 553, scope: !434, inlinedAt: !363)
!436 = !DILocation(line: 179, scope: !372)
!437 = !DILocation(line: 182, scope: !438)
!438 = distinct !DILexicalBlock(scope: !372, file: !2, line: 182, column: 4)
!439 = !DILocation(line: 184, scope: !440)
!440 = distinct !DILexicalBlock(scope: !438, file: !2, line: 183, column: 4)
!441 = !DILocation(line: 185, scope: !440)
!442 = !DILocation(line: 186, scope: !440)
!443 = !DILocation(line: 188, scope: !438)
!444 = !DILocation(line: 190, scope: !445)
!445 = distinct !DILexicalBlock(scope: !438, file: !2, line: 189, column: 4)
!446 = !DILocation(line: 194, scope: !447)
!447 = distinct !DILexicalBlock(scope: !438, file: !2, line: 193, column: 4)
!448 = !DILocation(line: 196, scope: !438)
!449 = !DILocation(line: 198, scope: !438)
!450 = !DILocation(line: 199, scope: !438)
!451 = !DILocation(line: 201, scope: !452)
!452 = distinct !DILexicalBlock(scope: !438, file: !2, line: 200, column: 4)
!453 = !DILocation(line: 202, scope: !452)
!454 = !DILocation(line: 204, scope: !438)
!455 = !DILocation(line: 549, scope: !456, inlinedAt: !363)
!456 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!457 = !DILocation(line: 553, scope: !456, inlinedAt: !363)
!458 = !DILocalVariable(name: "event_output", scope: !372, file: !2, line: 207, type: !19, align: 8)
!459 = !DILocation(line: 207, scope: !372)
!460 = !DILocalVariable(name: "event_error", scope: !372, file: !2, line: 208, type: !19, align: 8)
!461 = !DILocation(line: 208, scope: !372)
!462 = !DILocation(line: 209, scope: !372)
!463 = !DILocation(line: 211, scope: !464)
!464 = distinct !DILexicalBlock(scope: !372, file: !2, line: 210, column: 3)
!465 = !DILocation(line: 212, scope: !464)
!466 = !DILocation(line: 216, scope: !372)
!467 = !DILocation(line: 221, scope: !372)
!468 = !DILocation(line: 224, scope: !372)
!469 = !DILocation(line: 214, scope: !372)
!470 = !DILocation(line: 549, scope: !471, inlinedAt: !363)
!471 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!472 = !DILocation(line: 553, scope: !471, inlinedAt: !363)
!473 = !DILocation(line: 549, scope: !474, inlinedAt: !363)
!474 = distinct !DILexicalBlock(scope: !361, file: !166, line: 548, column: 2)
!475 = !DILocation(line: 227, scope: !300)
!476 = !DILocation(line: 228, scope: !300)
!477 = !DILocation(line: 230, scope: !478)
!478 = distinct !DILexicalBlock(scope: !300, file: !2, line: 229, column: 2)
!479 = !DILocation(line: 231, scope: !478)
!480 = !DILocation(line: 235, scope: !300)
!481 = !DILocation(line: 236, scope: !300)
!482 = !DILocation(line: 237, scope: !300)
!483 = !DILocation(line: 238, scope: !300)
!484 = !DILocation(line: 239, scope: !300)
!485 = !DILocation(line: 240, scope: !300)
!486 = distinct !DISubprogram(name: "read_from_file_win32", linkageName: "std.os.process.read_from_file_win32", scope: !2, file: !2, line: 411, type: !487, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !33)
!487 = !DISubroutineType(types: !488)
!488 = !{!59, !67, !19, !19, !70, !69}
!489 = !DILocalVariable(name: "file", arg: 1, scope: !486, file: !2, line: 411, type: !18)
!490 = !DILocation(line: 411, scope: !486)
!491 = !DILocalVariable(name: "event_handle", arg: 2, scope: !486, file: !2, line: 411, type: !27)
!492 = !DILocalVariable(name: "buffer", arg: 3, scope: !486, file: !2, line: 411, type: !70)
!493 = !DILocalVariable(name: "size", arg: 4, scope: !486, file: !2, line: 411, type: !68)
!494 = !DILocation(line: 409, scope: !495)
!495 = distinct !DILexicalBlock(scope: !486, file: !2, line: 412, column: 1)
!496 = !DILocalVariable(name: "fd", scope: !486, file: !2, line: 413, type: !101, align: 4)
!497 = !DILocation(line: 413, scope: !486)
!498 = !DILocalVariable(name: "bytes_read", scope: !486, file: !2, line: 414, type: !116, align: 4)
!499 = !DILocation(line: 414, scope: !486)
!500 = !DILocalVariable(name: "overlapped", scope: !486, file: !2, line: 415, type: !501, align: 8)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_OVERLAPPED", scope: !2, file: !2, line: 227, size: 256, align: 64, elements: !502, identifier: "std.os.win32.Win32_OVERLAPPED")
!502 = !{!503, !505, !506, !516}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !501, file: !2, line: 229, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_ULONG_PTR", scope: !2, file: !2, line: 163, baseType: !69, align: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "internalHigh", scope: !501, file: !2, line: 230, baseType: !504, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, scope: !501, file: !2, line: 231, baseType: !507, size: 64, align: 64, offset: 128)
!507 = !DICompositeType(tag: DW_TAG_union_type, scope: !501, file: !2, line: 231, size: 64, align: 64, elements: !508)
!508 = !{!509, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !2, line: 232, baseType: !510, size: 64, align: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !507, file: !2, line: 232, size: 64, align: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !510, file: !2, line: 233, baseType: !116, size: 32, align: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "offsetHigh", scope: !510, file: !2, line: 234, baseType: !116, size: 32, align: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !507, file: !2, line: 236, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_PVOID", scope: !2, file: !2, line: 139, baseType: !19, align: 8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hEvent", scope: !501, file: !2, line: 238, baseType: !27, size: 64, align: 64, offset: 192)
!517 = !DILocation(line: 415, scope: !486)
!518 = !DILocalVariable(name: "handle", scope: !486, file: !2, line: 416, type: !27, align: 8)
!519 = !DILocation(line: 416, scope: !486)
!520 = !DILocation(line: 417, scope: !486)
!521 = !DILocation(line: 420, scope: !522)
!522 = distinct !DILexicalBlock(scope: !486, file: !2, line: 418, column: 2)
!523 = !DILocation(line: 422, scope: !524)
!524 = distinct !DILexicalBlock(scope: !522, file: !2, line: 421, column: 3)
!525 = !DILocation(line: 424, scope: !526)
!526 = distinct !DILexicalBlock(scope: !527, file: !2, line: 424, column: 5)
!527 = distinct !DILexicalBlock(scope: !524, file: !2, line: 423, column: 4)
!528 = !DILocation(line: 428, scope: !529)
!529 = distinct !DILexicalBlock(scope: !526, file: !2, line: 428, column: 7)
!530 = !DILocation(line: 430, scope: !531)
!531 = distinct !DILexicalBlock(scope: !526, file: !2, line: 430, column: 7)
!532 = !DILocation(line: 435, scope: !486)
