; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }

$std.os.env.get_var = comdat any

$std.os.env.get_var_temp = comdat any

$std.os.env.set_var = comdat any

$std.os.env.get_home_dir = comdat any

$std.os.env.get_config_dir = comdat any

$std.os.env.new_get_config_dir = comdat any

$std.os.env.clear_var = comdat any

$std.os.env.executable_path = comdat any

$std.os.env.new_executable_path = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.anyfault" = comdat any

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = external global ptr, align 8
@std.core.mem.allocator.thread_temp_allocator = external thread_local global ptr, align 8
@get_var.BUFSIZE = internal unnamed_addr constant i64 1024, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BUFSIZE", linkageName: "get_var.BUFSIZE", scope: !2, file: !2, line: 22, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "C:/Program Files/c3c/lib/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !4)
!4 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!5 = !{i32 1, !"CodeView", i32 1}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 2, !"wchar_size", i32 2}
!8 = !{i32 4, !"PIC Level", i32 2}
!9 = !{i32 1, !"uwtable", i32 2}
!10 = !{i32 1, !"MaxTLSAlign", i32 65536}
!11 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, globals: !29, splitDebugInlining: false)
!12 = !{!13}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !14, file: !2, line: 26, baseType: !25, size: 32, align: 32, elements: !26)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !15, identifier: "std.io.path.PathImp")
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !14, file: !2, line: 22, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !19, identifier: "char[]")
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, baseType: !3, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !14, file: !2, line: 23, baseType: !13, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "WIN32", value: 0)
!28 = !DIEnumerator(name: "POSIX", value: 1)
!29 = !{!0}
!30 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !31, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !42)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !17, !36}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !34)
!34 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !37, identifier: "Allocator")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!42 = !{}
!43 = !DILocalVariable(name: "name", arg: 1, scope: !30, file: !2, line: 12, type: !17)
!44 = !DILocation(line: 12, scope: !30)
!45 = !DILocalVariable(name: "allocator", arg: 2, scope: !30, file: !2, line: 12, type: !36)
!46 = !DILocation(line: 9, scope: !47)
!47 = distinct !DILexicalBlock(scope: !30, file: !2, line: 13, column: 1)
!48 = !DILocalVariable(name: "current", scope: !49, file: !2, line: 540, type: !51, align: 8)
!49 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !50, file: !50, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, retainedNodes: !42)
!50 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !53, identifier: "std.core.mem.allocator.TempAllocator")
!53 = !{!54, !55, !68, !69, !70}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !52, file: !2, line: 12, baseType: !36, size: 128, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !52, file: !2, line: 13, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !58, identifier: "std.core.mem.allocator.TempAllocatorPage")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !57, file: !2, line: 24, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !57, file: !2, line: 25, baseType: !39, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !57, file: !2, line: 26, baseType: !3, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !2, line: 27, baseType: !3, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !57, file: !2, line: 28, baseType: !3, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !2, line: 29, baseType: !65, align: 8, offset: 320)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 0, lowerBound: 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !52, file: !2, line: 14, baseType: !3, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !52, file: !2, line: 15, baseType: !3, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !2, line: 16, baseType: !65, align: 8, offset: 320)
!71 = !DILocation(line: 540, scope: !49, inlinedAt: !72)
!72 = !DILocation(line: 14, scope: !30)
!73 = !DILocation(line: 396, scope: !74, inlinedAt: !71)
!74 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11)
!75 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!76 = !DILocation(line: 398, scope: !77, inlinedAt: !71)
!77 = distinct !DILexicalBlock(scope: !74, file: !75, line: 397, column: 2)
!78 = !DILocation(line: 400, scope: !74, inlinedAt: !71)
!79 = !DILocalVariable(name: "original", scope: !49, file: !2, line: 543, type: !51, align: 8)
!80 = !DILocation(line: 543, scope: !49, inlinedAt: !72)
!81 = !DILocation(line: 544, scope: !49, inlinedAt: !72)
!82 = !DILocalVariable(name: "mark", scope: !49, file: !2, line: 546, type: !3, align: 8)
!83 = !DILocation(line: 546, scope: !49, inlinedAt: !72)
!84 = !DILocalVariable(name: "buff", scope: !85, file: !2, line: 23, type: !86, align: 8)
!85 = distinct !DILexicalBlock(scope: !30, file: !2, line: 15, column: 2)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !2, file: !2, line: 7, baseType: !87, align: 8)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!89 = !DILocation(line: 23, scope: !85)
!90 = !DILocalVariable(name: "wstr", scope: !85, file: !2, line: 24, type: !86, align: 8)
!91 = !DILocation(line: 24, scope: !85)
!92 = !DILocation(line: 549, scope: !93, inlinedAt: !72)
!93 = distinct !DILexicalBlock(scope: !49, file: !50, line: 548, column: 2)
!94 = !DILocation(line: 551, scope: !93, inlinedAt: !72)
!95 = !DILocation(line: 553, scope: !93, inlinedAt: !72)
!96 = !DILocalVariable(name: "len", scope: !85, file: !2, line: 25, type: !3, align: 8)
!97 = !DILocation(line: 25, scope: !85)
!98 = !DILocation(line: 26, scope: !85)
!99 = !DILocation(line: 549, scope: !100, inlinedAt: !72)
!100 = distinct !DILexicalBlock(scope: !49, file: !50, line: 548, column: 2)
!101 = !DILocation(line: 551, scope: !100, inlinedAt: !72)
!102 = !DILocation(line: 553, scope: !100, inlinedAt: !72)
!103 = !DILocation(line: 27, scope: !85)
!104 = !DILocation(line: 29, scope: !105)
!105 = distinct !DILexicalBlock(scope: !85, file: !2, line: 28, column: 3)
!106 = !DILocation(line: 30, scope: !105)
!107 = !DILocation(line: 32, scope: !85)
!108 = !DILocation(line: 549, scope: !109, inlinedAt: !72)
!109 = distinct !DILexicalBlock(scope: !49, file: !50, line: 548, column: 2)
!110 = !DILocation(line: 551, scope: !109, inlinedAt: !72)
!111 = !DILocation(line: 553, scope: !109, inlinedAt: !72)
!112 = !DILocation(line: 549, scope: !113, inlinedAt: !72)
!113 = distinct !DILexicalBlock(scope: !49, file: !50, line: 548, column: 2)
!114 = !DILocation(line: 551, scope: !113, inlinedAt: !72)
!115 = !DILocation(line: 553, scope: !113, inlinedAt: !72)
!116 = distinct !DISubprogram(name: "get_var_temp", linkageName: "std.os.env.get_var_temp", scope: !2, file: !2, line: 39, type: !117, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, retainedNodes: !42)
!117 = !DISubroutineType(types: !118)
!118 = !{!33, !35, !17}
!119 = !DILocalVariable(name: "name", arg: 1, scope: !116, file: !2, line: 39, type: !17)
!120 = !DILocation(line: 39, scope: !116)
!121 = !DILocation(line: 396, scope: !122, inlinedAt: !123)
!122 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11)
!123 = !DILocation(line: 41, scope: !116)
!124 = !DILocation(line: 398, scope: !125, inlinedAt: !123)
!125 = distinct !DILexicalBlock(scope: !122, file: !75, line: 397, column: 2)
