; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { i128, [32 x i8] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }

$std.collections.object.Object.to_format = comdat any

$std.collections.object.Object.free = comdat any

$std.collections.object.Object.is_null = comdat any

$std.collections.object.Object.is_empty = comdat any

$std.collections.object.Object.is_map = comdat any

$std.collections.object.Object.is_array = comdat any

$std.collections.object.Object.is_bool = comdat any

$std.collections.object.Object.is_string = comdat any

$std.collections.object.Object.is_float = comdat any

$std.collections.object.Object.is_int = comdat any

$std.collections.object.Object.is_keyable = comdat any

$std.collections.object.Object.is_indexable = comdat any

$std.collections.object.Object.set_object = comdat any

$std.collections.object.Object.get = comdat any

$std.collections.object.Object.has_key = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 16)
!2 = !DIFile(filename: "object.c3", directory: "C:/Program Files/c3c/lib/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 16, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 17, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 18, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 19, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 10, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 12, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 502, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 504, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 505, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 506, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 507, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 13, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 14, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 15, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 16, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 16)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 16)
!73 = !{i32 1, !"CodeView", i32 1}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 2, !"wchar_size", i32 2}
!76 = !{i32 4, !"PIC Level", i32 2}
!77 = !{i32 1, !"uwtable", i32 2}
!78 = !{i32 1, !"MaxTLSAlign", i32 65536}
!79 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !80, splitDebugInlining: false)
!80 = !{!0, !69, !71}
!81 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !82, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !104)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86, !43, !87}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !85)
!85 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 71, size: 384, align: 64, elements: !89, identifier: "std.io.Formatter")
!89 = !{!90, !91, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !2, line: 73, baseType: !11, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !88, file: !2, line: 74, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !93, align: 8)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DISubroutineType(types: !95)
!95 = !{!84, !11, !11, !28}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !2, line: 75, baseType: !97, size: 256, align: 64, offset: 128)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !88, file: !2, line: 75, size: 256, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !2, line: 77, baseType: !57, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !97, file: !2, line: 78, baseType: !57, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !97, file: !2, line: 79, baseType: !57, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !97, file: !2, line: 80, baseType: !30, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !97, file: !2, line: 81, baseType: !84, size: 64, align: 64, offset: 192)
!104 = !{}
!105 = !DILocation(line: 29, scope: !81)
!106 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !2, line: 28, type: !43)
!107 = !DILocation(line: 28, scope: !81)
!108 = !DILocalVariable(name: "formatter", arg: 2, scope: !81, file: !2, line: 28, type: !87)
!109 = !DILocation(line: 30, scope: !110)
!110 = distinct !DILexicalBlock(scope: !81, file: !2, line: 30, column: 2)
!111 = !DILocation(line: 32, scope: !110)
!112 = !DILocation(line: 33, scope: !113)
!113 = distinct !DILexicalBlock(scope: !110, file: !2, line: 33, column: 4)
!114 = !DILocation(line: 34, scope: !110)
!115 = !DILocation(line: 35, scope: !116)
!116 = distinct !DILexicalBlock(scope: !110, file: !2, line: 35, column: 4)
!117 = !DILocation(line: 36, scope: !110)
!118 = !DILocation(line: 37, scope: !119)
!119 = distinct !DILexicalBlock(scope: !110, file: !2, line: 37, column: 4)
!120 = !DILocation(line: 38, scope: !110)
!121 = !DILocation(line: 39, scope: !122)
!122 = distinct !DILexicalBlock(scope: !110, file: !2, line: 39, column: 4)
!123 = !DILocation(line: 40, scope: !110)
!124 = !DILocalVariable(name: "n", scope: !125, file: !2, line: 41, type: !30, align: 8)
!125 = distinct !DILexicalBlock(scope: !110, file: !2, line: 41, column: 4)
!126 = !DILocation(line: 41, scope: !125)
!127 = !DILocalVariable(name: ".temp", scope: !128, file: !2, line: 42, type: !129, align: 8)
!128 = distinct !DILexicalBlock(scope: !125, file: !2, line: 42, column: 4)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ObjectInternalList*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DILocation(line: 42, scope: !128)
!131 = !DILocalVariable(name: ".temp", scope: !128, file: !2, line: 42, type: !30, align: 8)
!132 = !DILocalVariable(name: "i", scope: !133, file: !2, line: 42, type: !30, align: 8)
!133 = distinct !DILexicalBlock(scope: !128, file: !2, line: 43, column: 4)
!134 = !DILocation(line: 42, scope: !133)
!135 = !DILocalVariable(name: "ol", scope: !133, file: !2, line: 42, type: !42, align: 8)
!136 = !DILocation(line: 368, scope: !137, inlinedAt: !134)
!137 = distinct !DILexicalBlock(scope: !139, file: !138, line: 371, column: 1)
!138 = !DIFile(filename: "list.c3", directory: "C:/Program Files/c3c/lib/std/collections")
!139 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !138, file: !138, line: 370, scopeLine: 370, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!140 = !DILocation(line: 372, scope: !139, inlinedAt: !134)
!141 = !DILocation(line: 44, scope: !142)
!142 = distinct !DILexicalBlock(scope: !133, file: !2, line: 43, column: 4)
!143 = !DILocation(line: 45, scope: !142)
!144 = !DILocation(line: 47, scope: !125)
!145 = !DILocation(line: 48, scope: !125)
!146 = !DILocation(line: 49, scope: !110)
!147 = !DILocalVariable(name: "n", scope: !148, file: !2, line: 50, type: !30, align: 8)
!148 = distinct !DILexicalBlock(scope: !110, file: !2, line: 50, column: 4)
!149 = !DILocation(line: 50, scope: !148)
!150 = !DILocalVariable(name: "buffer", scope: !151, file: !2, line: 488, type: !153, align: 16)
!151 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !152, file: !152, line: 486, scopeLine: 486, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !104)
!152 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1024, lowerBound: 0)
!156 = !DILocation(line: 488, scope: !151, inlinedAt: !157)
!157 = !DILocation(line: 51, scope: !148)
!158 = !DILocalVariable(name: "allocator", scope: !151, file: !2, line: 489, type: !159, align: 8)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !160, identifier: "std.core.mem.allocator.OnStackAllocator")
!160 = !{!161, !162, !163, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !159, file: !2, line: 5, baseType: !8, size: 128, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !2, line: 6, baseType: !24, size: 128, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !159, file: !2, line: 7, baseType: !30, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !159, file: !2, line: 8, baseType: !165, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !166, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !167, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !166, file: !2, line: 14, baseType: !21, size: 8, align: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !2, line: 15, baseType: !165, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !2, line: 16, baseType: !11, size: 64, align: 64, offset: 128)
!171 = !DILocation(line: 489, scope: !151, inlinedAt: !157)
!172 = !DILocation(line: 490, scope: !151, inlinedAt: !157)
!173 = !DILocalVariable(name: "mem", scope: !148, file: !2, line: 51, type: !8, align: 8)
!174 = !DILocation(line: 492, scope: !175, inlinedAt: !157)
!175 = distinct !DILexicalBlock(scope: !151, file: !152, line: 492, column: 2)
!176 = !DILocalVariable(name: ".temp", scope: !177, file: !2, line: 53, type: !179, align: 8)
!177 = distinct !DILexicalBlock(scope: !178, file: !2, line: 53, column: 5)
!178 = distinct !DILexicalBlock(scope: !148, file: !2, line: 52, column: 4)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key[]", size: 128, align: 64, elements: !180, identifier: "Key[]")
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !179, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Key*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, baseType: !30, size: 64, align: 64, offset: 64)
!184 = !DILocation(line: 53, scope: !177)
!185 = !DILocalVariable(name: ".temp", scope: !177, file: !2, line: 53, type: !30, align: 8)
!186 = !DILocalVariable(name: "i", scope: !187, file: !2, line: 53, type: !30, align: 8)
!187 = distinct !DILexicalBlock(scope: !177, file: !2, line: 54, column: 5)
!188 = !DILocation(line: 53, scope: !187)
!189 = !DILocalVariable(name: "key", scope: !187, file: !2, line: 53, type: !23, align: 8)
!190 = !DILocation(line: 55, scope: !191)
!191 = distinct !DILexicalBlock(scope: !187, file: !2, line: 54, column: 5)
!192 = !DILocation(line: 491, scope: !193, inlinedAt: !157)
!193 = distinct !DILexicalBlock(scope: !151, file: !152, line: 491, column: 8)
!194 = !DILocation(line: 56, scope: !191)
!195 = !DILocation(line: 491, scope: !196, inlinedAt: !157)
!196 = distinct !DILexicalBlock(scope: !151, file: !152, line: 491, column: 8)
!197 = !DILocation(line: 57, scope: !191)
!198 = !DILocation(line: 491, scope: !199, inlinedAt: !157)
!199 = distinct !DILexicalBlock(scope: !151, file: !152, line: 491, column: 8)
!200 = !DILocation(line: 491, scope: !201, inlinedAt: !157)
!201 = distinct !DILexicalBlock(scope: !151, file: !152, line: 491, column: 8)
!202 = !DILocation(line: 60, scope: !148)
!203 = !DILocation(line: 61, scope: !148)
!204 = !DILocation(line: 63, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !2, line: 63, column: 4)
!206 = distinct !DILexicalBlock(scope: !110, file: !2, line: 63, column: 4)
!207 = !DILocation(line: 66, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !2, line: 66, column: 6)
!209 = !DILocation(line: 68, scope: !210)
!210 = distinct !DILexicalBlock(scope: !205, file: !2, line: 68, column: 6)
!211 = !DILocation(line: 70, scope: !212)
!212 = distinct !DILexicalBlock(scope: !205, file: !2, line: 70, column: 6)
!213 = !DILocation(line: 72, scope: !214)
!214 = distinct !DILexicalBlock(scope: !205, file: !2, line: 72, column: 6)
!215 = !DILocation(line: 74, scope: !216)
!216 = distinct !DILexicalBlock(scope: !205, file: !2, line: 74, column: 6)
!217 = distinct !DISubprogram(name: "free", linkageName: "std.collections.object.Object.free", scope: !2, file: !2, line: 115, type: !218, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !104)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !43}
!220 = !DILocation(line: 116, scope: !217)
!221 = !DILocalVariable(name: "self", arg: 1, scope: !217, file: !2, line: 115, type: !43)
!222 = !DILocation(line: 115, scope: !217)
!223 = !DILocation(line: 117, scope: !224)
!224 = distinct !DILexicalBlock(scope: !217, file: !2, line: 117, column: 2)
!225 = !DILocation(line: 119, scope: !224)
!226 = !DILocation(line: 120, scope: !227)
!227 = distinct !DILexicalBlock(scope: !224, file: !2, line: 120, column: 4)
!228 = !DILocation(line: 121, scope: !224)
!229 = !DILocation(line: 122, scope: !230)
!230 = distinct !DILexicalBlock(scope: !224, file: !2, line: 122, column: 4)
!231 = !DILocation(line: 101, scope: !232, inlinedAt: !229)
!232 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !233, file: !233, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!233 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!234 = !DILocation(line: 105, scope: !232, inlinedAt: !229)
!235 = !DILocation(line: 123, scope: !224)
!236 = !DILocalVariable(name: ".temp", scope: !237, file: !2, line: 124, type: !129, align: 8)
!237 = distinct !DILexicalBlock(scope: !238, file: !2, line: 124, column: 4)
!238 = distinct !DILexicalBlock(scope: !224, file: !2, line: 124, column: 4)
!239 = !DILocation(line: 124, scope: !237)
!240 = !DILocalVariable(name: ".temp", scope: !237, file: !2, line: 124, type: !30, align: 8)
!241 = !DILocalVariable(name: "ol", scope: !242, file: !2, line: 124, type: !42, align: 8)
