; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }

$std.os.backtrace.Backtrace.has_file = comdat any

$std.os.backtrace.Backtrace.is_unknown = comdat any

$std.os.backtrace.Backtrace.to_format = comdat any

$std.os.backtrace.Backtrace.free = comdat any

$std.os.backtrace.Backtrace.init = comdat any

$std.os.backtrace.capture_current = comdat any

$.dyn_search = comdat any

$"std.os.backtrace.BacktraceFault$SEGMENT_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$EXECUTABLE_PATH_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$IMAGE_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$NO_BACKTRACE_SYMBOLS" = comdat any

$"std.os.backtrace.BacktraceFault$RESOLUTION_FAILED" = comdat any

$"$ct.std.os.backtrace.BacktraceFault" = comdat any

$"$ct.std.os.backtrace.Backtrace" = comdat any

$"$ct.void" = comdat any

$std.os.backtrace.BACKTRACE_UNKNOWN = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "C:/Program Files/c3c/lib/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 17, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 18, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 19, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 20, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 21, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 22, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 23, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 1, !"CodeView", i32 1}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 2}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 2}
!35 = !{i32 1, !"MaxTLSAlign", i32 65536}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 27, type: !39, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!39 = !DISubroutineType(types: !40)
!40 = !{!29, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !{}
!43 = !DILocation(line: 28, scope: !38)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 27, type: !41)
!45 = !DILocation(line: 27, scope: !38)
!46 = !DILocation(line: 29, scope: !38)
!47 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 32, type: !39, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!48 = !DILocation(line: 33, scope: !47)
!49 = !DILocalVariable(name: "self", arg: 1, scope: !47, file: !2, line: 32, type: !41)
!50 = !DILocation(line: 32, scope: !47)
!51 = !DILocation(line: 34, scope: !47)
!52 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 37, type: !53, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !57, !41, !58}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !56)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 71, size: 384, align: 64, elements: !60, identifier: "std.io.Formatter")
!60 = !{!61, !62, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 73, baseType: !25, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !59, file: !2, line: 74, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DISubroutineType(types: !66)
!66 = !{!55, !25, !25, !14}
!67 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, line: 75, baseType: !68, size: 256, align: 64, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !59, file: !2, line: 75, size: 256, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !2, line: 77, baseType: !20, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !68, file: !2, line: 78, baseType: !20, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !68, file: !2, line: 79, baseType: !20, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !68, file: !2, line: 80, baseType: !16, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !68, file: !2, line: 81, baseType: !55, size: 64, align: 64, offset: 192)
!75 = !DILocation(line: 38, scope: !52)
!76 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !2, line: 37, type: !41)
!77 = !DILocation(line: 37, scope: !52)
!78 = !DILocalVariable(name: "formatter", arg: 2, scope: !52, file: !2, line: 37, type: !58)
!79 = !DILocalVariable(name: "inline_suffix", scope: !52, file: !2, line: 39, type: !9, align: 8)
!80 = !DILocation(line: 39, scope: !52)
!81 = !DILocation(line: 40, scope: !52)
!82 = !DILocation(line: 42, scope: !83)
!83 = distinct !DILexicalBlock(scope: !52, file: !2, line: 41, column: 2)
!84 = !DILocation(line: 44, scope: !52)
!85 = !DILocation(line: 46, scope: !86)
!86 = distinct !DILexicalBlock(scope: !52, file: !2, line: 45, column: 2)
!87 = !DILocation(line: 48, scope: !52)
!88 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 50, type: !89, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !41}
!91 = !DILocation(line: 51, scope: !88)
!92 = !DILocalVariable(name: "self", arg: 1, scope: !88, file: !2, line: 50, type: !41)
!93 = !DILocation(line: 50, scope: !88)
!94 = !DILocation(line: 52, scope: !88)
!95 = !DILocation(line: 53, scope: !88)
!96 = !DILocation(line: 101, scope: !97, inlinedAt: !95)
!97 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !98, file: !98, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!98 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!99 = !DILocation(line: 105, scope: !97, inlinedAt: !95)
!100 = !DILocation(line: 54, scope: !88)
!101 = !DILocation(line: 101, scope: !102, inlinedAt: !100)
!102 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !98, file: !98, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!103 = !DILocation(line: 105, scope: !102, inlinedAt: !100)
!104 = !DILocation(line: 55, scope: !88)
!105 = !DILocation(line: 101, scope: !106, inlinedAt: !104)
!106 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !98, file: !98, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!107 = !DILocation(line: 105, scope: !106, inlinedAt: !104)
!108 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 58, type: !109, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!109 = !DISubroutineType(types: !110)
!110 = !{!41, !41, !7, !9, !9, !9, !20, !22}
!111 = !DILocation(line: 59, scope: !108)
!112 = !DILocalVariable(name: "self", arg: 1, scope: !108, file: !2, line: 58, type: !41)
!113 = !DILocation(line: 58, scope: !108)
!114 = !DILocalVariable(name: "offset", arg: 2, scope: !108, file: !2, line: 58, type: !6)
!115 = !DILocalVariable(name: "function", arg: 3, scope: !108, file: !2, line: 58, type: !9)
!116 = !DILocalVariable(name: "object_file", arg: 4, scope: !108, file: !2, line: 58, type: !9)
!117 = !DILocalVariable(name: "file", arg: 5, scope: !108, file: !2, line: 58, type: !9)
!118 = !DILocalVariable(name: "line", arg: 6, scope: !108, file: !2, line: 58, type: !20)
!119 = !DILocalVariable(name: "allocator", arg: 7, scope: !108, file: !2, line: 58, type: !22)
!120 = !DILocation(line: 60, scope: !108)
!121 = !DILocation(line: 62, scope: !122)
!122 = distinct !DILexicalBlock(scope: !108, file: !2, line: 61, column: 2)
!123 = !DILocation(line: 63, scope: !122)
!124 = !DILocation(line: 64, scope: !122)
!125 = !DILocation(line: 65, scope: !122)
!126 = !DILocation(line: 66, scope: !122)
!127 = !DILocation(line: 67, scope: !122)
!128 = !DILocation(line: 68, scope: !122)
!129 = !DILocation(line: 70, scope: !108)
!130 = !DILocation(line: 71, scope: !108)
!131 = !DILocation(line: 72, scope: !108)
!132 = !DILocation(line: 73, scope: !108)
!133 = !DILocation(line: 74, scope: !108)
!134 = !DILocation(line: 75, scope: !108)
!135 = !DILocation(line: 76, scope: !108)
!136 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 79, type: !137, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !139}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !140, identifier: "void*[]")
!140 = !{!141, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !139, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, baseType: !16, size: 64, align: 64, offset: 64)
!144 = !DILocalVariable(name: "buffer", arg: 1, scope: !136, file: !2, line: 79, type: !139)
!145 = !DILocation(line: 79, scope: !136)
!146 = !DILocation(line: 81, scope: !136)
!147 = !DILocalVariable(name: "len", scope: !136, file: !2, line: 87, type: !148, align: 2)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !2, file: !2, line: 169, baseType: !149, align: 2)
!149 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!150 = !DILocation(line: 87, scope: !136)
!151 = !DILocation(line: 88, scope: !136)
