; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"void*[]", %NativeConditionVariable }
%NativeMutex = type { %.anon, i32, i8, i8 }
%.anon = type { [5 x i64] }
%"QueueItem[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%NativeConditionVariable = type { %.anon.0, i32, [5 x i64] }
%.anon.0 = type { %.anon.1 }
%.anon.1 = type { ptr, ptr }
%"any[]" = type { ptr, i64 }
%QueueItem = type { ptr, %"any[]" }

$std.thread.threadpool.FixedThreadPool.init = comdat any

$std.thread.threadpool.FixedThreadPool.destroy = comdat any

$std.thread.threadpool.FixedThreadPool.stop_and_destroy = comdat any

$std.thread.threadpool.FixedThreadPool.push = comdat any

$.dyn_search = comdat any

$"std.thread.threadpool.ThreadPoolResult$QUEUE_FULL" = comdat any

$"$ct.std.thread.threadpool.ThreadPoolResult" = comdat any

$"$ct.std.thread.threadpool.FixedThreadPool" = comdat any

$"$ct.std.thread.threadpool.QueueItem" = comdat any

$"$ct.anyfault" = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "fixed_pool.c3", directory: "C:/Program Files/c3c/lib/std/threads")
!8 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !7, file: !7, line: 39, type: !9, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !92)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !14, !27, !27}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !7, file: !7, line: 13, size: 1344, align: 64, elements: !16, identifier: "std.thread.threadpool.FixedThreadPool")
!16 = !{!17, !37, !62, !63, !64, !66, !74}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !15, file: !7, line: 15, baseType: !18, size: 384, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !7, file: !7, line: 11, baseType: !19, align: 8)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !7, file: !7, line: 6, size: 384, align: 64, elements: !20, identifier: "std.thread.os.NativeMutex")
!20 = !{!21, !32, !34, !36}
!21 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !7, line: 8, baseType: !22, size: 320, align: 64)
!22 = !DICompositeType(tag: DW_TAG_union_type, scope: !19, file: !7, line: 8, size: 320, align: 64, elements: !23)
!23 = !{!24, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "critical_section", scope: !22, file: !7, line: 10, baseType: !25, size: 320, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_CRITICAL_SECTION", scope: !7, file: !7, line: 191, baseType: !26, align: 8)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 320, align: 64, elements: !28)
!27 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!28 = !{!29}
!29 = !DISubrange(count: 5, lowerBound: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !22, file: !7, line: 11, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !7, file: !7, line: 17, baseType: !13, align: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "locks", scope: !19, file: !7, line: 15, baseType: !33, size: 32, align: 32, offset: 320)
!33 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !19, file: !7, line: 16, baseType: !35, size: 8, align: 8, offset: 352)
!35 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "timed", scope: !19, file: !7, line: 17, baseType: !35, size: 8, align: 8, offset: 360)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !15, file: !7, line: 16, baseType: !38, size: 128, align: 64, offset: 384)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !39, identifier: "QueueItem[]")
!39 = !{!40, !61}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !7, file: !7, line: 28, size: 192, align: 64, elements: !43, identifier: "std.thread.threadpool.QueueItem")
!43 = !{!44, !60}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !42, file: !7, line: 30, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !7, file: !7, line: 11, baseType: !46, align: 8)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !50, identifier: "any[]")
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !54, identifier: "any")
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, baseType: !13, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !27)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !42, file: !7, line: 31, baseType: !49, size: 128, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !59, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !15, file: !7, line: 17, baseType: !59, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !15, file: !7, line: 18, baseType: !59, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !7, line: 19, baseType: !65, size: 8, align: 8, offset: 640)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !15, file: !7, line: 24, baseType: !67, size: 128, align: 64, offset: 704)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !68, identifier: "Thread[]")
!68 = !{!69, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !67, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !7, file: !7, line: 16, baseType: !72, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeThread", scope: !7, file: !7, line: 4, baseType: !13, align: 8)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, baseType: !59, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !15, file: !7, line: 25, baseType: !75, size: 512, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !7, file: !7, line: 15, baseType: !76, align: 8)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeConditionVariable", scope: !7, file: !7, line: 26, size: 512, align: 64, elements: !77, identifier: "std.thread.os.NativeConditionVariable")
!77 = !{!78, !90, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !76, file: !7, line: 28, baseType: !79, size: 128, align: 64)
!79 = !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !7, line: 28, size: 128, align: 64, elements: !80)
!80 = !{!81, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !79, file: !7, line: 30, baseType: !82, size: 128, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !79, file: !7, line: 30, size: 128, align: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "event_one", scope: !82, file: !7, line: 32, baseType: !31, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "event_all", scope: !82, file: !7, line: 33, baseType: !31, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !79, file: !7, line: 35, baseType: !87, size: 128, align: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 64, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 2, lowerBound: 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "waiters_count", scope: !76, file: !7, line: 37, baseType: !33, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "waiters_count_lock", scope: !76, file: !7, line: 38, baseType: !25, size: 320, align: 64, offset: 192)
!92 = !{}
!93 = !DILocation(line: 40, scope: !8)
!94 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 39, type: !14)
!95 = !DILocation(line: 39, scope: !8)
!96 = !DILocalVariable(name: "threads", arg: 2, scope: !8, file: !7, line: 39, type: !59)
!97 = !DILocalVariable(name: "queue_size", arg: 3, scope: !8, file: !7, line: 39, type: !59)
!98 = !DILocation(line: 35, scope: !99)
!99 = distinct !DILexicalBlock(scope: !8, file: !7, line: 40, column: 1)
!100 = !DILocation(line: 36, scope: !99)
!101 = !DILocation(line: 37, scope: !99)
!102 = !DILocation(line: 41, scope: !8)
!103 = !DILocation(line: 43, scope: !8)
!104 = !DILocation(line: 44, scope: !8)
!105 = !DILocation(line: 45, scope: !8)
!106 = !DILocation(line: 46, scope: !8)
!107 = !DILocation(line: 286, scope: !108, inlinedAt: !110)
!108 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !109, file: !109, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!109 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!110 = !DILocation(line: 269, scope: !111, inlinedAt: !112)
!111 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !109, file: !109, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!112 = !DILocation(line: 712, scope: !113, inlinedAt: !115)
!113 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !114, file: !114, line: 710, scopeLine: 710, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!114 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!115 = !DILocation(line: 47, scope: !8)
!116 = !DILocation(line: 62, scope: !117, inlinedAt: !107)
!117 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !109, file: !109, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!118 = !DILocation(line: 28, scope: !119, inlinedAt: !120)
!119 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !109, file: !109, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!120 = !DILocation(line: 68, scope: !117, inlinedAt: !107)
!121 = !DILocation(line: 252, scope: !122, inlinedAt: !123)
!122 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !109, file: !109, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!123 = !DILocation(line: 244, scope: !124, inlinedAt: !125)
!124 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !109, file: !109, line: 242, scopeLine: 242, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!125 = !DILocation(line: 695, scope: !126, inlinedAt: !127)
!126 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !114, file: !114, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!127 = !DILocation(line: 48, scope: !8)
!128 = !DILocation(line: 79, scope: !129, inlinedAt: !121)
!129 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !109, file: !109, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!130 = !DILocation(line: 28, scope: !131, inlinedAt: !132)
!131 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !109, file: !109, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!132 = !DILocation(line: 80, scope: !129, inlinedAt: !121)
!133 = !DILocation(line: 50, scope: !8)
!134 = !DILocation(line: 37, scope: !135, inlinedAt: !133)
