; ModuleID = 'std::math::uuid'
source_filename = "std::math::uuid"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.math.uuid.Uuid.to_format = comdat any

$std.math.uuid.Uuid.to_string = comdat any

$std.math.uuid.generate = comdat any

$std.math.uuid.generate_from_random = comdat any

$.dyn_search = comdat any

$"$ct.std.math.uuid.Uuid" = comdat any

$"$ct.a16$char" = comdat any

$"$ct.char" = comdat any

$"$ct.std.math.random.Sfc64Random" = comdat any

$"$ct.a4$ulong" = comdat any

$"$ct.ulong" = comdat any

$"$sel.next_bytes" = comdat any

$"$ct.dyn.std.math.uuid.Uuid.to_format" = comdat any

$"$sel.to_format" = comdat any

$"$ct.dyn.std.math.uuid.Uuid.to_string" = comdat any

$"$sel.to_string" = comdat any

@"$ct.std.math.uuid.Uuid" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.a16$char" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.a16$char" = linkonce global %.introspect { i8 15, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 16, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "uuid.c3", directory: "C:/Program Files/c3c/lib/std/math")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.math.uuid.Uuid.to_format", scope: !7, file: !7, line: 28, type: !9, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !16, !22}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !15)
!15 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Uuid*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uuid", scope: !7, file: !7, line: 5, baseType: !18, align: 1)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, align: 8, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!21}
!21 = !DISubrange(count: 16, lowerBound: 0)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 71, size: 384, align: 64, elements: !24, identifier: "std.io.Formatter")
!24 = !{!25, !27, !32}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !23, file: !7, line: 73, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !23, file: !7, line: 74, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 23, baseType: !29, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DISubroutineType(types: !31)
!31 = !{!11, !26, !26, !19}
!32 = !DIDerivedType(tag: DW_TAG_member, scope: !23, file: !7, line: 75, baseType: !33, size: 256, align: 64, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !23, file: !7, line: 75, size: 256, align: 64, elements: !34)
!34 = !{!35, !37, !38, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !7, line: 77, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !7, line: 78, baseType: !36, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !33, file: !7, line: 79, baseType: !36, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !33, file: !7, line: 80, baseType: !14, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !33, file: !7, line: 81, baseType: !11, size: 64, align: 64, offset: 192)
!41 = !{}
!42 = !DILocation(line: 29, scope: !8)
!43 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 28, type: !16)
!44 = !DILocation(line: 28, scope: !8)
!45 = !DILocalVariable(name: "formatter", arg: 2, scope: !8, file: !7, line: 28, type: !22)
!46 = !DILocation(line: 31, scope: !8)
!47 = !DILocation(line: 32, scope: !8)
!48 = !DILocation(line: 33, scope: !8)
!49 = !DILocation(line: 34, scope: !8)
!50 = !DILocation(line: 35, scope: !8)
!51 = !DILocation(line: 30, scope: !8)
!52 = distinct !DISubprogram(name: "to_string", linkageName: "std.math.uuid.Uuid.to_string", scope: !7, file: !7, line: 38, type: !53, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !16, !61}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !57, identifier: "char[]")
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, baseType: !14, size: 64, align: 64, offset: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !62, identifier: "Allocator")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !61, baseType: !26, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!66 = !DILocation(line: 39, scope: !52)
!67 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !7, line: 38, type: !16)
!68 = !DILocation(line: 38, scope: !52)
!69 = !DILocalVariable(name: "allocator", arg: 2, scope: !52, file: !7, line: 38, type: !61)
!70 = !DILocation(line: 40, scope: !52)
!71 = distinct !DISubprogram(name: "generate", linkageName: "std.math.uuid.generate", scope: !7, file: !7, line: 10, type: !72, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6)
!72 = !DISubroutineType(types: !73)
!73 = !{!17}
!74 = !DILocation(line: 179, scope: !75, inlinedAt: !77)
!75 = distinct !DISubprogram(name: "init_default_random", linkageName: "init_default_random", scope: !76, file: !76, line: 177, scopeLine: 177, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!76 = !DIFile(filename: "math_random.c3", directory: "C:/Program Files/c3c/lib/std/math")
!77 = !DILocation(line: 12, scope: !71)
!78 = !DILocation(line: 136, scope: !79, inlinedAt: !80)
!79 = distinct !DISubprogram(name: "is_random", linkageName: "is_random", scope: !76, file: !76, line: 136, scopeLine: 136, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!80 = !DILocation(line: 24, scope: !81, inlinedAt: !83)
!81 = distinct !DILexicalBlock(scope: !82, file: !76, line: 27, column: 1)
!82 = distinct !DISubprogram(name: "seed_entropy", linkageName: "seed_entropy", scope: !76, file: !76, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!83 = !DILocation(line: 181, scope: !84, inlinedAt: !77)
!84 = distinct !DILexicalBlock(scope: !75, file: !76, line: 180, column: 2)
!85 = !DILocation(line: 28, scope: !82, inlinedAt: !83)
!86 = !DILocation(line: 182, scope: !84, inlinedAt: !77)
!87 = !DILocation(line: 13, scope: !71)
!88 = distinct !DISubprogram(name: "generate_from_random", linkageName: "std.math.uuid.generate_from_random", scope: !7, file: !7, line: 19, type: !89, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!89 = !DISubroutineType(types: !90)
!90 = !{!17, !91}
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Random", size: 128, align: 64, elements: !92, identifier: "Random")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !26, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, baseType: !65, size: 64, align: 64, offset: 64)
!95 = !DILocalVariable(name: "random", arg: 1, scope: !88, file: !7, line: 19, type: !91)
!96 = !DILocation(line: 19, scope: !88)
!97 = !DILocalVariable(name: "uuid", scope: !88, file: !7, line: 21, type: !17, align: 16)
!98 = !DILocation(line: 21, scope: !88)
!99 = !DILocation(line: 22, scope: !88)
!100 = !DILocation(line: 23, scope: !88)
!101 = !DILocation(line: 24, scope: !88)
!102 = !DILocation(line: 25, scope: !88)
