; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%TempState = type { ptr, ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.core.mem.aligned_offset = comdat any

$std.core.mem.ptr_is_aligned = comdat any

$std.core.mem.temp_push = comdat any

$std.core.mem.temp_pop = comdat any

$std.core.mem.malloc = comdat any

$std.core.mem.malloc_aligned = comdat any

$std.core.mem.tmalloc = comdat any

$std.core.mem.calloc = comdat any

$std.core.mem.calloc_aligned = comdat any

$std.core.mem.tcalloc = comdat any

$std.core.mem.realloc = comdat any

$std.core.mem.realloc_aligned = comdat any

$std.core.mem.free = comdat any

$std.core.mem.free_aligned = comdat any

$std.core.mem.trealloc = comdat any

$.dyn_search = comdat any

$"$ct.std.core.mem.TempState" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.mem.AtomicOrdering" = comdat any

$std.core.mem.MAX_MEMORY_ALIGNMENT = comdat any

$std.core.mem.DEFAULT_MEM_ALIGNMENT = comdat any

$"$sel.acquire" = comdat any

$"$ct.anyfault" = comdat any

$"$sel.release" = comdat any

$"$sel.resize" = comdat any

@"$ct.std.core.mem.TempState" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 9, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !{i32 1, !"CodeView", i32 1}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 2, !"wchar_size", i32 2}
!10 = !{i32 4, !"PIC Level", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = !{i32 1, !"MaxTLSAlign", i32 65536}
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !14, splitDebugInlining: false)
!14 = !{!0, !4}
!15 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 266, type: !16, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19, !19}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !19)
!19 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!20 = !{}
!21 = !DILocalVariable(name: "offset", arg: 1, scope: !15, file: !2, line: 266, type: !18)
!22 = !DILocation(line: 266, scope: !15)
!23 = !DILocalVariable(name: "alignment", arg: 2, scope: !15, file: !2, line: 266, type: !18)
!24 = !DILocation(line: 1021, scope: !25, inlinedAt: !27)
!25 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !26, file: !26, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!26 = !DIFile(filename: "math.c3", directory: "C:/Program Files/c3c/lib/std/math")
!27 = !DILocation(line: 264, scope: !28)
!28 = distinct !DILexicalBlock(scope: !15, file: !2, line: 267, column: 1)
!29 = !DILocation(line: 268, scope: !15)
!30 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 279, type: !31, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !34, !19}
!33 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DILocalVariable(name: "ptr", arg: 1, scope: !30, file: !2, line: 279, type: !34)
!36 = !DILocation(line: 279, scope: !30)
!37 = !DILocalVariable(name: "alignment", arg: 2, scope: !30, file: !2, line: 279, type: !18)
!38 = !DILocation(line: 1021, scope: !39, inlinedAt: !40)
!39 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !26, file: !26, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!40 = !DILocation(line: 277, scope: !41)
!41 = distinct !DILexicalBlock(scope: !30, file: !2, line: 280, column: 1)
!42 = !DILocation(line: 281, scope: !30)
!43 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 516, type: !44, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !49}
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempState", scope: !2, file: !2, line: 507, size: 192, align: 64, elements: !47, identifier: "std.core.mem.TempState")
!47 = !{!48, !75, !76}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !46, file: !2, line: 509, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !51, identifier: "std.core.mem.allocator.TempAllocator")
!51 = !{!52, !58, !72, !73, !74}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !50, file: !2, line: 12, baseType: !53, size: 128, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !54, identifier: "Allocator")
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, baseType: !34, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !50, file: !2, line: 13, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !61, identifier: "std.core.mem.allocator.TempAllocatorPage")
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !60, file: !2, line: 24, baseType: !59, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !60, file: !2, line: 25, baseType: !34, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !60, file: !2, line: 26, baseType: !18, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !2, line: 27, baseType: !18, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !60, file: !2, line: 28, baseType: !18, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !2, line: 29, baseType: !68, align: 8, offset: 320)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, align: 8, elements: !70)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !{!71}
!71 = !DISubrange(count: 0, lowerBound: 0)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !50, file: !2, line: 14, baseType: !18, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !50, file: !2, line: 15, baseType: !18, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !2, line: 16, baseType: !68, align: 8, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !46, file: !2, line: 510, baseType: !49, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !46, file: !2, line: 511, baseType: !18, size: 64, align: 64, offset: 128)
!77 = !DILocalVariable(name: "other", arg: 1, scope: !43, file: !2, line: 516, type: !49)
!78 = !DILocation(line: 516, scope: !43)
!79 = !DILocalVariable(name: "current", scope: !43, file: !2, line: 518, type: !49, align: 8)
!80 = !DILocation(line: 518, scope: !43)
!81 = !DILocation(line: 396, scope: !82, inlinedAt: !80)
!82 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !83, file: !83, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!83 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!84 = !DILocation(line: 398, scope: !85, inlinedAt: !80)
!85 = distinct !DILexicalBlock(scope: !82, file: !83, line: 397, column: 2)
!86 = !DILocation(line: 400, scope: !82, inlinedAt: !80)
!87 = !DILocalVariable(name: "old", scope: !43, file: !2, line: 519, type: !49, align: 8)
!88 = !DILocation(line: 519, scope: !43)
!89 = !DILocation(line: 520, scope: !43)
!90 = !DILocation(line: 522, scope: !91)
!91 = distinct !DILexicalBlock(scope: !43, file: !2, line: 521, column: 2)
!92 = !DILocation(line: 524, scope: !43)
!93 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 530, type: !94, scopeLine: 530, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !46}
!96 = !DILocalVariable(name: "old_state", arg: 1, scope: !93, file: !2, line: 530, type: !46)
!97 = !DILocation(line: 530, scope: !93)
!98 = !DILocation(line: 532, scope: !93)
!99 = !DILocation(line: 533, scope: !93)
!100 = !DILocation(line: 534, scope: !93)
!101 = !DILocation(line: 535, scope: !93)
!102 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 599, type: !103, scopeLine: 599, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!103 = !DISubroutineType(types: !104)
!104 = !{!34, !19}
!105 = !DILocalVariable(name: "size", arg: 1, scope: !102, file: !2, line: 599, type: !18)
!106 = !DILocation(line: 599, scope: !102)
!107 = !DILocation(line: 62, scope: !108, inlinedAt: !109)
!108 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !83, file: !83, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!109 = !DILocation(line: 57, scope: !110, inlinedAt: !111)
!110 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !83, file: !83, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!111 = !DILocation(line: 601, scope: !102)
!112 = !DILocation(line: 28, scope: !113, inlinedAt: !114)
!113 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !83, file: !83, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!114 = !DILocation(line: 68, scope: !108, inlinedAt: !109)
!115 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "std.core.mem.malloc_aligned", scope: !2, file: !2, line: 608, type: !116, scopeLine: 608, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!116 = !DISubroutineType(types: !117)
!117 = !{!34, !19, !19}
!118 = !DILocalVariable(name: "size", arg: 1, scope: !115, file: !2, line: 608, type: !18)
!119 = !DILocation(line: 608, scope: !115)
!120 = !DILocalVariable(name: "alignment", arg: 2, scope: !115, file: !2, line: 608, type: !18)
!121 = !DILocation(line: 110, scope: !122, inlinedAt: !123)
!122 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !83, file: !83, line: 108, scopeLine: 108, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!123 = !DILocation(line: 610, scope: !115)
!124 = !DILocation(line: 116, scope: !122, inlinedAt: !123)
