; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"fn void!()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%TestContext = type { [32 x i64] }

$std.core.runtime.benchmark_collection_create = comdat any

$std.core.runtime.set_benchmark_warmup_iterations = comdat any

$std.core.runtime.set_benchmark_max_iterations = comdat any

$std.core.runtime.run_benchmarks = comdat any

$std.core.runtime.default_benchmark_runner = comdat any

$std.core.runtime.test_collection_create = comdat any

$std.core.runtime.cmp_test_unit = comdat any

$std.core.runtime.test_panic = comdat any

$std.core.runtime.run_tests = comdat any

$std.core.runtime.default_test_runner = comdat any

$.dyn_search = comdat any

$"$ct.std.core.runtime.AnyRaw" = comdat any

$"$ct.std.core.runtime.SliceRaw" = comdat any

$"$ct.std.core.runtime.BenchmarkUnit" = comdat any

$"$ct.std.core.runtime.TestUnit" = comdat any

$"$ct.std.core.runtime.TestContext" = comdat any

$std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 45, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "runtime.c3", directory: "C:/Program Files/c3c/lib/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 46, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 48, type: !8, isLocal: true, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 49, type: !8, isLocal: true, isDefinition: true, align: 4)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !2, file: !2, line: 182, type: !13, isLocal: true, isDefinition: true, align: 8)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !2, file: !2, line: 163, size: 2048, align: 64, elements: !15, identifier: "std.core.runtime.TestContext")
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !14, file: !2, line: 165, baseType: !17, size: 2048, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !2, file: !2, line: 36, baseType: !18, align: 8)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, align: 64, elements: !20)
!19 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!20 = !{!21}
!21 = !DISubrange(count: 32, lowerBound: 0)
!22 = !{i32 1, !"CodeView", i32 1}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 2}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 2}
!27 = !{i32 1, !"MaxTLSAlign", i32 65536}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !29, splitDebugInlining: false)
!29 = !{!0, !4, !6, !9, !11}
!30 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 33, type: !31, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !57}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !34)
!34 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !36, identifier: "BenchmarkUnit[]")
!36 = !{!37, !56}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 27, size: 192, align: 64, elements: !40, identifier: "std.core.runtime.BenchmarkUnit")
!40 = !{!41, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !2, line: 29, baseType: !42, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !44, identifier: "char[]")
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !19)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !39, file: !2, line: 30, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 25, baseType: !52, align: 8)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DISubroutineType(types: !54)
!54 = !{!33, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, baseType: !49, size: 64, align: 64, offset: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !58, identifier: "Allocator")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !57, baseType: !55, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!62 = !{}
!63 = !DILocalVariable(name: "allocator", arg: 1, scope: !30, file: !2, line: 33, type: !57)
!64 = !DILocation(line: 33, scope: !30)
!65 = !DILocalVariable(name: "fns", scope: !30, file: !2, line: 35, type: !66, align: 8)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !67, identifier: "BenchmarkFn[]")
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !66, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, baseType: !49, size: 64, align: 64, offset: 64)
!71 = !DILocation(line: 35, scope: !30)
!72 = !DILocalVariable(name: "names", scope: !30, file: !2, line: 36, type: !73, align: 8)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !74, identifier: "String[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !49, size: 64, align: 64, offset: 64)
!78 = !DILocation(line: 36, scope: !30)
!79 = !DILocalVariable(name: "benchmarks", scope: !30, file: !2, line: 37, type: !35, align: 8)
!80 = !DILocation(line: 37, scope: !30)
!81 = !DILocation(line: 286, scope: !82, inlinedAt: !84)
!82 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !83, file: !83, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!83 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!84 = !DILocation(line: 269, scope: !85, inlinedAt: !80)
!85 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !83, file: !83, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!86 = !DILocation(line: 62, scope: !87, inlinedAt: !81)
!87 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !83, file: !83, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!88 = !DILocation(line: 28, scope: !89, inlinedAt: !90)
!89 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !83, file: !83, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!90 = !DILocation(line: 68, scope: !87, inlinedAt: !81)
!91 = !DILocalVariable(name: ".temp", scope: !92, file: !2, line: 38, type: !49, align: 8)
!92 = distinct !DILexicalBlock(scope: !30, file: !2, line: 38, column: 2)
!93 = !DILocation(line: 38, scope: !92)
!94 = !DILocalVariable(name: "i", scope: !95, file: !2, line: 38, type: !49, align: 8)
!95 = distinct !DILexicalBlock(scope: !92, file: !2, line: 39, column: 2)
!96 = !DILocation(line: 38, scope: !95)
!97 = !DILocalVariable(name: "benchmark", scope: !95, file: !2, line: 38, type: !52, align: 8)
!98 = !DILocation(line: 40, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !2, line: 39, column: 2)
!100 = !DILocation(line: 42, scope: !30)
!101 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 51, type: !102, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !8}
!104 = !DILocalVariable(name: "value", arg: 1, scope: !101, file: !2, line: 51, type: !8)
!105 = !DILocation(line: 51, scope: !101)
!106 = !DILocation(line: 53, scope: !101)
!107 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 56, type: !102, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!108 = !DILocalVariable(name: "value", arg: 1, scope: !107, file: !2, line: 56, type: !8)
!109 = !DILocation(line: 56, scope: !107)
!110 = !DILocation(line: 58, scope: !107)
!111 = !DILocation(line: 59, scope: !107)
!112 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 62, type: !113, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !35}
!115 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!116 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !112, file: !2, line: 62, type: !35)
!117 = !DILocation(line: 62, scope: !112)
!118 = !DILocalVariable(name: "benchmarks_passed", scope: !112, file: !2, line: 64, type: !3, align: 4)
!119 = !DILocation(line: 64, scope: !112)
!120 = !DILocalVariable(name: "benchmark_count", scope: !112, file: !2, line: 65, type: !3, align: 4)
!121 = !DILocation(line: 65, scope: !112)
!122 = !DILocalVariable(name: "max_name", scope: !112, file: !2, line: 66, type: !49, align: 8)
!123 = !DILocation(line: 66, scope: !112)
!124 = !DILocalVariable(name: ".temp", scope: !125, file: !2, line: 68, type: !49, align: 8)
!125 = distinct !DILexicalBlock(scope: !112, file: !2, line: 68, column: 2)
!126 = !DILocation(line: 68, scope: !125)
!127 = !DILocalVariable(name: "unit", scope: !128, file: !2, line: 68, type: !38, align: 8)
!128 = distinct !DILexicalBlock(scope: !125, file: !2, line: 69, column: 2)
!129 = !DILocation(line: 68, scope: !128)
!130 = !DILocation(line: 70, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !2, line: 69, column: 2)
!132 = !DILocalVariable(name: "len", scope: !112, file: !2, line: 73, type: !49, align: 8)
!133 = !DILocation(line: 73, scope: !112)
!134 = !DILocalVariable(name: "name", scope: !112, file: !2, line: 75, type: !135, align: 8)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !136, align: 8)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!138 = !DILocation(line: 75, scope: !112)
!139 = !DILocation(line: 76, scope: !112)
!140 = !DILocation(line: 397, scope: !141, inlinedAt: !143)
!141 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !142, file: !142, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!142 = !DIFile(filename: "dstring.c3", directory: "C:/Program Files/c3c/lib/std/core")
!143 = !DILocation(line: 77, scope: !112)
!144 = !DILocation(line: 78, scope: !112)
!145 = !DILocation(line: 200, scope: !146, inlinedAt: !148)
!146 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !147, file: !147, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!147 = !DIFile(filename: "io.c3", directory: "C:/Program Files/c3c/lib/std/io")
!148 = !DILocation(line: 80, scope: !112)
!149 = !DILocalVariable(name: "len", scope: !150, file: !2, line: 174, type: !49, align: 8)
!150 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !147, file: !147, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!151 = !DILocation(line: 174, scope: !150, inlinedAt: !145)
!152 = !DILocation(line: 120, scope: !153, inlinedAt: !151)
!153 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !147, file: !147, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!154 = !DILocation(line: 175, scope: !150, inlinedAt: !145)
!155 = !DILocation(line: 180, scope: !150, inlinedAt: !145)
!156 = !DILocation(line: 182, scope: !150, inlinedAt: !145)
!157 = !DILocation(line: 82, scope: !112)
!158 = !DILocalVariable(name: "sys_clock_started", scope: !112, file: !2, line: 84, type: !34, align: 8)
!159 = !DILocation(line: 84, scope: !112)
!160 = !DILocalVariable(name: "sys_clock_finished", scope: !112, file: !2, line: 85, type: !34, align: 8)
!161 = !DILocation(line: 85, scope: !112)
!162 = !DILocalVariable(name: "sys_clocks", scope: !112, file: !2, line: 86, type: !34, align: 8)
!163 = !DILocation(line: 86, scope: !112)
!164 = !DILocalVariable(name: "clock", scope: !112, file: !2, line: 87, type: !165, align: 8)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !19, align: 8)
!166 = !DILocation(line: 87, scope: !112)
!167 = !DILocalVariable(name: "err", scope: !112, file: !2, line: 88, type: !33, align: 8)
!168 = !DILocation(line: 88, scope: !112)
!169 = !DILocalVariable(name: ".temp", scope: !170, file: !2, line: 90, type: !49, align: 8)
!170 = distinct !DILexicalBlock(scope: !112, file: !2, line: 90, column: 2)
!171 = !DILocation(line: 90, scope: !170)
!172 = !DILocalVariable(name: "unit", scope: !173, file: !2, line: 90, type: !39, align: 8)
!173 = distinct !DILexicalBlock(scope: !170, file: !2, line: 91, column: 2)
!174 = !DILocation(line: 90, scope: !173)
!175 = !DILocation(line: 93, scope: !176)
!176 = distinct !DILexicalBlock(scope: !173, file: !2, line: 91, column: 2)
!177 = !DILocation(line: 94, scope: !176)
!178 = !DILocation(line: 95, scope: !176)
!179 = !DILocalVariable(name: "i", scope: !180, file: !2, line: 97, type: !8, align: 4)
!180 = distinct !DILexicalBlock(scope: !176, file: !2, line: 97, column: 3)
!181 = !DILocation(line: 97, scope: !180)
!182 = !DILocalVariable(name: "f", scope: !183, file: !2, line: 353, type: !33, align: 8)
!183 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !184, file: !184, line: 351, scopeLine: 351, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!184 = !DIFile(filename: "builtin.c3", directory: "C:/Program Files/c3c/lib/std/core")
!185 = !DILocation(line: 353, scope: !183, inlinedAt: !186)
!186 = !DILocation(line: 99, scope: !187)
!187 = distinct !DILexicalBlock(scope: !180, file: !2, line: 98, column: 3)
!188 = !DILocation(line: 99, scope: !183, inlinedAt: !186)
!189 = !DILocation(line: 354, scope: !183, inlinedAt: !186)
!190 = !DILocation(line: 192, scope: !191, inlinedAt: !193)
!191 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !192, file: !192, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!192 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!193 = !DILocation(line: 100, scope: !187)
!194 = !DILocation(line: 103, scope: !176)
!195 = !DILocation(line: 104, scope: !176)
!196 = !DILocalVariable(name: "i", scope: !197, file: !2, line: 106, type: !8, align: 4)
!197 = distinct !DILexicalBlock(scope: !176, file: !2, line: 106, column: 3)
!198 = !DILocation(line: 106, scope: !197)
!199 = !DILocalVariable(name: "f", scope: !200, file: !2, line: 353, type: !33, align: 8)
!200 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !184, file: !184, line: 351, scopeLine: 351, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!201 = !DILocation(line: 353, scope: !200, inlinedAt: !202)
!202 = !DILocation(line: 108, scope: !203)
!203 = distinct !DILexicalBlock(scope: !197, file: !2, line: 107, column: 3)
!204 = !DILocation(line: 108, scope: !200, inlinedAt: !202)
!205 = !DILocation(line: 354, scope: !200, inlinedAt: !202)
!206 = !DILocation(line: 192, scope: !207, inlinedAt: !208)
!207 = distinct !DISubprogram(name: "@volatile_load", linkageName: "@volatile_load", scope: !192, file: !192, line: 190, scopeLine: 190, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!208 = !DILocation(line: 109, scope: !203)
!209 = !DILocation(line: 112, scope: !176)
!210 = !DILocalVariable(name: "nano_seconds", scope: !176, file: !2, line: 113, type: !211, align: 8)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !34, align: 8)
!212 = !DILocation(line: 113, scope: !176)
!213 = !DILocation(line: 114, scope: !176)
!214 = !DILocation(line: 116, scope: !176)
!215 = !DILocation(line: 118, scope: !216)
!216 = distinct !DILexicalBlock(scope: !176, file: !2, line: 117, column: 3)
!217 = !DILocation(line: 92, scope: !218)
!218 = distinct !DILexicalBlock(scope: !176, file: !2, line: 92, column: 9)
!219 = !DILocation(line: 122, scope: !176)
!220 = !DILocation(line: 123, scope: !176)
!221 = !DILocation(line: 92, scope: !222)
!222 = distinct !DILexicalBlock(scope: !176, file: !2, line: 92, column: 9)
!223 = !DILocation(line: 126, scope: !112)
!224 = !DILocation(line: 128, scope: !112)
!225 = !DILocation(line: 129, scope: !112)
!226 = !DILocation(line: 130, scope: !112)
!227 = !DILocation(line: 127, scope: !112)
!228 = !DILocation(line: 132, scope: !112)
!229 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 135, type: !230, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28)
!230 = !DISubroutineType(types: !231)
!231 = !{!115}
!232 = !DILocalVariable(name: "current", scope: !233, file: !2, line: 540, type: !234, align: 8)
!233 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !192, file: !192, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !235, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !236, identifier: "std.core.mem.allocator.TempAllocator")
!236 = !{!237, !238, !251, !252, !253}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !235, file: !2, line: 12, baseType: !57, size: 128, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !235, file: !2, line: 13, baseType: !239, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !240, size: 64, align: 64, dwarfAddressSpace: 0)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !241, identifier: "std.core.mem.allocator.TempAllocatorPage")
!241 = !{!242, !243, !244, !245, !246, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !240, file: !2, line: 24, baseType: !239, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !240, file: !2, line: 25, baseType: !55, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !240, file: !2, line: 26, baseType: !49, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !240, file: !2, line: 27, baseType: !49, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !240, file: !2, line: 28, baseType: !49, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !2, line: 29, baseType: !248, align: 8, offset: 320)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 0, lowerBound: 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !235, file: !2, line: 14, baseType: !49, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !235, file: !2, line: 15, baseType: !49, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !2, line: 16, baseType: !248, align: 8, offset: 320)
!254 = !DILocation(line: 540, scope: !233, inlinedAt: !255)
!255 = !DILocation(line: 137, scope: !229)
!256 = !DILocation(line: 396, scope: !257, inlinedAt: !254)
!257 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !83, file: !83, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!258 = !DILocation(line: 398, scope: !259, inlinedAt: !254)
!259 = distinct !DILexicalBlock(scope: !257, file: !83, line: 397, column: 2)
!260 = !DILocation(line: 400, scope: !257, inlinedAt: !254)
!261 = !DILocalVariable(name: "mark", scope: !233, file: !2, line: 546, type: !49, align: 8)
!262 = !DILocation(line: 546, scope: !233, inlinedAt: !255)
!263 = !DILocation(line: 396, scope: !264, inlinedAt: !265)
!264 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !83, file: !83, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!265 = !DILocation(line: 139, scope: !266)
!266 = distinct !DILexicalBlock(scope: !229, file: !2, line: 138, column: 2)
!267 = !DILocation(line: 398, scope: !268, inlinedAt: !265)
!268 = distinct !DILexicalBlock(scope: !264, file: !83, line: 397, column: 2)
!269 = !DILocation(line: 400, scope: !264, inlinedAt: !265)
!270 = !DILocation(line: 549, scope: !271, inlinedAt: !255)
!271 = distinct !DILexicalBlock(scope: !233, file: !192, line: 548, column: 2)
!272 = !DILocation(line: 553, scope: !271, inlinedAt: !255)
!273 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !2, file: !2, line: 151, type: !274, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!274 = !DISubroutineType(types: !275)
!275 = !{!33, !276, !57}
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !277, identifier: "TestUnit[]")
!277 = !{!278, !286}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !276, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !280, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !2, file: !2, line: 145, size: 192, align: 64, elements: !281, identifier: "std.core.runtime.TestUnit")
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !2, line: 147, baseType: !42, size: 128, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !280, file: !2, line: 148, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !2, file: !2, line: 143, baseType: !285, align: 8)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !276, baseType: !49, size: 64, align: 64, offset: 64)
!287 = !DILocalVariable(name: "allocator", arg: 1, scope: !273, file: !2, line: 151, type: !57)
!288 = !DILocation(line: 151, scope: !273)
!289 = !DILocalVariable(name: "fns", scope: !273, file: !2, line: 153, type: !290, align: 8)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !291, identifier: "TestFn[]")
!291 = !{!292, !294}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !290, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !284, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !290, baseType: !49, size: 64, align: 64, offset: 64)
!295 = !DILocation(line: 153, scope: !273)
!296 = !DILocalVariable(name: "names", scope: !273, file: !2, line: 154, type: !73, align: 8)
!297 = !DILocation(line: 154, scope: !273)
!298 = !DILocalVariable(name: "tests", scope: !273, file: !2, line: 155, type: !276, align: 8)
!299 = !DILocation(line: 155, scope: !273)
!300 = !DILocation(line: 286, scope: !301, inlinedAt: !302)
!301 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !83, file: !83, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!302 = !DILocation(line: 269, scope: !303, inlinedAt: !299)
!303 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !83, file: !83, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!304 = !DILocation(line: 62, scope: !305, inlinedAt: !300)
!305 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !83, file: !83, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!306 = !DILocation(line: 28, scope: !307, inlinedAt: !308)
!307 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !83, file: !83, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!308 = !DILocation(line: 68, scope: !305, inlinedAt: !300)
!309 = !DILocalVariable(name: ".temp", scope: !310, file: !2, line: 156, type: !49, align: 8)
!310 = distinct !DILexicalBlock(scope: !273, file: !2, line: 156, column: 2)
!311 = !DILocation(line: 156, scope: !310)
!312 = !DILocalVariable(name: "i", scope: !313, file: !2, line: 156, type: !49, align: 8)
!313 = distinct !DILexicalBlock(scope: !310, file: !2, line: 157, column: 2)
!314 = !DILocation(line: 156, scope: !313)
!315 = !DILocalVariable(name: "test", scope: !313, file: !2, line: 156, type: !285, align: 8)
!316 = !DILocation(line: 158, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !2, line: 157, column: 2)
!318 = !DILocation(line: 160, scope: !273)
!319 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !2, file: !2, line: 169, type: !320, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!320 = !DISubroutineType(types: !321)
!321 = !{!3, !280, !280}
!322 = !DILocalVariable(name: "a", arg: 1, scope: !319, file: !2, line: 169, type: !280)
!323 = !DILocation(line: 169, scope: !319)
!324 = !DILocalVariable(name: "b", arg: 2, scope: !319, file: !2, line: 169, type: !280)
!325 = !DILocalVariable(name: "an", scope: !319, file: !2, line: 171, type: !49, align: 8)
!326 = !DILocation(line: 171, scope: !319)
!327 = !DILocalVariable(name: "bn", scope: !319, file: !2, line: 172, type: !49, align: 8)
!328 = !DILocation(line: 172, scope: !319)
!329 = !DILocation(line: 173, scope: !319)
!330 = !DILocalVariable(name: "temp", scope: !331, file: !2, line: 44, type: !280, align: 8)
!331 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !184, file: !184, line: 42, scopeLine: 42, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !62)
!332 = !DILocation(line: 44, scope: !331, inlinedAt: !329)
!333 = !DILocation(line: 45, scope: !331, inlinedAt: !329)
!334 = !DILocation(line: 46, scope: !331, inlinedAt: !329)
!335 = !DILocalVariable(name: ".temp", scope: !336, file: !2, line: 174, type: !76, align: 8)
!336 = distinct !DILexicalBlock(scope: !319, file: !2, line: 174, column: 2)
!337 = !DILocation(line: 174, scope: !336)
!338 = !DILocalVariable(name: ".temp", scope: !336, file: !2, line: 174, type: !49, align: 8)
!339 = !DILocalVariable(name: "i", scope: !340, file: !2, line: 174, type: !49, align: 8)
!340 = distinct !DILexicalBlock(scope: !336, file: !2, line: 175, column: 2)
!341 = !DILocation(line: 174, scope: !340)
