; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%File = type { ptr }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

$std.compression.qoi.write = comdat any

$std.compression.qoi.read = comdat any

$std.compression.qoi.encode = comdat any

$std.compression.qoi.decode = comdat any

$.dyn_search = comdat any

$"$ct.std.compression.qoi.QOIDesc" = comdat any

$"std.compression.qoi.QOIError$INVALID_PARAMETERS" = comdat any

$"std.compression.qoi.QOIError$FILE_OPEN_FAILED" = comdat any

$"std.compression.qoi.QOIError$FILE_WRITE_FAILED" = comdat any

$"std.compression.qoi.QOIError$INVALID_DATA" = comdat any

$"std.compression.qoi.QOIError$TOO_MANY_PIXELS" = comdat any

$"$ct.std.compression.qoi.QOIError" = comdat any

$"$ct.char" = comdat any

$"$ct.std.compression.qoi.QOIColorspace" = comdat any

$"std.compression.qoi.QOIColorspace$id" = comdat any

$"$ct.std.compression.qoi.QOIChannels" = comdat any

$"std.compression.qoi.QOIChannels$id" = comdat any

$"$ct.std.compression.qoi.Header" = comdat any

$"$ct.std.compression.qoi.Pixel" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "C:/Program Files/c3c/lib/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 393, type: !6, isLocal: true, isDefinition: true, align: 1)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 394, type: !6, isLocal: true, isDefinition: true, align: 1)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 396, type: !6, isLocal: true, isDefinition: true, align: 1)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 397, type: !6, isLocal: true, isDefinition: true, align: 1)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 398, type: !6, isLocal: true, isDefinition: true, align: 1)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 399, type: !6, isLocal: true, isDefinition: true, align: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 412, type: !19, isLocal: true, isDefinition: true, align: 1)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 1, !"CodeView", i32 1}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 2}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 2}
!27 = !{i32 1, !"MaxTLSAlign", i32 65536}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !45, splitDebugInlining: false)
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !31, file: !2, line: 22, baseType: !6, size: 8, align: 8, elements: !41)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 33, size: 96, align: 32, elements: !32, identifier: "std.compression.qoi.QOIDesc")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !2, line: 35, baseType: !3, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !2, line: 37, baseType: !30, size: 8, align: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !31, file: !2, line: 38, baseType: !37, size: 8, align: 8, offset: 72)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !31, file: !2, line: 10, baseType: !6, size: 8, align: 8, elements: !38)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "SRGB", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "LINEAR", value: 1, isUnsigned: true)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "AUTO", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "RGB", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "RGBA", value: 2, isUnsigned: true)
!45 = !{!0, !4, !7, !9, !11, !13, !15, !17}
!46 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 74, type: !47, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !54, !55, !60}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !50)
!50 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !53)
!53 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !52, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !{}
!62 = !DILocalVariable(name: "filename", arg: 1, scope: !46, file: !2, line: 74, type: !54)
!63 = !DILocation(line: 74, scope: !46)
!64 = !DILocalVariable(name: "input", arg: 2, scope: !46, file: !2, line: 74, type: !55)
!65 = !DILocation(line: 75, scope: !46)
!66 = !DILocalVariable(name: "desc", arg: 3, scope: !46, file: !2, line: 74, type: !60)
!67 = !DILocalVariable(name: "current", scope: !68, file: !2, line: 540, type: !70, align: 8)
!68 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !69, file: !69, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!69 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !72, identifier: "std.core.mem.allocator.TempAllocator")
!72 = !{!73, !80, !93, !94, !95}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !71, file: !2, line: 12, baseType: !74, size: 128, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !75, identifier: "Allocator")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !74, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !71, file: !2, line: 13, baseType: !81, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !83, identifier: "std.core.mem.allocator.TempAllocatorPage")
!83 = !{!84, !85, !86, !87, !88, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !82, file: !2, line: 24, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !82, file: !2, line: 25, baseType: !77, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !82, file: !2, line: 26, baseType: !52, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !2, line: 27, baseType: !52, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !82, file: !2, line: 28, baseType: !52, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !2, line: 29, baseType: !90, align: 8, offset: 320)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 0, lowerBound: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !71, file: !2, line: 14, baseType: !52, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !71, file: !2, line: 15, baseType: !52, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !2, line: 16, baseType: !90, align: 8, offset: 320)
!96 = !DILocation(line: 540, scope: !68, inlinedAt: !97)
!97 = !DILocation(line: 76, scope: !46)
!98 = !DILocation(line: 396, scope: !99, inlinedAt: !96)
!99 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !100, file: !100, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!100 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!101 = !DILocation(line: 398, scope: !102, inlinedAt: !96)
!102 = distinct !DILexicalBlock(scope: !99, file: !100, line: 397, column: 2)
!103 = !DILocation(line: 400, scope: !99, inlinedAt: !96)
!104 = !DILocalVariable(name: "mark", scope: !68, file: !2, line: 546, type: !52, align: 8)
!105 = !DILocation(line: 546, scope: !68, inlinedAt: !97)
!106 = !DILocalVariable(name: "output", scope: !107, file: !2, line: 78, type: !55, align: 8)
!107 = distinct !DILexicalBlock(scope: !46, file: !2, line: 76, column: 10)
!108 = !DILocation(line: 78, scope: !107)
!109 = !DILocation(line: 549, scope: !110, inlinedAt: !97)
!110 = distinct !DILexicalBlock(scope: !68, file: !69, line: 548, column: 2)
!111 = !DILocation(line: 553, scope: !110, inlinedAt: !97)
!112 = !DILocalVariable(name: "f", scope: !107, file: !2, line: 81, type: !113, align: 8)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !114, identifier: "std.io.File")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !113, file: !2, line: 6, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 354, baseType: !77, align: 8)
!117 = !DILocation(line: 81, scope: !107)
!118 = !DILocation(line: 82, scope: !107)
!119 = !DILocation(line: 549, scope: !120, inlinedAt: !97)
!120 = distinct !DILexicalBlock(scope: !68, file: !69, line: 548, column: 2)
!121 = !DILocation(line: 553, scope: !120, inlinedAt: !97)
!122 = !DILocalVariable(name: "written", scope: !107, file: !2, line: 85, type: !53, align: 8)
!123 = !DILocation(line: 85, scope: !107)
!124 = !DILocation(line: 86, scope: !107)
!125 = !DILocation(line: 549, scope: !126, inlinedAt: !97)
!126 = distinct !DILexicalBlock(scope: !68, file: !69, line: 548, column: 2)
!127 = !DILocation(line: 553, scope: !126, inlinedAt: !97)
!128 = !DILocation(line: 87, scope: !107)
!129 = !DILocation(line: 549, scope: !130, inlinedAt: !97)
!130 = distinct !DILexicalBlock(scope: !68, file: !69, line: 548, column: 2)
!131 = !DILocation(line: 553, scope: !130, inlinedAt: !97)
!132 = !DILocation(line: 89, scope: !107)
!133 = !DILocation(line: 549, scope: !134, inlinedAt: !97)
!134 = distinct !DILexicalBlock(scope: !68, file: !69, line: 548, column: 2)
!135 = !DILocation(line: 553, scope: !134, inlinedAt: !97)
!136 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 115, type: !137, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!137 = !DISubroutineType(types: !138)
!138 = !{!49, !139, !54, !60, !30, !74}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!140 = !DILocalVariable(name: "filename", arg: 1, scope: !136, file: !2, line: 115, type: !54)
!141 = !DILocation(line: 115, scope: !136)
!142 = !DILocation(line: 116, scope: !136)
!143 = !DILocalVariable(name: "desc", arg: 2, scope: !136, file: !2, line: 115, type: !60)
!144 = !DILocalVariable(name: "channels", arg: 3, scope: !136, file: !2, line: 115, type: !30)
!145 = !DILocalVariable(name: "allocator", arg: 4, scope: !136, file: !2, line: 115, type: !74)
!146 = !DILocalVariable(name: "data", scope: !136, file: !2, line: 118, type: !55, align: 8)
!147 = !DILocation(line: 118, scope: !136)
!148 = !DILocation(line: 119, scope: !136)
!149 = !DILocation(line: 123, scope: !136)
!150 = !DILocation(line: 120, scope: !151)
!151 = distinct !DILexicalBlock(scope: !136, file: !2, line: 120, column: 13)
!152 = !DILocation(line: 120, scope: !153)
!153 = distinct !DILexicalBlock(scope: !136, file: !2, line: 120, column: 13)
!154 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 144, type: !155, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!155 = !DISubroutineType(types: !156)
!156 = !{!49, !139, !55, !60, !74}
!157 = !DILocalVariable(name: "input", arg: 1, scope: !154, file: !2, line: 144, type: !55)
!158 = !DILocation(line: 144, scope: !154)
!159 = !DILocation(line: 145, scope: !154)
!160 = !DILocalVariable(name: "desc", arg: 2, scope: !154, file: !2, line: 144, type: !60)
!161 = !DILocalVariable(name: "allocator", arg: 3, scope: !154, file: !2, line: 144, type: !74)
!162 = !DILocation(line: 147, scope: !154)
!163 = !DILocation(line: 148, scope: !154)
!164 = !DILocalVariable(name: "pixels", scope: !154, file: !2, line: 149, type: !3, align: 4)
!165 = !DILocation(line: 149, scope: !154)
!166 = !DILocation(line: 150, scope: !154)
!167 = !DILocalVariable(name: "image_size", scope: !154, file: !2, line: 153, type: !3, align: 4)
!168 = !DILocation(line: 153, scope: !154)
!169 = !DILocation(line: 154, scope: !154)
!170 = !DILocalVariable(name: "max_size", scope: !154, file: !2, line: 158, type: !3, align: 4)
!171 = !DILocation(line: 158, scope: !154)
!172 = !DILocalVariable(name: "output", scope: !154, file: !2, line: 159, type: !55, align: 8)
!173 = !DILocation(line: 159, scope: !154)
!174 = !DILocation(line: 286, scope: !175, inlinedAt: !176)
!175 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !100, file: !100, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!176 = !DILocation(line: 269, scope: !177, inlinedAt: !173)
!177 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !100, file: !100, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!178 = !DILocation(line: 62, scope: !179, inlinedAt: !174)
!179 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !100, file: !100, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!180 = !DILocation(line: 28, scope: !181, inlinedAt: !182)
!181 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !100, file: !100, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!182 = !DILocation(line: 68, scope: !179, inlinedAt: !174)
!183 = !DILocation(line: 163, scope: !154)
!184 = !DILocation(line: 11, scope: !185, inlinedAt: !187)
!185 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!186 = !DIFile(filename: "bits.c3", directory: "C:/Program Files/c3c/lib/std")
!187 = !DILocation(line: 164, scope: !154)
!188 = !DILocation(line: 165, scope: !154)
!189 = !DILocation(line: 11, scope: !190, inlinedAt: !188)
!190 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!191 = !DILocation(line: 166, scope: !154)
!192 = !DILocation(line: 11, scope: !193, inlinedAt: !191)
!193 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!194 = !DILocation(line: 167, scope: !154)
!195 = !DILocation(line: 168, scope: !154)
!196 = !DILocalVariable(name: "pos", scope: !154, file: !2, line: 171, type: !3, align: 4)
!197 = !DILocation(line: 171, scope: !154)
!198 = !DILocalVariable(name: "loc", scope: !154, file: !2, line: 172, type: !3, align: 4)
!199 = !DILocation(line: 172, scope: !154)
!200 = !DILocalVariable(name: "loc_end", scope: !154, file: !2, line: 173, type: !3, align: 4)
!201 = !DILocation(line: 173, scope: !154)
!202 = !DILocalVariable(name: "run_length", scope: !154, file: !2, line: 174, type: !6, align: 1)
!203 = !DILocation(line: 174, scope: !154)
!204 = !DILocalVariable(name: "palette", scope: !154, file: !2, line: 176, type: !205, align: 16)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 2048, align: 32, elements: !210)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 423, baseType: !207, align: 4)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, flags: DIFlagVector, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 4, lowerBound: 0)
!210 = !{!211}
!211 = !DISubrange(count: 64, lowerBound: 0)
!212 = !DILocation(line: 176, scope: !154)
!213 = !DILocalVariable(name: "prev", scope: !154, file: !2, line: 177, type: !206, align: 4)
!214 = !DILocation(line: 177, scope: !154)
!215 = !DILocalVariable(name: "p", scope: !154, file: !2, line: 178, type: !206, align: 4)
!216 = !DILocation(line: 178, scope: !154)
!217 = !DILocalVariable(name: "diff", scope: !154, file: !2, line: 180, type: !218, align: 4)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 32, align: 8, flags: DIFlagVector, elements: !220)
!219 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!220 = !{!221}
!221 = !DISubrange(count: 3, lowerBound: 0)
!222 = !DILocation(line: 180, scope: !154)
!223 = !DILocalVariable(name: "luma", scope: !154, file: !2, line: 181, type: !218, align: 4)
!224 = !DILocation(line: 181, scope: !154)
!225 = !DILocation(line: 184, scope: !226)
!226 = distinct !DILexicalBlock(scope: !154, file: !2, line: 184, column: 2)
!227 = !DILocation(line: 187, scope: !228)
!228 = distinct !DILexicalBlock(scope: !226, file: !2, line: 185, column: 2)
!229 = !DILocation(line: 190, scope: !228)
!230 = !DILocation(line: 191, scope: !228)
!231 = !DILocation(line: 194, scope: !228)
!232 = !DILocation(line: 195, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !2, line: 194, column: 18)
!234 = !DILocation(line: 196, scope: !233)
!235 = !DILocalVariable(name: "chunk", scope: !236, file: !2, line: 473, type: !237, align: 8)
!236 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DILocation(line: 473, scope: !236, inlinedAt: !239)
!239 = !DILocation(line: 197, scope: !240)
!240 = distinct !DILexicalBlock(scope: !233, file: !2, line: 196, column: 44)
!241 = !DILocation(line: 474, scope: !236, inlinedAt: !239)
!242 = !DILocation(line: 475, scope: !236, inlinedAt: !239)
!243 = !DILocation(line: 198, scope: !240)
!244 = !DILocation(line: 202, scope: !245)
!245 = distinct !DILexicalBlock(scope: !228, file: !2, line: 200, column: 10)
!246 = !DILocalVariable(name: "chunk", scope: !247, file: !2, line: 473, type: !237, align: 8)
!247 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!248 = !DILocation(line: 473, scope: !247, inlinedAt: !249)
!249 = !DILocation(line: 203, scope: !250)
!250 = distinct !DILexicalBlock(scope: !245, file: !2, line: 202, column: 24)
!251 = !DILocation(line: 474, scope: !247, inlinedAt: !249)
!252 = !DILocation(line: 475, scope: !247, inlinedAt: !249)
!253 = !DILocation(line: 204, scope: !250)
!254 = !DILocation(line: 425, scope: !255, inlinedAt: !256)
!255 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!256 = !DILocation(line: 209, scope: !257)
!257 = distinct !DILexicalBlock(scope: !245, file: !2, line: 207, column: 4)
!258 = !DILocalVariable(name: "chunk", scope: !259, file: !2, line: 473, type: !260, align: 8)
!259 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!261 = !DILocation(line: 473, scope: !259, inlinedAt: !262)
!262 = !DILocation(line: 210, scope: !263)
!263 = distinct !DILexicalBlock(scope: !257, file: !2, line: 210, column: 6)
!264 = !DILocation(line: 474, scope: !259, inlinedAt: !262)
!265 = !DILocation(line: 475, scope: !259, inlinedAt: !262)
!266 = !DILocation(line: 425, scope: !267, inlinedAt: !268)
!267 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!268 = !DILocation(line: 212, scope: !263)
!269 = !DILocation(line: 216, scope: !257)
!270 = !DILocation(line: 218, scope: !271)
!271 = distinct !DILexicalBlock(scope: !257, file: !2, line: 218, column: 6)
!272 = !DILocation(line: 220, scope: !271)
!273 = !DILocation(line: 221, scope: !271)
!274 = !DILocation(line: 222, scope: !271)
!275 = !DILocalVariable(name: "chunk", scope: !276, file: !2, line: 473, type: !277, align: 8)
!276 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = !DILocation(line: 473, scope: !276, inlinedAt: !279)
!279 = !DILocation(line: 224, scope: !280)
!280 = distinct !DILexicalBlock(scope: !271, file: !2, line: 223, column: 8)
!281 = !DILocation(line: 474, scope: !276, inlinedAt: !279)
!282 = !DILocation(line: 475, scope: !276, inlinedAt: !279)
!283 = !DILocation(line: 226, scope: !280)
!284 = !DILocation(line: 227, scope: !280)
!285 = !DILocation(line: 228, scope: !280)
!286 = !DILocation(line: 425, scope: !287, inlinedAt: !288)
!287 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!288 = !DILocation(line: 230, scope: !280)
!289 = !DILocation(line: 233, scope: !290)
!290 = distinct !DILexicalBlock(scope: !271, file: !2, line: 231, column: 13)
!291 = !DILocation(line: 235, scope: !290)
!292 = !DILocation(line: 236, scope: !290)
!293 = !DILocation(line: 237, scope: !290)
!294 = !DILocalVariable(name: "chunk", scope: !295, file: !2, line: 473, type: !296, align: 8)
!295 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!298 = !DILocation(line: 473, scope: !295, inlinedAt: !299)
!299 = !DILocation(line: 239, scope: !300)
!300 = distinct !DILexicalBlock(scope: !290, file: !2, line: 238, column: 9)
!301 = !DILocation(line: 474, scope: !295, inlinedAt: !299)
!302 = !DILocation(line: 475, scope: !295, inlinedAt: !299)
!303 = !DILocation(line: 241, scope: !300)
!304 = !DILocation(line: 242, scope: !300)
!305 = !DILocation(line: 243, scope: !300)
!306 = !DILocation(line: 425, scope: !307, inlinedAt: !308)
!307 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!308 = !DILocation(line: 245, scope: !300)
!309 = !DILocation(line: 246, scope: !310)
!310 = distinct !DILexicalBlock(scope: !290, file: !2, line: 246, column: 14)
!311 = !DILocation(line: 251, scope: !312)
!312 = distinct !DILexicalBlock(scope: !257, file: !2, line: 251, column: 6)
!313 = !DILocalVariable(name: "chunk", scope: !314, file: !2, line: 473, type: !315, align: 8)
!314 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 435, size: 40, align: 8, elements: !317, identifier: "std.compression.qoi.OpRGBA")
!317 = !{!318, !319, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !316, file: !2, line: 437, baseType: !6, size: 8, align: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !316, file: !2, line: 438, baseType: !6, size: 8, align: 8, offset: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !316, file: !2, line: 439, baseType: !6, size: 8, align: 8, offset: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !316, file: !2, line: 440, baseType: !6, size: 8, align: 8, offset: 24)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !316, file: !2, line: 441, baseType: !6, size: 8, align: 8, offset: 32)
!323 = !DILocation(line: 473, scope: !314, inlinedAt: !324)
!324 = !DILocation(line: 252, scope: !325)
!325 = distinct !DILexicalBlock(scope: !312, file: !2, line: 251, column: 25)
!326 = !DILocation(line: 474, scope: !314, inlinedAt: !324)
!327 = !DILocation(line: 475, scope: !314, inlinedAt: !324)
!328 = !DILocalVariable(name: "chunk", scope: !329, file: !2, line: 473, type: !330, align: 8)
!329 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !331, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 428, size: 32, align: 8, elements: !332, identifier: "std.compression.qoi.OpRGB")
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !331, file: !2, line: 430, baseType: !6, size: 8, align: 8)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !331, file: !2, line: 431, baseType: !6, size: 8, align: 8, offset: 8)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !331, file: !2, line: 432, baseType: !6, size: 8, align: 8, offset: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !331, file: !2, line: 433, baseType: !6, size: 8, align: 8, offset: 24)
!337 = !DILocation(line: 473, scope: !329, inlinedAt: !338)
!338 = !DILocation(line: 254, scope: !339)
!339 = distinct !DILexicalBlock(scope: !312, file: !2, line: 253, column: 13)
!340 = !DILocation(line: 474, scope: !329, inlinedAt: !338)
!341 = !DILocation(line: 475, scope: !329, inlinedAt: !338)
!342 = !DILocation(line: 425, scope: !343, inlinedAt: !344)
!343 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!344 = !DILocation(line: 256, scope: !312)
!345 = !DILocation(line: 262, scope: !154)
!346 = !DILocation(line: 263, scope: !154)
!347 = !DILocation(line: 265, scope: !154)
!348 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 290, type: !349, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!349 = !DISubroutineType(types: !350)
!350 = !{!49, !139, !55, !60, !30, !74}
!351 = !DILocalVariable(name: "data", arg: 1, scope: !348, file: !2, line: 290, type: !55)
!352 = !DILocation(line: 290, scope: !348)
!353 = !DILocation(line: 291, scope: !348)
!354 = !DILocalVariable(name: "desc", arg: 2, scope: !348, file: !2, line: 290, type: !60)
!355 = !DILocalVariable(name: "channels", arg: 3, scope: !348, file: !2, line: 290, type: !30)
!356 = !DILocalVariable(name: "allocator", arg: 4, scope: !348, file: !2, line: 290, type: !74)
!357 = !DILocation(line: 293, scope: !348)
!358 = !DILocalVariable(name: "header", scope: !348, file: !2, line: 296, type: !359, align: 8)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !360, size: 64, align: 64, dwarfAddressSpace: 0)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 401, size: 112, align: 8, elements: !361, identifier: "std.compression.qoi.Header")
!361 = !{!362, !363, !364, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !360, file: !2, line: 403, baseType: !3, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !360, file: !2, line: 404, baseType: !3, size: 32, align: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !360, file: !2, line: 405, baseType: !3, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !360, file: !2, line: 408, baseType: !6, size: 8, align: 8, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !360, file: !2, line: 409, baseType: !6, size: 8, align: 8, offset: 104)
!367 = !DILocation(line: 296, scope: !348)
!368 = !DILocation(line: 299, scope: !348)
!369 = !DILocation(line: 11, scope: !370, inlinedAt: !368)
!370 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!371 = !DILocation(line: 302, scope: !348)
!372 = !DILocation(line: 11, scope: !373, inlinedAt: !371)
!373 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!374 = !DILocation(line: 303, scope: !348)
!375 = !DILocation(line: 11, scope: !376, inlinedAt: !374)
!376 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !186, file: !186, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!377 = !DILocation(line: 304, scope: !348)
!378 = !DILocalVariable(name: ".temp", scope: !379, file: !2, line: 417, type: !381, align: 1)
!379 = distinct !DILexicalBlock(scope: !380, file: !2, line: 417, column: 2)
!380 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !220)
!382 = !DILocation(line: 417, scope: !379, inlinedAt: !377)
!383 = !DILocalVariable(name: ".temp", scope: !379, file: !2, line: 417, type: !52, align: 8)
!384 = !DILocalVariable(name: "value", scope: !385, file: !2, line: 417, type: !30, align: 1)
!385 = distinct !DILexicalBlock(scope: !379, file: !2, line: 417, column: 33)
!386 = !DILocation(line: 417, scope: !385, inlinedAt: !377)
!387 = !DILocation(line: 418, scope: !388, inlinedAt: !377)
!388 = distinct !DILexicalBlock(scope: !385, file: !2, line: 417, column: 33)
!389 = !DILocation(line: 420, scope: !380, inlinedAt: !377)
!390 = !DILocation(line: 305, scope: !348)
!391 = !DILocalVariable(name: ".temp", scope: !392, file: !2, line: 417, type: !394, align: 1)
!392 = distinct !DILexicalBlock(scope: !393, file: !2, line: 417, column: 2)
!393 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16, align: 8, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 2, lowerBound: 0)
!397 = !DILocation(line: 417, scope: !392, inlinedAt: !390)
!398 = !DILocalVariable(name: ".temp", scope: !392, file: !2, line: 417, type: !52, align: 8)
!399 = !DILocalVariable(name: "value", scope: !400, file: !2, line: 417, type: !37, align: 1)
!400 = distinct !DILexicalBlock(scope: !392, file: !2, line: 417, column: 33)
!401 = !DILocation(line: 417, scope: !400, inlinedAt: !390)
!402 = !DILocation(line: 418, scope: !403, inlinedAt: !390)
!403 = distinct !DILexicalBlock(scope: !400, file: !2, line: 417, column: 33)
!404 = !DILocation(line: 420, scope: !393, inlinedAt: !390)
!405 = !DILocation(line: 306, scope: !348)
!406 = !DILocation(line: 309, scope: !348)
!407 = !DILocalVariable(name: "pixels", scope: !348, file: !2, line: 312, type: !53, align: 8)
!408 = !DILocation(line: 312, scope: !348)
!409 = !DILocation(line: 313, scope: !348)
!410 = !DILocalVariable(name: "pos", scope: !348, file: !2, line: 315, type: !3, align: 4)
!411 = !DILocation(line: 315, scope: !348)
!412 = !DILocalVariable(name: "loc", scope: !348, file: !2, line: 316, type: !3, align: 4)
!413 = !DILocation(line: 316, scope: !348)
!414 = !DILocalVariable(name: "run_length", scope: !348, file: !2, line: 317, type: !6, align: 1)
!415 = !DILocation(line: 317, scope: !348)
