; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"ushort[]" = type { ptr, i64 }
%File = type { ptr }
%Win32_FILE_ATTRIBUTE_DATA = type { i32, %Win32_FILETIME, %Win32_FILETIME, %Win32_FILETIME, i32, i32 }
%Win32_FILETIME = type { i32, i32 }
%Win32_LARGE_INTEGER = type { i64 }
%List = type { i64, i64, %any, ptr }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }
%"any[]" = type { ptr, i64 }
%Win32_WIN32_FIND_DATAW = type { i32, %Win32_FILETIME, %Win32_FILETIME, %Win32_FILETIME, i32, i32, i32, i32, [260 x i16], [14 x i16], i32, i32, i16 }

$std.io.os.native_file_or_dir_exists = comdat any

$std.io.os.native_is_file = comdat any

$std.io.os.native_is_dir = comdat any

$std.io.os.native_file_size = comdat any

$std.io.os.native_fopen = comdat any

$std.io.os.native_remove = comdat any

$std.io.os.native_freopen = comdat any

$std.io.os.native_fseek = comdat any

$std.io.os.native_ftell = comdat any

$std.io.os.native_fwrite = comdat any

$std.io.os.native_fputc = comdat any

$std.io.os.native_fread = comdat any

$std.io.os.native_ls = comdat any

$std.io.os.native_rmtree = comdat any

$std.io.os.native_temp_directory = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any


!0 = !{i32 1, !"CodeView", i32 1}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 2}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 2}
!5 = !{i32 1, !"MaxTLSAlign", i32 65536}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "chdir.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!8 = !{!9, !16}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !10, file: !10, line: 7, baseType: !11, size: 32, align: 32, elements: !12)
!10 = !DIFile(filename: "file_libc.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "SET", value: 0)
!14 = !DIEnumerator(name: "CURSOR", value: 1)
!15 = !DIEnumerator(name: "END", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !18, file: !17, line: 26, baseType: !11, size: 32, align: 32, elements: !31)
!17 = !DIFile(filename: "ls.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !17, file: !17, line: 20, size: 192, align: 64, elements: !19, identifier: "std.io.path.PathImp")
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !18, file: !17, line: 22, baseType: !21, size: 128, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !23, identifier: "char[]")
!23 = !{!24, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !22, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !29)
!29 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !18, file: !17, line: 23, baseType: !16, size: 32, align: 32, offset: 128)
!31 = !{!32, !33}
!32 = !DIEnumerator(name: "WIN32", value: 0)
!33 = !DIEnumerator(name: "POSIX", value: 1)
!34 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !35, file: !35, line: 70, type: !36, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!35 = !DIFile(filename: "fileinfo.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !21}
!38 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!39 = !{}
!40 = !DILocalVariable(name: "path", arg: 1, scope: !34, file: !35, line: 70, type: !21)
!41 = !DILocation(line: 70, scope: !34)
!42 = !DILocalVariable(name: "current", scope: !43, file: !35, line: 540, type: !45, align: 8)
!43 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!44 = !DIFile(filename: "mem.c3", directory: "C:/Program Files/c3c/lib/std/core")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !35, file: !35, line: 10, size: 320, align: 64, elements: !47, identifier: "std.core.mem.allocator.TempAllocator")
!47 = !{!48, !55, !68, !69, !70}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !46, file: !35, line: 12, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !50, identifier: "Allocator")
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !46, file: !35, line: 13, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !35, file: !35, line: 22, size: 320, align: 64, elements: !58, identifier: "std.core.mem.allocator.TempAllocatorPage")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !57, file: !35, line: 24, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !57, file: !35, line: 25, baseType: !52, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !57, file: !35, line: 26, baseType: !28, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !35, line: 27, baseType: !28, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !57, file: !35, line: 28, baseType: !28, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !35, line: 29, baseType: !65, align: 8, offset: 320)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 0, lowerBound: 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !46, file: !35, line: 14, baseType: !28, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !46, file: !35, line: 15, baseType: !28, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !35, line: 16, baseType: !65, align: 8, offset: 320)
!71 = !DILocation(line: 540, scope: !43, inlinedAt: !72)
!72 = !DILocation(line: 81, scope: !34)
!73 = !DILocation(line: 396, scope: !74, inlinedAt: !71)
!74 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!75 = !DIFile(filename: "mem_allocator.c3", directory: "C:/Program Files/c3c/lib/std/core")
!76 = !DILocation(line: 398, scope: !77, inlinedAt: !71)
!77 = distinct !DILexicalBlock(scope: !74, file: !75, line: 397, column: 2)
!78 = !DILocation(line: 400, scope: !74, inlinedAt: !71)
!79 = !DILocalVariable(name: "mark", scope: !43, file: !35, line: 546, type: !28, align: 8)
!80 = !DILocation(line: 546, scope: !43, inlinedAt: !72)
!81 = !DILocation(line: 83, scope: !82)
!82 = distinct !DILexicalBlock(scope: !34, file: !35, line: 82, column: 4)
!83 = !DILocation(line: 549, scope: !84, inlinedAt: !72)
!84 = distinct !DILexicalBlock(scope: !43, file: !44, line: 548, column: 2)
!85 = !DILocation(line: 553, scope: !84, inlinedAt: !72)
!86 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !35, file: !35, line: 95, type: !36, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!87 = !DILocalVariable(name: "path", arg: 1, scope: !86, file: !35, line: 95, type: !21)
!88 = !DILocation(line: 95, scope: !86)
!89 = !DILocalVariable(name: "f", scope: !86, file: !35, line: 106, type: !90, align: 8)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !35, file: !35, line: 4, size: 64, align: 64, elements: !91, identifier: "std.io.File")
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !90, file: !35, line: 6, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !35, file: !35, line: 354, baseType: !52, align: 8)
!94 = !DILocation(line: 106, scope: !86)
!95 = !DILocation(line: 365, scope: !96, inlinedAt: !98)
!96 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !97, file: !97, line: 363, scopeLine: 363, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!97 = !DIFile(filename: "builtin.c3", directory: "C:/Program Files/c3c/lib/std/core")
!98 = !DILocation(line: 108, scope: !86)
!99 = !DILocation(line: 366, scope: !96, inlinedAt: !98)
!100 = !DILocation(line: 107, scope: !101)
!101 = distinct !DILexicalBlock(scope: !86, file: !35, line: 107, column: 10)
!102 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !35, file: !35, line: 112, type: !36, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!103 = !DILocalVariable(name: "path", arg: 1, scope: !102, file: !35, line: 112, type: !21)
!104 = !DILocation(line: 112, scope: !102)
!105 = !DILocation(line: 118, scope: !102)
!106 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !35, file: !35, line: 43, type: !107, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !111, !21}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !110)
!110 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DILocalVariable(name: "path", arg: 1, scope: !106, file: !35, line: 43, type: !21)
!113 = !DILocation(line: 43, scope: !106)
!114 = !DILocalVariable(name: "current", scope: !115, file: !35, line: 540, type: !45, align: 8)
!115 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!116 = !DILocation(line: 540, scope: !115, inlinedAt: !117)
!117 = !DILocation(line: 45, scope: !106)
!118 = !DILocation(line: 396, scope: !119, inlinedAt: !116)
!119 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!120 = !DILocation(line: 398, scope: !121, inlinedAt: !116)
!121 = distinct !DILexicalBlock(scope: !119, file: !75, line: 397, column: 2)
!122 = !DILocation(line: 400, scope: !119, inlinedAt: !116)
!123 = !DILocalVariable(name: "mark", scope: !115, file: !35, line: 546, type: !28, align: 8)
!124 = !DILocation(line: 546, scope: !115, inlinedAt: !117)
!125 = !DILocalVariable(name: "data", scope: !126, file: !35, line: 47, type: !127, align: 4)
!126 = distinct !DILexicalBlock(scope: !106, file: !35, line: 46, column: 2)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_FILE_ATTRIBUTE_DATA", scope: !35, file: !35, line: 9, size: 288, align: 32, elements: !128, identifier: "std.os.win32.Win32_FILE_ATTRIBUTE_DATA")
!128 = !{!129, !132, !137, !138, !139, !140}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileAttributes", scope: !127, file: !35, line: 11, baseType: !130, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_DWORD", scope: !35, file: !35, line: 9, baseType: !131, align: 4)
!131 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ftCreationTime", scope: !127, file: !35, line: 12, baseType: !133, size: 64, align: 32, offset: 32)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_FILETIME", scope: !127, file: !35, line: 253, size: 64, align: 32, elements: !134, identifier: "std.os.win32.Win32_FILETIME")
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dwLowDateTime", scope: !133, file: !35, line: 255, baseType: !130, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dwHighDateTime", scope: !133, file: !35, line: 256, baseType: !130, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastAccessTime", scope: !127, file: !35, line: 13, baseType: !133, size: 64, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastWriteTime", scope: !127, file: !35, line: 14, baseType: !133, size: 64, align: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeHigh", scope: !127, file: !35, line: 15, baseType: !130, size: 32, align: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeLow", scope: !127, file: !35, line: 16, baseType: !130, size: 32, align: 32, offset: 256)
!141 = !DILocation(line: 47, scope: !126)
!142 = !DILocation(line: 48, scope: !126)
!143 = !DILocation(line: 549, scope: !144, inlinedAt: !117)
!144 = distinct !DILexicalBlock(scope: !115, file: !44, line: 548, column: 2)
!145 = !DILocation(line: 553, scope: !144, inlinedAt: !117)
!146 = !DILocalVariable(name: "size", scope: !126, file: !35, line: 49, type: !147, align: 8)
!147 = !DICompositeType(tag: DW_TAG_union_type, name: "Win32_LARGE_INTEGER", scope: !35, file: !35, line: 181, size: 64, align: 64, elements: !148, identifier: "std.os.win32.Win32_LARGE_INTEGER")
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !35, line: 183, baseType: !150, size: 64, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !147, file: !35, line: 183, size: 64, align: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lowPart", scope: !150, file: !35, line: 185, baseType: !130, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "highPart", scope: !150, file: !35, line: 186, baseType: !154, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_LONG", scope: !35, file: !35, line: 61, baseType: !11, align: 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "quadPart", scope: !147, file: !35, line: 188, baseType: !29, size: 64, align: 64)
!156 = !DILocation(line: 49, scope: !126)
!157 = !DILocation(line: 50, scope: !126)
!158 = !DILocation(line: 51, scope: !126)
!159 = !DILocation(line: 52, scope: !126)
!160 = !DILocation(line: 549, scope: !161, inlinedAt: !117)
!161 = distinct !DILexicalBlock(scope: !115, file: !44, line: 548, column: 2)
!162 = !DILocation(line: 553, scope: !161, inlinedAt: !117)
!163 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !10, file: !10, line: 8, type: !164, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!164 = !DISubroutineType(types: !165)
!165 = !{!109, !166, !21, !21}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DILocalVariable(name: "filename", arg: 1, scope: !163, file: !10, line: 8, type: !21)
!168 = !DILocation(line: 8, scope: !163)
!169 = !DILocalVariable(name: "mode", arg: 2, scope: !163, file: !10, line: 8, type: !21)
!170 = !DILocation(line: 5, scope: !171)
!171 = distinct !DILexicalBlock(scope: !163, file: !10, line: 9, column: 1)
!172 = !DILocation(line: 6, scope: !171)
!173 = !DILocalVariable(name: "current", scope: !174, file: !10, line: 540, type: !45, align: 8)
!174 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!175 = !DILocation(line: 540, scope: !174, inlinedAt: !176)
!176 = !DILocation(line: 10, scope: !163)
!177 = !DILocation(line: 396, scope: !178, inlinedAt: !175)
!178 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!179 = !DILocation(line: 398, scope: !180, inlinedAt: !175)
!180 = distinct !DILexicalBlock(scope: !178, file: !75, line: 397, column: 2)
!181 = !DILocation(line: 400, scope: !178, inlinedAt: !175)
!182 = !DILocalVariable(name: "mark", scope: !174, file: !10, line: 546, type: !28, align: 8)
!183 = !DILocation(line: 546, scope: !174, inlinedAt: !176)
!184 = !DILocalVariable(name: "file", scope: !185, file: !10, line: 13, type: !52, align: 8)
!185 = distinct !DILexicalBlock(scope: !163, file: !10, line: 11, column: 2)
!186 = !DILocation(line: 13, scope: !185)
!187 = !DILocation(line: 549, scope: !188, inlinedAt: !176)
!188 = distinct !DILexicalBlock(scope: !174, file: !44, line: 548, column: 2)
!189 = !DILocation(line: 553, scope: !188, inlinedAt: !176)
!190 = !DILocation(line: 17, scope: !185)
!191 = !DILocation(line: 90, scope: !192, inlinedAt: !190)
!192 = distinct !DILexicalBlock(scope: !193, file: !10, line: 90, column: 2)
!193 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !10, file: !10, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!194 = !DILocation(line: 92, scope: !195, inlinedAt: !190)
!195 = distinct !DILexicalBlock(scope: !192, file: !10, line: 92, column: 23)
!196 = !DILocation(line: 93, scope: !197, inlinedAt: !190)
!197 = distinct !DILexicalBlock(scope: !192, file: !10, line: 93, column: 23)
!198 = !DILocation(line: 94, scope: !199, inlinedAt: !190)
!199 = distinct !DILexicalBlock(scope: !192, file: !10, line: 94, column: 22)
!200 = !DILocation(line: 95, scope: !201, inlinedAt: !190)
!201 = distinct !DILexicalBlock(scope: !192, file: !10, line: 95, column: 23)
!202 = !DILocation(line: 96, scope: !203, inlinedAt: !190)
!203 = distinct !DILexicalBlock(scope: !192, file: !10, line: 96, column: 22)
!204 = !DILocation(line: 97, scope: !205, inlinedAt: !190)
!205 = distinct !DILexicalBlock(scope: !192, file: !10, line: 97, column: 23)
!206 = !DILocation(line: 98, scope: !207, inlinedAt: !190)
!207 = distinct !DILexicalBlock(scope: !192, file: !10, line: 98, column: 23)
!208 = !DILocation(line: 99, scope: !209, inlinedAt: !190)
!209 = distinct !DILexicalBlock(scope: !192, file: !10, line: 99, column: 22)
!210 = !DILocation(line: 100, scope: !211, inlinedAt: !190)
!211 = distinct !DILexicalBlock(scope: !192, file: !10, line: 100, column: 23)
!212 = !DILocation(line: 101, scope: !213, inlinedAt: !190)
!213 = distinct !DILexicalBlock(scope: !192, file: !10, line: 101, column: 29)
!214 = !DILocation(line: 102, scope: !215, inlinedAt: !190)
!215 = distinct !DILexicalBlock(scope: !192, file: !10, line: 102, column: 23)
!216 = !DILocation(line: 103, scope: !217, inlinedAt: !190)
!217 = distinct !DILexicalBlock(scope: !192, file: !10, line: 103, column: 24)
!218 = !DILocation(line: 104, scope: !219, inlinedAt: !190)
!219 = distinct !DILexicalBlock(scope: !192, file: !10, line: 104, column: 23)
!220 = !DILocation(line: 105, scope: !221, inlinedAt: !190)
!221 = distinct !DILexicalBlock(scope: !192, file: !10, line: 105, column: 23)
!222 = !DILocation(line: 106, scope: !223, inlinedAt: !190)
!223 = distinct !DILexicalBlock(scope: !192, file: !10, line: 106, column: 22)
!224 = !DILocation(line: 107, scope: !225, inlinedAt: !190)
!225 = distinct !DILexicalBlock(scope: !192, file: !10, line: 107, column: 26)
!226 = !DILocation(line: 108, scope: !227, inlinedAt: !190)
!227 = distinct !DILexicalBlock(scope: !192, file: !10, line: 108, column: 22)
!228 = !DILocation(line: 109, scope: !229, inlinedAt: !190)
!229 = distinct !DILexicalBlock(scope: !192, file: !10, line: 109, column: 27)
!230 = !DILocation(line: 110, scope: !231, inlinedAt: !190)
!231 = distinct !DILexicalBlock(scope: !192, file: !10, line: 110, column: 20)
!232 = !DILocation(line: 111, scope: !233, inlinedAt: !190)
!233 = distinct !DILexicalBlock(scope: !192, file: !10, line: 111, column: 28)
!234 = !DILocation(line: 112, scope: !235, inlinedAt: !190)
!235 = distinct !DILexicalBlock(scope: !192, file: !10, line: 112, column: 12)
!236 = !DILocation(line: 549, scope: !237, inlinedAt: !176)
!237 = distinct !DILexicalBlock(scope: !174, file: !44, line: 548, column: 2)
!238 = !DILocation(line: 553, scope: !237, inlinedAt: !176)
!239 = !DILocation(line: 549, scope: !240, inlinedAt: !176)
!240 = distinct !DILexicalBlock(scope: !174, file: !44, line: 548, column: 2)
!241 = !DILocation(line: 553, scope: !240, inlinedAt: !176)
!242 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !10, file: !10, line: 21, type: !243, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!243 = !DISubroutineType(types: !244)
!244 = !{!109, !52, !21}
!245 = !DILocalVariable(name: "filename", arg: 1, scope: !242, file: !10, line: 21, type: !21)
!246 = !DILocation(line: 21, scope: !242)
!247 = !DILocalVariable(name: "current", scope: !248, file: !10, line: 540, type: !45, align: 8)
!248 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!249 = !DILocation(line: 540, scope: !248, inlinedAt: !250)
!250 = !DILocation(line: 23, scope: !242)
!251 = !DILocation(line: 396, scope: !252, inlinedAt: !249)
!252 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!253 = !DILocation(line: 398, scope: !254, inlinedAt: !249)
!254 = distinct !DILexicalBlock(scope: !252, file: !75, line: 397, column: 2)
!255 = !DILocation(line: 400, scope: !252, inlinedAt: !249)
!256 = !DILocalVariable(name: "mark", scope: !248, file: !10, line: 546, type: !28, align: 8)
!257 = !DILocation(line: 546, scope: !248, inlinedAt: !250)
!258 = !DILocalVariable(name: "result", scope: !259, file: !10, line: 26, type: !260, align: 4)
!259 = distinct !DILexicalBlock(scope: !242, file: !10, line: 24, column: 2)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !10, file: !10, line: 21, baseType: !11, align: 4)
!261 = !DILocation(line: 26, scope: !259)
!262 = !DILocation(line: 549, scope: !263, inlinedAt: !250)
!263 = distinct !DILexicalBlock(scope: !248, file: !44, line: 548, column: 2)
!264 = !DILocation(line: 553, scope: !263, inlinedAt: !250)
!265 = !DILocation(line: 30, scope: !259)
!266 = !DILocation(line: 32, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !10, line: 32, column: 4)
!268 = distinct !DILexicalBlock(scope: !259, file: !10, line: 31, column: 3)
!269 = !DILocation(line: 549, scope: !270, inlinedAt: !250)
!270 = distinct !DILexicalBlock(scope: !248, file: !44, line: 548, column: 2)
!271 = !DILocation(line: 553, scope: !270, inlinedAt: !250)
!272 = !DILocation(line: 549, scope: !273, inlinedAt: !250)
!273 = distinct !DILexicalBlock(scope: !248, file: !44, line: 548, column: 2)
!274 = !DILocation(line: 553, scope: !273, inlinedAt: !250)
!275 = !DILocation(line: 549, scope: !276, inlinedAt: !250)
!276 = distinct !DILexicalBlock(scope: !248, file: !44, line: 548, column: 2)
!277 = !DILocation(line: 553, scope: !276, inlinedAt: !250)
!278 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !10, file: !10, line: 48, type: !279, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!279 = !DISubroutineType(types: !280)
!280 = !{!109, !166, !52, !21, !21}
!281 = !DILocalVariable(name: "file", arg: 1, scope: !278, file: !10, line: 48, type: !52)
!282 = !DILocation(line: 48, scope: !278)
!283 = !DILocalVariable(name: "filename", arg: 2, scope: !278, file: !10, line: 48, type: !21)
!284 = !DILocalVariable(name: "mode", arg: 3, scope: !278, file: !10, line: 48, type: !21)
!285 = !DILocation(line: 45, scope: !286)
!286 = distinct !DILexicalBlock(scope: !278, file: !10, line: 49, column: 1)
!287 = !DILocation(line: 46, scope: !286)
!288 = !DILocalVariable(name: "current", scope: !289, file: !10, line: 540, type: !45, align: 8)
!289 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!290 = !DILocation(line: 540, scope: !289, inlinedAt: !291)
!291 = !DILocation(line: 50, scope: !278)
!292 = !DILocation(line: 396, scope: !293, inlinedAt: !290)
!293 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!294 = !DILocation(line: 398, scope: !295, inlinedAt: !290)
!295 = distinct !DILexicalBlock(scope: !293, file: !75, line: 397, column: 2)
!296 = !DILocation(line: 400, scope: !293, inlinedAt: !290)
!297 = !DILocalVariable(name: "mark", scope: !289, file: !10, line: 546, type: !28, align: 8)
!298 = !DILocation(line: 546, scope: !289, inlinedAt: !291)
!299 = !DILocation(line: 53, scope: !300)
!300 = distinct !DILexicalBlock(scope: !278, file: !10, line: 51, column: 2)
!301 = !DILocation(line: 549, scope: !302, inlinedAt: !291)
!302 = distinct !DILexicalBlock(scope: !289, file: !44, line: 548, column: 2)
!303 = !DILocation(line: 553, scope: !302, inlinedAt: !291)
!304 = !DILocation(line: 57, scope: !300)
!305 = !DILocation(line: 90, scope: !306, inlinedAt: !304)
!306 = distinct !DILexicalBlock(scope: !307, file: !10, line: 90, column: 2)
!307 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !10, file: !10, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!308 = !DILocation(line: 92, scope: !309, inlinedAt: !304)
!309 = distinct !DILexicalBlock(scope: !306, file: !10, line: 92, column: 23)
!310 = !DILocation(line: 93, scope: !311, inlinedAt: !304)
!311 = distinct !DILexicalBlock(scope: !306, file: !10, line: 93, column: 23)
!312 = !DILocation(line: 94, scope: !313, inlinedAt: !304)
!313 = distinct !DILexicalBlock(scope: !306, file: !10, line: 94, column: 22)
!314 = !DILocation(line: 95, scope: !315, inlinedAt: !304)
!315 = distinct !DILexicalBlock(scope: !306, file: !10, line: 95, column: 23)
!316 = !DILocation(line: 96, scope: !317, inlinedAt: !304)
!317 = distinct !DILexicalBlock(scope: !306, file: !10, line: 96, column: 22)
!318 = !DILocation(line: 97, scope: !319, inlinedAt: !304)
!319 = distinct !DILexicalBlock(scope: !306, file: !10, line: 97, column: 23)
!320 = !DILocation(line: 98, scope: !321, inlinedAt: !304)
!321 = distinct !DILexicalBlock(scope: !306, file: !10, line: 98, column: 23)
!322 = !DILocation(line: 99, scope: !323, inlinedAt: !304)
!323 = distinct !DILexicalBlock(scope: !306, file: !10, line: 99, column: 22)
!324 = !DILocation(line: 100, scope: !325, inlinedAt: !304)
!325 = distinct !DILexicalBlock(scope: !306, file: !10, line: 100, column: 23)
!326 = !DILocation(line: 101, scope: !327, inlinedAt: !304)
!327 = distinct !DILexicalBlock(scope: !306, file: !10, line: 101, column: 29)
!328 = !DILocation(line: 102, scope: !329, inlinedAt: !304)
!329 = distinct !DILexicalBlock(scope: !306, file: !10, line: 102, column: 23)
!330 = !DILocation(line: 103, scope: !331, inlinedAt: !304)
!331 = distinct !DILexicalBlock(scope: !306, file: !10, line: 103, column: 24)
!332 = !DILocation(line: 104, scope: !333, inlinedAt: !304)
!333 = distinct !DILexicalBlock(scope: !306, file: !10, line: 104, column: 23)
!334 = !DILocation(line: 105, scope: !335, inlinedAt: !304)
!335 = distinct !DILexicalBlock(scope: !306, file: !10, line: 105, column: 23)
!336 = !DILocation(line: 106, scope: !337, inlinedAt: !304)
!337 = distinct !DILexicalBlock(scope: !306, file: !10, line: 106, column: 22)
!338 = !DILocation(line: 107, scope: !339, inlinedAt: !304)
!339 = distinct !DILexicalBlock(scope: !306, file: !10, line: 107, column: 26)
!340 = !DILocation(line: 108, scope: !341, inlinedAt: !304)
!341 = distinct !DILexicalBlock(scope: !306, file: !10, line: 108, column: 22)
!342 = !DILocation(line: 109, scope: !343, inlinedAt: !304)
!343 = distinct !DILexicalBlock(scope: !306, file: !10, line: 109, column: 27)
!344 = !DILocation(line: 110, scope: !345, inlinedAt: !304)
!345 = distinct !DILexicalBlock(scope: !306, file: !10, line: 110, column: 20)
!346 = !DILocation(line: 111, scope: !347, inlinedAt: !304)
!347 = distinct !DILexicalBlock(scope: !306, file: !10, line: 111, column: 28)
!348 = !DILocation(line: 112, scope: !349, inlinedAt: !304)
!349 = distinct !DILexicalBlock(scope: !306, file: !10, line: 112, column: 12)
!350 = !DILocation(line: 549, scope: !351, inlinedAt: !291)
!351 = distinct !DILexicalBlock(scope: !289, file: !44, line: 548, column: 2)
!352 = !DILocation(line: 553, scope: !351, inlinedAt: !291)
!353 = !DILocation(line: 549, scope: !354, inlinedAt: !291)
!354 = distinct !DILexicalBlock(scope: !289, file: !44, line: 548, column: 2)
!355 = !DILocation(line: 553, scope: !354, inlinedAt: !291)
!356 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !10, file: !10, line: 61, type: !357, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!357 = !DISubroutineType(types: !358)
!358 = !{!109, !52, !52, !110, !9}
!359 = !DILocalVariable(name: "file", arg: 1, scope: !356, file: !10, line: 61, type: !52)
!360 = !DILocation(line: 61, scope: !356)
!361 = !DILocalVariable(name: "offset", arg: 2, scope: !356, file: !10, line: 61, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !110)
!363 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !356, file: !10, line: 61, type: !9)
!364 = !DILocation(line: 63, scope: !356)
!365 = !DILocation(line: 118, scope: !366, inlinedAt: !364)
!366 = distinct !DILexicalBlock(scope: !367, file: !10, line: 118, column: 2)
!367 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !10, file: !10, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!368 = !DILocation(line: 120, scope: !369, inlinedAt: !364)
!369 = distinct !DILexicalBlock(scope: !366, file: !10, line: 120, column: 23)
!370 = !DILocation(line: 121, scope: !371, inlinedAt: !364)
!371 = distinct !DILexicalBlock(scope: !366, file: !10, line: 121, column: 22)
!372 = !DILocation(line: 122, scope: !373, inlinedAt: !364)
!373 = distinct !DILexicalBlock(scope: !366, file: !10, line: 122, column: 26)
!374 = !DILocation(line: 123, scope: !375, inlinedAt: !364)
!375 = distinct !DILexicalBlock(scope: !366, file: !10, line: 123, column: 22)
!376 = !DILocation(line: 124, scope: !377, inlinedAt: !364)
!377 = distinct !DILexicalBlock(scope: !366, file: !10, line: 124, column: 23)
!378 = !DILocation(line: 125, scope: !379, inlinedAt: !364)
!379 = distinct !DILexicalBlock(scope: !366, file: !10, line: 125, column: 20)
!380 = !DILocation(line: 126, scope: !381, inlinedAt: !364)
!381 = distinct !DILexicalBlock(scope: !366, file: !10, line: 126, column: 23)
!382 = !DILocation(line: 127, scope: !383, inlinedAt: !364)
!383 = distinct !DILexicalBlock(scope: !366, file: !10, line: 127, column: 22)
!384 = !DILocation(line: 128, scope: !385, inlinedAt: !364)
!385 = distinct !DILexicalBlock(scope: !366, file: !10, line: 128, column: 22)
!386 = !DILocation(line: 129, scope: !387, inlinedAt: !364)
!387 = distinct !DILexicalBlock(scope: !366, file: !10, line: 129, column: 22)
!388 = !DILocation(line: 130, scope: !389, inlinedAt: !364)
!389 = distinct !DILexicalBlock(scope: !366, file: !10, line: 130, column: 23)
!390 = !DILocation(line: 131, scope: !391, inlinedAt: !364)
!391 = distinct !DILexicalBlock(scope: !366, file: !10, line: 131, column: 12)
!392 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !10, file: !10, line: 67, type: !393, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!393 = !DISubroutineType(types: !394)
!394 = !{!109, !111, !52}
!395 = !DILocalVariable(name: "file", arg: 1, scope: !392, file: !10, line: 67, type: !93)
!396 = !DILocation(line: 67, scope: !392)
!397 = !DILocalVariable(name: "index", scope: !392, file: !10, line: 69, type: !110, align: 8)
!398 = !DILocation(line: 69, scope: !392)
!399 = !DILocation(line: 70, scope: !392)
!400 = !DILocation(line: 118, scope: !401, inlinedAt: !399)
!401 = distinct !DILexicalBlock(scope: !402, file: !10, line: 118, column: 2)
!402 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !10, file: !10, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!403 = !DILocation(line: 120, scope: !404, inlinedAt: !399)
!404 = distinct !DILexicalBlock(scope: !401, file: !10, line: 120, column: 23)
!405 = !DILocation(line: 121, scope: !406, inlinedAt: !399)
!406 = distinct !DILexicalBlock(scope: !401, file: !10, line: 121, column: 22)
!407 = !DILocation(line: 122, scope: !408, inlinedAt: !399)
!408 = distinct !DILexicalBlock(scope: !401, file: !10, line: 122, column: 26)
!409 = !DILocation(line: 123, scope: !410, inlinedAt: !399)
!410 = distinct !DILexicalBlock(scope: !401, file: !10, line: 123, column: 22)
!411 = !DILocation(line: 124, scope: !412, inlinedAt: !399)
!412 = distinct !DILexicalBlock(scope: !401, file: !10, line: 124, column: 23)
!413 = !DILocation(line: 125, scope: !414, inlinedAt: !399)
!414 = distinct !DILexicalBlock(scope: !401, file: !10, line: 125, column: 20)
!415 = !DILocation(line: 126, scope: !416, inlinedAt: !399)
!416 = distinct !DILexicalBlock(scope: !401, file: !10, line: 126, column: 23)
!417 = !DILocation(line: 127, scope: !418, inlinedAt: !399)
!418 = distinct !DILexicalBlock(scope: !401, file: !10, line: 127, column: 22)
!419 = !DILocation(line: 128, scope: !420, inlinedAt: !399)
!420 = distinct !DILexicalBlock(scope: !401, file: !10, line: 128, column: 22)
!421 = !DILocation(line: 129, scope: !422, inlinedAt: !399)
!422 = distinct !DILexicalBlock(scope: !401, file: !10, line: 129, column: 22)
!423 = !DILocation(line: 130, scope: !424, inlinedAt: !399)
!424 = distinct !DILexicalBlock(scope: !401, file: !10, line: 130, column: 23)
!425 = !DILocation(line: 131, scope: !426, inlinedAt: !399)
!426 = distinct !DILexicalBlock(scope: !401, file: !10, line: 131, column: 12)
!427 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !10, file: !10, line: 73, type: !428, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!428 = !DISubroutineType(types: !429)
!429 = !{!109, !111, !52, !22}
!430 = !DILocalVariable(name: "file", arg: 1, scope: !427, file: !10, line: 73, type: !93)
!431 = !DILocation(line: 73, scope: !427)
!432 = !DILocalVariable(name: "buffer", arg: 2, scope: !427, file: !10, line: 73, type: !22)
!433 = !DILocation(line: 75, scope: !427)
!434 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !10, file: !10, line: 78, type: !435, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!435 = !DISubroutineType(types: !436)
!436 = !{!109, !52, !11, !52}
!437 = !DILocalVariable(name: "c", arg: 1, scope: !434, file: !10, line: 78, type: !260)
!438 = !DILocation(line: 78, scope: !434)
!439 = !DILocalVariable(name: "stream", arg: 2, scope: !434, file: !10, line: 78, type: !93)
!440 = !DILocation(line: 80, scope: !434)
!441 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !10, file: !10, line: 83, type: !428, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!442 = !DILocalVariable(name: "file", arg: 1, scope: !441, file: !10, line: 83, type: !93)
!443 = !DILocation(line: 83, scope: !441)
!444 = !DILocalVariable(name: "buffer", arg: 2, scope: !441, file: !10, line: 83, type: !22)
!445 = !DILocation(line: 85, scope: !441)
!446 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !17, file: !17, line: 27, type: !447, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!447 = !DISubroutineType(types: !448)
!448 = !{!109, !449, !18, !38, !38, !21, !49}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !450, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !17, file: !17, line: 10, baseType: !451, align: 8)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !17, file: !17, line: 14, size: 320, align: 64, elements: !452, identifier: "std_collections_list$std.io.path.PathImp$.List")
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !17, line: 16, baseType: !28, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !451, file: !17, line: 17, baseType: !28, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !451, file: !17, line: 18, baseType: !49, size: 128, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !451, file: !17, line: 19, baseType: !457, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !17, file: !17, line: 10, baseType: !18, align: 8)
!459 = !DILocalVariable(name: "dir", arg: 1, scope: !446, file: !17, line: 27, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !461, file: !461, line: 18, baseType: !18, align: 8)
!461 = !DIFile(filename: "temp_directory.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!462 = !DILocation(line: 27, scope: !446)
!463 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !446, file: !17, line: 27, type: !38)
!464 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !446, file: !17, line: 27, type: !38)
!465 = !DILocalVariable(name: "mask", arg: 4, scope: !446, file: !17, line: 27, type: !21)
!466 = !DILocalVariable(name: "allocator", arg: 5, scope: !446, file: !17, line: 27, type: !49)
!467 = !DILocalVariable(name: "list", scope: !446, file: !17, line: 29, type: !450, align: 8)
!468 = !DILocation(line: 29, scope: !446)
!469 = !DILocation(line: 30, scope: !446)
!470 = !DILocalVariable(name: "current", scope: !471, file: !17, line: 540, type: !45, align: 8)
!471 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!472 = !DILocation(line: 540, scope: !471, inlinedAt: !473)
!473 = !DILocation(line: 32, scope: !446)
!474 = !DILocation(line: 396, scope: !475, inlinedAt: !472)
!475 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!476 = !DILocation(line: 398, scope: !477, inlinedAt: !472)
!477 = distinct !DILexicalBlock(scope: !475, file: !75, line: 397, column: 2)
!478 = !DILocation(line: 400, scope: !475, inlinedAt: !472)
!479 = !DILocalVariable(name: "original", scope: !471, file: !17, line: 543, type: !45, align: 8)
!480 = !DILocation(line: 543, scope: !471, inlinedAt: !473)
!481 = !DILocation(line: 544, scope: !471, inlinedAt: !473)
!482 = !DILocalVariable(name: "mark", scope: !471, file: !17, line: 546, type: !28, align: 8)
!483 = !DILocation(line: 546, scope: !471, inlinedAt: !473)
!484 = !DILocalVariable(name: "result", scope: !485, file: !17, line: 34, type: !486, align: 8)
!485 = distinct !DILexicalBlock(scope: !446, file: !17, line: 33, column: 2)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "WString", scope: !17, file: !17, line: 7, baseType: !487, align: 8)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ushort*", baseType: !488, size: 64, align: 64, dwarfAddressSpace: 0)
!488 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!489 = !DILocation(line: 34, scope: !485)
!490 = !DILocalVariable(name: "find_data", scope: !485, file: !17, line: 35, type: !491, align: 4)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Win32_WIN32_FIND_DATAW", scope: !17, file: !17, line: 21, size: 4832, align: 32, elements: !492, identifier: "std.os.win32.Win32_WIN32_FIND_DATAW")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !505, !509, !510, !511}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileAttributes", scope: !491, file: !17, line: 23, baseType: !130, size: 32, align: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ftCreationTime", scope: !491, file: !17, line: 24, baseType: !133, size: 64, align: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastAccessTime", scope: !491, file: !17, line: 25, baseType: !133, size: 64, align: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ftLastWriteTime", scope: !491, file: !17, line: 26, baseType: !133, size: 64, align: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeHigh", scope: !491, file: !17, line: 27, baseType: !130, size: 32, align: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nFileSizeLow", scope: !491, file: !17, line: 28, baseType: !130, size: 32, align: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dwReserved0", scope: !491, file: !17, line: 29, baseType: !130, size: 32, align: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dwReserved1", scope: !491, file: !17, line: 30, baseType: !130, size: 32, align: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cFileName", scope: !491, file: !17, line: 31, baseType: !502, size: 4160, align: 16, offset: 352)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 4160, align: 16, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 260, lowerBound: 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cAlternateFileName", scope: !491, file: !17, line: 32, baseType: !506, size: 224, align: 16, offset: 4512)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 224, align: 16, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 14, lowerBound: 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dwFileType", scope: !491, file: !17, line: 33, baseType: !130, size: 32, align: 32, offset: 4736)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dwCreatorType", scope: !491, file: !17, line: 34, baseType: !130, size: 32, align: 32, offset: 4768)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "wFinderFlags", scope: !491, file: !17, line: 35, baseType: !512, size: 16, align: 16, offset: 4800)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_WORD", scope: !17, file: !17, line: 169, baseType: !488, align: 2)
!513 = !DILocation(line: 35, scope: !485)
!514 = !DILocalVariable(name: "find", scope: !485, file: !17, line: 36, type: !515, align: 8)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "Win32_HANDLE", scope: !17, file: !17, line: 17, baseType: !52, align: 8)
!516 = !DILocation(line: 36, scope: !485)
!517 = !DILocation(line: 37, scope: !485)
!518 = !DILocation(line: 549, scope: !519, inlinedAt: !473)
!519 = distinct !DILexicalBlock(scope: !471, file: !44, line: 548, column: 2)
!520 = !DILocation(line: 551, scope: !519, inlinedAt: !473)
!521 = !DILocation(line: 553, scope: !519, inlinedAt: !473)
!522 = !DILocation(line: 39, scope: !485)
!523 = !DILocation(line: 48, scope: !524)
!524 = distinct !DILexicalBlock(scope: !485, file: !17, line: 39, column: 3)
!525 = !DILocation(line: 41, scope: !526)
!526 = distinct !DILexicalBlock(scope: !524, file: !17, line: 40, column: 3)
!527 = !DILocalVariable(name: "current", scope: !528, file: !17, line: 540, type: !45, align: 8)
!528 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!529 = !DILocation(line: 540, scope: !528, inlinedAt: !530)
!530 = !DILocation(line: 42, scope: !526)
!531 = !DILocation(line: 396, scope: !532, inlinedAt: !529)
!532 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!533 = !DILocation(line: 398, scope: !534, inlinedAt: !529)
!534 = distinct !DILexicalBlock(scope: !532, file: !75, line: 397, column: 2)
!535 = !DILocation(line: 400, scope: !532, inlinedAt: !529)
!536 = !DILocalVariable(name: "original", scope: !528, file: !17, line: 543, type: !45, align: 8)
!537 = !DILocation(line: 543, scope: !528, inlinedAt: !530)
!538 = !DILocation(line: 544, scope: !528, inlinedAt: !530)
!539 = !DILocalVariable(name: "mark", scope: !528, file: !17, line: 546, type: !28, align: 8)
!540 = !DILocation(line: 546, scope: !528, inlinedAt: !530)
!541 = !DILocalVariable(name: "filename", scope: !542, file: !17, line: 44, type: !21, align: 8)
!542 = distinct !DILexicalBlock(scope: !526, file: !17, line: 43, column: 4)
!543 = !DILocation(line: 44, scope: !542)
!544 = !DILocation(line: 549, scope: !545, inlinedAt: !530)
!545 = distinct !DILexicalBlock(scope: !528, file: !44, line: 548, column: 2)
!546 = !DILocation(line: 551, scope: !545, inlinedAt: !530)
!547 = !DILocation(line: 38, scope: !548)
!548 = distinct !DILexicalBlock(scope: !485, file: !17, line: 38, column: 16)
!549 = !DILocation(line: 549, scope: !550, inlinedAt: !473)
!550 = distinct !DILexicalBlock(scope: !471, file: !44, line: 548, column: 2)
!551 = !DILocation(line: 551, scope: !550, inlinedAt: !473)
!552 = !DILocation(line: 553, scope: !550, inlinedAt: !473)
!553 = !DILocation(line: 45, scope: !542)
!554 = !DILocation(line: 549, scope: !555, inlinedAt: !530)
!555 = distinct !DILexicalBlock(scope: !528, file: !44, line: 548, column: 2)
!556 = !DILocation(line: 551, scope: !555, inlinedAt: !530)
!557 = !DILocation(line: 553, scope: !555, inlinedAt: !530)
!558 = !DILocation(line: 46, scope: !542)
!559 = !DILocation(line: 549, scope: !560, inlinedAt: !530)
!560 = distinct !DILexicalBlock(scope: !528, file: !44, line: 548, column: 2)
!561 = !DILocation(line: 551, scope: !560, inlinedAt: !530)
!562 = !DILocation(line: 38, scope: !563)
!563 = distinct !DILexicalBlock(scope: !485, file: !17, line: 38, column: 16)
!564 = !DILocation(line: 549, scope: !565, inlinedAt: !473)
!565 = distinct !DILexicalBlock(scope: !471, file: !44, line: 548, column: 2)
!566 = !DILocation(line: 551, scope: !565, inlinedAt: !473)
!567 = !DILocation(line: 553, scope: !565, inlinedAt: !473)
!568 = !DILocation(line: 549, scope: !569, inlinedAt: !530)
!569 = distinct !DILexicalBlock(scope: !528, file: !44, line: 548, column: 2)
!570 = !DILocation(line: 551, scope: !569, inlinedAt: !530)
!571 = !DILocation(line: 553, scope: !569, inlinedAt: !530)
!572 = !DILocation(line: 38, scope: !573)
!573 = distinct !DILexicalBlock(scope: !485, file: !17, line: 38, column: 16)
!574 = !DILocation(line: 549, scope: !575, inlinedAt: !473)
!575 = distinct !DILexicalBlock(scope: !471, file: !44, line: 548, column: 2)
!576 = !DILocation(line: 551, scope: !575, inlinedAt: !473)
!577 = !DILocation(line: 553, scope: !575, inlinedAt: !473)
!578 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !579, file: !579, line: 38, type: !580, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!579 = !DIFile(filename: "rmtree.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!580 = !DISubroutineType(types: !581)
!581 = !{!109, !52, !18}
!582 = !DILocalVariable(name: "path", arg: 1, scope: !578, file: !579, line: 38, type: !460)
!583 = !DILocation(line: 38, scope: !578)
!584 = !DILocalVariable(name: "find_data", scope: !578, file: !579, line: 40, type: !491, align: 4)
!585 = !DILocation(line: 40, scope: !578)
!586 = !DILocalVariable(name: "s", scope: !578, file: !579, line: 41, type: !21, align: 8)
!587 = !DILocation(line: 41, scope: !578)
!588 = !DILocalVariable(name: "find", scope: !578, file: !579, line: 42, type: !515, align: 8)
!589 = !DILocation(line: 42, scope: !578)
!590 = !DILocation(line: 44, scope: !578)
!591 = !DILocation(line: 46, scope: !578)
!592 = !DILocation(line: 62, scope: !593)
!593 = distinct !DILexicalBlock(scope: !578, file: !579, line: 46, column: 2)
!594 = !DILocalVariable(name: "current", scope: !595, file: !579, line: 540, type: !45, align: 8)
!595 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!596 = !DILocation(line: 540, scope: !595, inlinedAt: !597)
!597 = !DILocation(line: 48, scope: !598)
!598 = distinct !DILexicalBlock(scope: !593, file: !579, line: 47, column: 2)
!599 = !DILocation(line: 396, scope: !600, inlinedAt: !596)
!600 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!601 = !DILocation(line: 398, scope: !602, inlinedAt: !596)
!602 = distinct !DILexicalBlock(scope: !600, file: !75, line: 397, column: 2)
!603 = !DILocation(line: 400, scope: !600, inlinedAt: !596)
!604 = !DILocalVariable(name: "mark", scope: !595, file: !579, line: 546, type: !28, align: 8)
!605 = !DILocation(line: 546, scope: !595, inlinedAt: !597)
!606 = !DILocalVariable(name: "filename", scope: !607, file: !579, line: 50, type: !21, align: 8)
!607 = distinct !DILexicalBlock(scope: !598, file: !579, line: 49, column: 3)
!608 = !DILocation(line: 50, scope: !607)
!609 = !DILocation(line: 396, scope: !610, inlinedAt: !608)
!610 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!611 = !DILocation(line: 398, scope: !612, inlinedAt: !608)
!612 = distinct !DILexicalBlock(scope: !610, file: !75, line: 397, column: 2)
!613 = !DILocation(line: 400, scope: !610, inlinedAt: !608)
!614 = !DILocation(line: 549, scope: !615, inlinedAt: !597)
!615 = distinct !DILexicalBlock(scope: !595, file: !44, line: 548, column: 2)
!616 = !DILocation(line: 45, scope: !617)
!617 = distinct !DILexicalBlock(scope: !578, file: !579, line: 45, column: 15)
!618 = !DILocation(line: 51, scope: !607)
!619 = !DILocation(line: 549, scope: !620, inlinedAt: !597)
!620 = distinct !DILexicalBlock(scope: !595, file: !44, line: 548, column: 2)
!621 = !DILocation(line: 553, scope: !620, inlinedAt: !597)
!622 = !DILocalVariable(name: "file_path", scope: !607, file: !579, line: 52, type: !460, align: 8)
!623 = !DILocation(line: 52, scope: !607)
!624 = !DILocation(line: 549, scope: !625, inlinedAt: !597)
!625 = distinct !DILexicalBlock(scope: !595, file: !44, line: 548, column: 2)
!626 = !DILocation(line: 45, scope: !627)
!627 = distinct !DILexicalBlock(scope: !578, file: !579, line: 45, column: 15)
!628 = !DILocation(line: 53, scope: !607)
!629 = !DILocation(line: 55, scope: !630)
!630 = distinct !DILexicalBlock(scope: !607, file: !579, line: 54, column: 4)
!631 = !DILocation(line: 549, scope: !632, inlinedAt: !597)
!632 = distinct !DILexicalBlock(scope: !595, file: !44, line: 548, column: 2)
!633 = !DILocation(line: 45, scope: !634)
!634 = distinct !DILexicalBlock(scope: !578, file: !579, line: 45, column: 15)
!635 = !DILocation(line: 59, scope: !636)
!636 = distinct !DILexicalBlock(scope: !607, file: !579, line: 58, column: 4)
!637 = !DILocation(line: 549, scope: !638, inlinedAt: !597)
!638 = distinct !DILexicalBlock(scope: !595, file: !44, line: 548, column: 2)
!639 = !DILocation(line: 553, scope: !638, inlinedAt: !597)
!640 = !DILocalVariable(name: "current", scope: !641, file: !579, line: 540, type: !45, align: 8)
!641 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!642 = !DILocation(line: 540, scope: !641, inlinedAt: !643)
!643 = !DILocation(line: 27, scope: !644, inlinedAt: !646)
!644 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !645, file: !645, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!645 = !DIFile(filename: "rmdir.c3", directory: "C:/Program Files/c3c/lib/std/io/os")
!646 = !DILocation(line: 63, scope: !578)
!647 = !DILocation(line: 396, scope: !648, inlinedAt: !642)
!648 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!649 = !DILocation(line: 398, scope: !650, inlinedAt: !642)
!650 = distinct !DILexicalBlock(scope: !648, file: !75, line: 397, column: 2)
!651 = !DILocation(line: 400, scope: !648, inlinedAt: !642)
!652 = !DILocalVariable(name: "mark", scope: !641, file: !579, line: 546, type: !28, align: 8)
!653 = !DILocation(line: 546, scope: !641, inlinedAt: !643)
!654 = !DILocation(line: 29, scope: !655, inlinedAt: !646)
!655 = distinct !DILexicalBlock(scope: !644, file: !645, line: 28, column: 4)
!656 = !DILocation(line: 549, scope: !657, inlinedAt: !643)
!657 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!658 = !DILocation(line: 553, scope: !657, inlinedAt: !643)
!659 = !DILocation(line: 30, scope: !660, inlinedAt: !646)
!660 = distinct !DILexicalBlock(scope: !655, file: !645, line: 30, column: 5)
!661 = !DILocation(line: 33, scope: !662, inlinedAt: !646)
!662 = distinct !DILexicalBlock(scope: !660, file: !645, line: 33, column: 7)
!663 = !DILocation(line: 549, scope: !664, inlinedAt: !643)
!664 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!665 = !DILocation(line: 553, scope: !664, inlinedAt: !643)
!666 = !DILocation(line: 35, scope: !667, inlinedAt: !646)
!667 = distinct !DILexicalBlock(scope: !660, file: !645, line: 35, column: 7)
!668 = !DILocation(line: 549, scope: !669, inlinedAt: !643)
!669 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!670 = !DILocation(line: 553, scope: !669, inlinedAt: !643)
!671 = !DILocation(line: 37, scope: !672, inlinedAt: !646)
!672 = distinct !DILexicalBlock(scope: !660, file: !645, line: 37, column: 7)
!673 = !DILocation(line: 549, scope: !674, inlinedAt: !643)
!674 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!675 = !DILocation(line: 553, scope: !674, inlinedAt: !643)
!676 = !DILocation(line: 40, scope: !677, inlinedAt: !646)
!677 = distinct !DILexicalBlock(scope: !660, file: !645, line: 40, column: 7)
!678 = !DILocation(line: 549, scope: !679, inlinedAt: !643)
!679 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!680 = !DILocation(line: 553, scope: !679, inlinedAt: !643)
!681 = !DILocation(line: 42, scope: !682, inlinedAt: !646)
!682 = distinct !DILexicalBlock(scope: !660, file: !645, line: 42, column: 7)
!683 = !DILocation(line: 549, scope: !684, inlinedAt: !643)
!684 = distinct !DILexicalBlock(scope: !641, file: !44, line: 548, column: 2)
!685 = !DILocation(line: 553, scope: !684, inlinedAt: !643)
!686 = !DILocation(line: 45, scope: !687)
!687 = distinct !DILexicalBlock(scope: !578, file: !579, line: 45, column: 15)
!688 = !DILocation(line: 45, scope: !689)
!689 = distinct !DILexicalBlock(scope: !578, file: !579, line: 45, column: 15)
!690 = distinct !DISubprogram(name: "native_temp_directory", linkageName: "std.io.os.native_temp_directory", scope: !461, file: !461, line: 14, type: !691, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!691 = !DISubroutineType(types: !692)
!692 = !{!109, !693, !49}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Path*", baseType: !460, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !DILocalVariable(name: "allocator", arg: 1, scope: !690, file: !461, line: 14, type: !49)
!695 = !DILocation(line: 14, scope: !690)
!696 = !DILocalVariable(name: "current", scope: !697, file: !461, line: 540, type: !45, align: 8)
!697 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !44, file: !44, line: 538, scopeLine: 538, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !39)
!698 = !DILocation(line: 540, scope: !697, inlinedAt: !699)
!699 = !DILocation(line: 16, scope: !690)
!700 = !DILocation(line: 396, scope: !701, inlinedAt: !698)
!701 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !75, file: !75, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!702 = !DILocation(line: 398, scope: !703, inlinedAt: !698)
!703 = distinct !DILexicalBlock(scope: !701, file: !75, line: 397, column: 2)
!704 = !DILocation(line: 400, scope: !701, inlinedAt: !698)
!705 = !DILocalVariable(name: "original", scope: !697, file: !461, line: 543, type: !45, align: 8)
!706 = !DILocation(line: 543, scope: !697, inlinedAt: !699)
!707 = !DILocation(line: 544, scope: !697, inlinedAt: !699)
!708 = !DILocalVariable(name: "mark", scope: !697, file: !461, line: 546, type: !28, align: 8)
!709 = !DILocation(line: 546, scope: !697, inlinedAt: !699)
!710 = !DILocalVariable(name: "len", scope: !711, file: !461, line: 18, type: !130, align: 4)
!711 = distinct !DILexicalBlock(scope: !690, file: !461, line: 17, column: 2)
!712 = !DILocation(line: 18, scope: !711)
!713 = !DILocation(line: 19, scope: !711)
!714 = !DILocation(line: 549, scope: !715, inlinedAt: !699)
!715 = distinct !DILexicalBlock(scope: !697, file: !44, line: 548, column: 2)
!716 = !DILocation(line: 551, scope: !715, inlinedAt: !699)
!717 = !DILocation(line: 553, scope: !715, inlinedAt: !699)
!718 = !DILocalVariable(name: "buff", scope: !711, file: !461, line: 20, type: !719, align: 8)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char16[]", size: 128, align: 64, elements: !720, identifier: "Char16[]")
!720 = !{!721, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !719, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Char16*", baseType: !723, size: 64, align: 64, dwarfAddressSpace: 0)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char16", scope: !461, file: !461, line: 9, baseType: !488, align: 2)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !719, baseType: !28, size: 64, align: 64, offset: 64)
!725 = !DILocation(line: 20, scope: !711)
!726 = !DILocation(line: 726, scope: !727, inlinedAt: !725)
!727 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !44, file: !44, line: 724, scopeLine: 724, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!728 = !DILocation(line: 21, scope: !711)
!729 = !DILocation(line: 549, scope: !730, inlinedAt: !699)
!730 = distinct !DILexicalBlock(scope: !697, file: !44, line: 548, column: 2)
!731 = !DILocation(line: 551, scope: !730, inlinedAt: !699)
!732 = !DILocation(line: 553, scope: !730, inlinedAt: !699)
!733 = !DILocation(line: 22, scope: !711)
!734 = !DILocation(line: 549, scope: !735, inlinedAt: !699)
!735 = distinct !DILexicalBlock(scope: !697, file: !44, line: 548, column: 2)
!736 = !DILocation(line: 551, scope: !735, inlinedAt: !699)
!737 = !DILocation(line: 553, scope: !735, inlinedAt: !699)
!738 = !DILocation(line: 549, scope: !739, inlinedAt: !699)
!739 = distinct !DILexicalBlock(scope: !697, file: !44, line: 548, column: 2)
!740 = !DILocation(line: 551, scope: !739, inlinedAt: !699)
!741 = !DILocation(line: 553, scope: !739, inlinedAt: !699)
